<abi-corpus version='2.1' architecture='elf-amd-x86_64'>
  <elf-needed>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- emit(std::string&) -->
    <elf-symbol name='_Z4emitRSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- emit(std::string&, std::string&) -->
    <elf-symbol name='_Z4emitRSsS_' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _fini -->
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _init -->
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='test23-first-tu.cc' comp-dir-path='/home/dodji/git/libabigail/PR20369/tests/data/test-read-dwarf' language='LANG_C_plus_plus'>
    <!-- bool -->
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <!-- struct {} -->
    <class-decl name='__anonymous_struct__' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'/>
    <!-- struct typedef __va_list_tag __va_list_tag -->
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='ce184e0c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int typedef __va_list_tag __va_list_tag::gp_offset -->
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int typedef __va_list_tag __va_list_tag::fp_offset -->
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* typedef __va_list_tag __va_list_tag::overflow_arg_area -->
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* typedef __va_list_tag __va_list_tag::reg_save_area -->
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- double -->
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <!-- float -->
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <!-- long double -->
    <type-decl name='long double' size-in-bits='128' id='e095c704'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <!-- long long int -->
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <!-- long long unsigned int -->
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <!-- unsigned long int[] -->
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='infinite' id='c99b5ecd'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' id='031f2035'/>
    </array-type-def>
    <!-- wchar_t -->
    <type-decl name='wchar_t' size-in-bits='32' id='c523b9f1'/>
    <!-- typedef int __int32_t -->
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='/usr/include/bits/types.h' line='40' column='1' id='33f57a65'/>
    <!-- typedef _IO_FILE __FILE -->
    <typedef-decl name='__FILE' type-id='ec1ed955' filepath='/usr/include/stdio.h' line='64' column='1' id='79311084'/>
    <!-- struct tm -->
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='133' column='1' id='dddf6ca2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int tm::tm_sec -->
        <var-decl name='tm_sec' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int tm::tm_min -->
        <var-decl name='tm_min' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int tm::tm_hour -->
        <var-decl name='tm_hour' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int tm::tm_mday -->
        <var-decl name='tm_mday' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int tm::tm_mon -->
        <var-decl name='tm_mon' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int tm::tm_year -->
        <var-decl name='tm_year' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int tm::tm_wday -->
        <var-decl name='tm_wday' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- int tm::tm_yday -->
        <var-decl name='tm_yday' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int tm::tm_isdst -->
        <var-decl name='tm_isdst' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- long int tm::tm_gmtoff -->
        <var-decl name='tm_gmtoff' type-id='bd54fe1a' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- const char* tm::tm_zone -->
        <var-decl name='tm_zone' type-id='80f4b756' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct __mbstate_t -->
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='55e5b2b5' visibility='default' filepath='/usr/include/wchar.h' line='83' column='1' id='87447a2e'>
      <member-type access='public'>
        <!-- union {} -->
        <union-decl name='__anonymous_union__' is-anonymous='yes' visibility='default' is-declaration-only='yes' id='ac5ab595'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int __mbstate_t::__count -->
        <var-decl name='__count' type-id='95e97e5e' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- union {} __mbstate_t::__value -->
        <var-decl name='__value' type-id='ac5ab595' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __mbstate_t __mbstate_t -->
    <typedef-decl name='__mbstate_t' type-id='87447a2e' filepath='/usr/include/wchar.h' line='94' column='1' id='55e5b2b5'/>
    <!-- typedef __mbstate_t mbstate_t -->
    <typedef-decl name='mbstate_t' type-id='55e5b2b5' filepath='/usr/include/wchar.h' line='106' column='1' id='3d7d8cbf'/>
    <!-- typedef unsigned long int wctype_t -->
    <typedef-decl name='wctype_t' type-id='7359adad' filepath='/usr/include/wctype.h' line='52' column='1' id='ba50424d'/>
    <!-- typedef const __int32_t* wctrans_t -->
    <typedef-decl name='wctrans_t' type-id='a0de50cd' filepath='/usr/include/wctype.h' line='186' column='1' id='183c72c3'/>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='7359adad' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='212' column='1' id='b59d7dce'/>
    <!-- typedef unsigned int wint_t -->
    <typedef-decl name='wint_t' type-id='f0981eeb' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='353' column='1' id='6dd37369'/>
    <!-- __FILE* -->
    <pointer-type-def type-id='79311084' size-in-bits='64' id='b9c57915'/>
    <!-- __anonymous_struct__* -->
    <pointer-type-def type-id='e7f43f72' size-in-bits='64' id='8567d8b0'/>
    <!-- char& -->
    <reference-type-def kind='lvalue' type-id='a84c031d' size-in-bits='64' id='2aa915e1'/>
    <!-- char* -->
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <!-- const __int32_t -->
    <qualified-type-def type-id='33f57a65' const='yes' id='21fd6035'/>
    <!-- const __int32_t* -->
    <pointer-type-def type-id='21fd6035' size-in-bits='64' id='a0de50cd'/>
    <!-- const allocator<char> -->
    <qualified-type-def type-id='59a919f8' const='yes' id='45157073'/>
    <!-- const allocator<char>& -->
    <reference-type-def kind='lvalue' type-id='45157073' size-in-bits='64' id='15bfd5cf'/>
    <!-- const bool -->
    <qualified-type-def type-id='c894953d' const='yes' id='4ab96a04'/>
    <!-- const char -->
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <!-- const char& -->
    <reference-type-def kind='lvalue' type-id='9b45d938' size-in-bits='64' id='8cf4ca3a'/>
    <!-- const char* -->
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <!-- const char** -->
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <!-- const int -->
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <!-- const long int -->
    <qualified-type-def type-id='bd54fe1a' const='yes' id='9cb2385f'/>
    <!-- const mbstate_t -->
    <qualified-type-def type-id='3d7d8cbf' const='yes' id='7411c98f'/>
    <!-- const mbstate_t* -->
    <pointer-type-def type-id='7411c98f' size-in-bits='64' id='5d006ebf'/>
    <!-- const short int -->
    <qualified-type-def type-id='a2185560' const='yes' id='c818c24b'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> > -->
    <qualified-type-def type-id='c2931f67' const='yes' id='69463a72'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> >& -->
    <reference-type-def kind='lvalue' type-id='69463a72' size-in-bits='64' id='0d8dd23c'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> >* -->
    <pointer-type-def type-id='69463a72' size-in-bits='64' id='118dd888'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep -->
    <qualified-type-def type-id='34601093' const='yes' id='08a514ce'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type -->
    <qualified-type-def type-id='4ababdf0' const='yes' id='b5b164a0'/>
    <!-- const tm -->
    <qualified-type-def type-id='dddf6ca2' const='yes' id='e824a34f'/>
    <!-- const tm* -->
    <pointer-type-def type-id='e824a34f' size-in-bits='64' id='d6ad37ff'/>
    <!-- const unsigned long int -->
    <qualified-type-def type-id='7359adad' const='yes' id='9cbd1c16'/>
    <!-- const wchar_t -->
    <qualified-type-def type-id='c523b9f1' const='yes' id='effb3702'/>
    <!-- const wchar_t* -->
    <pointer-type-def type-id='effb3702' size-in-bits='64' id='f077d3f8'/>
    <!-- const wchar_t** -->
    <pointer-type-def type-id='f077d3f8' size-in-bits='64' id='5ea27396'/>
    <!-- mbstate_t* -->
    <pointer-type-def type-id='3d7d8cbf' size-in-bits='64' id='a68021ce'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >& -->
    <reference-type-def kind='lvalue' type-id='c2931f67' size-in-bits='64' id='1a9350bb'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >* -->
    <pointer-type-def type-id='c2931f67' size-in-bits='64' id='16934a6f'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep& -->
    <reference-type-def kind='lvalue' type-id='34601093' size-in-bits='64' id='6f1c93e7'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep* -->
    <pointer-type-def type-id='34601093' size-in-bits='64' id='631c8103'/>
    <!-- std::string& -->
    <reference-type-def kind='lvalue' type-id='4a30a7f0' size-in-bits='64' id='0f5b8043'/>
    <!-- typedef __va_list_tag __va_list_tag* -->
    <pointer-type-def type-id='ce184e0c' size-in-bits='64' id='38f76a2a'/>
    <!-- void* -->
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <!-- wchar_t* -->
    <pointer-type-def type-id='c523b9f1' size-in-bits='64' id='323d93c1'/>
    <!-- wchar_t** -->
    <pointer-type-def type-id='323d93c1' size-in-bits='64' id='01efdaf1'/>
    <!-- struct _IO_FILE -->
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='ec1ed955'/>
    <!-- class allocator<char> -->
    <class-decl name='allocator&lt;char&gt;' visibility='default' is-declaration-only='yes' id='59a919f8'>
      <member-type access='public'>
        <!-- typedef std::size_t allocator<char>::size_type -->
        <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='95' column='1' id='d153148f'/>
      </member-type>
      <member-type access='public'>
        <!-- typedef std::ptrdiff_t allocator<char>::difference_type -->
        <typedef-decl name='difference_type' type-id='d368b855' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='96' column='1' id='424382a1'/>
      </member-type>
      <member-type access='public'>
        <!-- typedef char* allocator<char>::pointer -->
        <typedef-decl name='pointer' type-id='26a90f95' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='97' column='1' id='d240d638'/>
      </member-type>
      <member-type access='public'>
        <!-- typedef const char* allocator<char>::const_pointer -->
        <typedef-decl name='const_pointer' type-id='80f4b756' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='98' column='1' id='6b85af58'/>
      </member-type>
      <member-type access='public'>
        <!-- typedef char& allocator<char>::reference -->
        <typedef-decl name='reference' type-id='2aa915e1' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='99' column='1' id='4d4057d8'/>
      </member-type>
      <member-type access='public'>
        <!-- typedef const char& allocator<char>::const_reference -->
        <typedef-decl name='const_reference' type-id='8cf4ca3a' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='100' column='1' id='f8e8bbf8'/>
      </member-type>
    </class-decl>
    <!-- struct char_traits<char> -->
    <class-decl name='char_traits&lt;char&gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='571f63b1'>
      <member-type access='public'>
        <!-- typedef char char_traits<char>::char_type -->
        <typedef-decl name='char_type' type-id='a84c031d' filepath='/usr/include/c++/4.8.2/bits/char_traits.h' line='235' column='1' id='6a69a307'/>
      </member-type>
    </class-decl>
    <!-- struct rebind<char> -->
    <class-decl name='rebind&lt;char&gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='6733e07d'>
      <member-type access='public'>
        <!-- typedef allocator<char> rebind<char>::other -->
        <typedef-decl name='other' type-id='59a919f8' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='105' column='1' id='b3795e32'/>
      </member-type>
    </class-decl>
    <!-- namespace __gnu_cxx -->
    <namespace-decl name='__gnu_cxx'>
      <!-- class __gnu_cxx::__normal_iterator<char const*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > -->
      <class-decl name='__normal_iterator&lt;char const*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='f9b78d2a'/>
      <!-- class __gnu_cxx::__normal_iterator<char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > -->
      <class-decl name='__normal_iterator&lt;char*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='60a45a77'/>
    </namespace-decl>
    <!-- namespace std -->
    <namespace-decl name='std'>
      <!-- typedef std::basic_string<char, std::char_traits<char>, std::allocator<char> > std::string -->
      <typedef-decl name='string' type-id='c2931f67' filepath='/usr/include/c++/4.8.2/bits/stringfwd.h' line='62' column='1' id='4a30a7f0'/>
    </namespace-decl>
    <!-- namespace std -->
    <namespace-decl name='std'>
      <!-- class std::basic_string<char, std::char_traits<char>, std::allocator<char> > -->
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='112' column='1' id='c2931f67'>
        <member-type access='private'>
          <!-- typedef rebind<char>::other std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_CharT_alloc_type -->
          <typedef-decl name='_CharT_alloc_type' type-id='b3795e32' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='114' column='1' id='aeefc6a8'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef char_traits<char> std::basic_string<char, std::char_traits<char>, std::allocator<char> >::traits_type -->
          <typedef-decl name='traits_type' type-id='571f63b1' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='118' column='1' id='19935e14'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef char_traits<char>::char_type std::basic_string<char, std::char_traits<char>, std::allocator<char> >::value_type -->
          <typedef-decl name='value_type' type-id='6a69a307' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='119' column='1' id='20401f70'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef allocator<char> std::basic_string<char, std::char_traits<char>, std::allocator<char> >::allocator_type -->
          <typedef-decl name='allocator_type' type-id='59a919f8' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='120' column='1' id='582e2ec8'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef allocator<char>::size_type std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type -->
          <typedef-decl name='size_type' type-id='d153148f' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='121' column='1' id='4ababdf0'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef allocator<char>::difference_type std::basic_string<char, std::char_traits<char>, std::allocator<char> >::difference_type -->
          <typedef-decl name='difference_type' type-id='424382a1' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='122' column='1' id='2e8d8eee'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef allocator<char>::reference std::basic_string<char, std::char_traits<char>, std::allocator<char> >::reference -->
          <typedef-decl name='reference' type-id='4d4057d8' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='123' column='1' id='1f65a6a3'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef allocator<char>::const_reference std::basic_string<char, std::char_traits<char>, std::allocator<char> >::const_reference -->
          <typedef-decl name='const_reference' type-id='f8e8bbf8' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='124' column='1' id='856a05f3'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef allocator<char>::pointer std::basic_string<char, std::char_traits<char>, std::allocator<char> >::pointer -->
          <typedef-decl name='pointer' type-id='d240d638' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='125' column='1' id='5e42d43f'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef allocator<char>::const_pointer std::basic_string<char, std::char_traits<char>, std::allocator<char> >::const_pointer -->
          <typedef-decl name='const_pointer' type-id='6b85af58' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='126' column='1' id='cbc46cef'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef __gnu_cxx::__normal_iterator<char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > std::basic_string<char, std::char_traits<char>, std::allocator<char> >::iterator -->
          <typedef-decl name='iterator' type-id='60a45a77' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='127' column='1' id='5cf73f8c'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef __gnu_cxx::__normal_iterator<char const*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > std::basic_string<char, std::char_traits<char>, std::allocator<char> >::const_iterator -->
          <typedef-decl name='const_iterator' type-id='f9b78d2a' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='129' column='1' id='aa23c7bc'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef std::reverse_iterator<__gnu_cxx::__normal_iterator<char const*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > std::basic_string<char, std::char_traits<char>, std::allocator<char> >::const_reverse_iterator -->
          <typedef-decl name='const_reverse_iterator' type-id='0404b734' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='130' column='1' id='fca5e6cf'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef std::reverse_iterator<__gnu_cxx::__normal_iterator<char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > std::basic_string<char, std::char_traits<char>, std::allocator<char> >::reverse_iterator -->
          <typedef-decl name='reverse_iterator' type-id='20ab28bd' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='131' column='1' id='cfe1a53f'/>
        </member-type>
        <member-type access='private'>
          <!-- struct std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Alloc_hider -->
          <class-decl name='_Alloc_hider' is-struct='yes' visibility='default' is-declaration-only='yes' id='bab0e33c'>
            <member-function access='public' constructor='yes'>
              <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Alloc_hider::_Alloc_hider() -->
              <function-decl name='_Alloc_hider' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
                <!-- void -->
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <!-- struct std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep_base -->
          <class-decl name='_Rep_base' is-struct='yes' visibility='default' is-declaration-only='yes' id='6c007811'/>
        </member-type>
        <member-type access='private'>
          <!-- struct std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep -->
          <class-decl name='_Rep' is-struct='yes' visibility='default' is-declaration-only='yes' id='34601093'>
            <data-member access='public' static='yes'>
              <!-- static const std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep::_S_max_size -->
              <var-decl name='_S_max_size' type-id='b5b164a0' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='50' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <!-- static const char std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep::_S_terminal -->
              <var-decl name='_S_terminal' type-id='9b45d938' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='55' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <!-- static unsigned long int std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep::_S_empty_rep_storage[] -->
              <var-decl name='_S_empty_rep_storage' type-id='c99b5ecd' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='66' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <!-- static const std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type std::basic_string<char, std::char_traits<char>, std::allocator<char> >::npos -->
          <var-decl name='npos' type-id='b5b164a0' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='285' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Alloc_hider std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_M_dataplus -->
          <var-decl name='_M_dataplus' type-id='bab0e33c' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='289' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- void std::basic_string<char, std::char_traits<char>, std::allocator<char> >::basic_string() -->
          <function-decl name='basic_string' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='437' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'std::basic_string<char, std::char_traits<char>, std::allocator<char> >*' -->
            <parameter type-id='16934a6f' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void std::basic_string<char, std::char_traits<char>, std::allocator<char> >::basic_string(const allocator<char>&) -->
          <function-decl name='basic_string' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'std::basic_string<char, std::char_traits<char>, std::allocator<char> >*' -->
            <parameter type-id='16934a6f' is-artificial='yes'/>
            <!-- parameter of type 'const allocator<char>&' -->
            <parameter type-id='15bfd5cf'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void std::basic_string<char, std::char_traits<char>, std::allocator<char> >::basic_string(const std::basic_string<char, std::char_traits<char>, std::allocator<char> >&) -->
          <function-decl name='basic_string' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'std::basic_string<char, std::char_traits<char>, std::allocator<char> >*' -->
            <parameter type-id='16934a6f' is-artificial='yes'/>
            <!-- parameter of type 'const std::basic_string<char, std::char_traits<char>, std::allocator<char> >&' -->
            <parameter type-id='0d8dd23c'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void std::basic_string<char, std::char_traits<char>, std::allocator<char> >::basic_string(const std::basic_string<char, std::char_traits<char>, std::allocator<char> >&, std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type, std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type) -->
          <function-decl name='basic_string' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'std::basic_string<char, std::char_traits<char>, std::allocator<char> >*' -->
            <parameter type-id='16934a6f' is-artificial='yes'/>
            <!-- parameter of type 'const std::basic_string<char, std::char_traits<char>, std::allocator<char> >&' -->
            <parameter type-id='0d8dd23c'/>
            <!-- parameter of type 'typedef std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type' -->
            <parameter type-id='4ababdf0'/>
            <!-- parameter of type 'typedef std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type' -->
            <parameter type-id='4ababdf0'/>
            <!-- void -->
