<abi-corpus version='2.1' architecture='elf-amd-x86_64' soname='libdbus-1.so.3'>
  <elf-needed>
    <dependency name='librt.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- dbus_address_entries_free -->
    <elf-symbol name='dbus_address_entries_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_address_entry_get_method -->
    <elf-symbol name='dbus_address_entry_get_method' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_address_entry_get_value -->
    <elf-symbol name='dbus_address_entry_get_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_address_escape_value -->
    <elf-symbol name='dbus_address_escape_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_address_unescape_value -->
    <elf-symbol name='dbus_address_unescape_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_bus_add_match -->
    <elf-symbol name='dbus_bus_add_match' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_bus_get -->
    <elf-symbol name='dbus_bus_get' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <!-- dbus_signature_iter_next -->
    <elf-symbol name='dbus_signature_iter_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_signature_iter_recurse -->
    <elf-symbol name='dbus_signature_iter_recurse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_signature_validate -->
    <elf-symbol name='dbus_signature_validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_signature_validate_single -->
    <elf-symbol name='dbus_signature_validate_single' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_threads_init -->
    <elf-symbol name='dbus_threads_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_threads_init_default -->
    <elf-symbol name='dbus_threads_init_default' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_get_data -->
    <elf-symbol name='dbus_timeout_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_get_enabled -->
    <elf-symbol name='dbus_timeout_get_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_get_interval -->
    <elf-symbol name='dbus_timeout_get_interval' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_handle -->
    <elf-symbol name='dbus_timeout_handle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_timeout_set_data -->
    <elf-symbol name='dbus_timeout_set_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_type_is_basic -->
    <elf-symbol name='dbus_type_is_basic' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_type_is_container -->
    <elf-symbol name='dbus_type_is_container' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_type_is_fixed -->
    <elf-symbol name='dbus_type_is_fixed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_type_is_valid -->
    <elf-symbol name='dbus_type_is_valid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_bus_name -->
    <elf-symbol name='dbus_validate_bus_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_error_name -->
    <elf-symbol name='dbus_validate_error_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_interface -->
    <elf-symbol name='dbus_validate_interface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_member -->
    <elf-symbol name='dbus_validate_member' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_path -->
    <elf-symbol name='dbus_validate_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_validate_utf8 -->
    <elf-symbol name='dbus_validate_utf8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_data -->
    <elf-symbol name='dbus_watch_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_enabled -->
    <elf-symbol name='dbus_watch_get_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_fd -->
    <elf-symbol name='dbus_watch_get_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_flags -->
    <elf-symbol name='dbus_watch_get_flags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_socket -->
    <elf-symbol name='dbus_watch_get_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_get_unix_fd -->
    <elf-symbol name='dbus_watch_get_unix_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_handle -->
    <elf-symbol name='dbus_watch_handle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- dbus_watch_set_data -->
    <elf-symbol name='dbus_watch_set_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='dbus-address.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <!-- typedef unsigned int dbus_uint32_t -->
    <typedef-decl name='dbus_uint32_t' type-id='f0981eeb' filepath='../dbus/dbus-arch-deps.h' line='43' column='1' id='9086907d'/>
    <!-- typedef DBusError DBusError -->
    <typedef-decl name='DBusError' type-id='4f5d0173' filepath='../dbus/dbus-errors.h' line='43' column='1' id='740e0640'/>
    <!-- struct DBusError -->
    <class-decl name='DBusError' size-in-bits='256' is-struct='yes' visibility='default' filepath='../dbus/dbus-errors.h' line='49' column='1' id='4f5d0173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* DBusError::name -->
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='../dbus/dbus-errors.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* DBusError::message -->
        <var-decl name='message' type-id='80f4b756' visibility='default' filepath='../dbus/dbus-errors.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int DBusError::dummy1 -->
        <var-decl name='dummy1' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-errors.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129'>
        <!-- unsigned int DBusError::dummy2 -->
        <var-decl name='dummy2' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-errors.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='130'>
        <!-- unsigned int DBusError::dummy3 -->
        <var-decl name='dummy3' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-errors.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131'>
        <!-- unsigned int DBusError::dummy4 -->
        <var-decl name='dummy4' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-errors.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132'>
        <!-- unsigned int DBusError::dummy5 -->
        <var-decl name='dummy5' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-errors.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* DBusError::padding1 -->
        <var-decl name='padding1' type-id='eaa32e2f' visibility='default' filepath='../dbus/dbus-errors.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusString DBusString -->
    <typedef-decl name='DBusString' type-id='f8eebf6e' filepath='../dbus/dbus-string.h' line='40' column='1' id='7d741547'/>
    <!-- struct DBusString -->
    <class-decl name='DBusString' size-in-bits='192' is-struct='yes' visibility='default' filepath='../dbus/dbus-string.h' line='43' column='1' id='f8eebf6e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* DBusString::dummy1 -->
        <var-decl name='dummy1' type-id='eaa32e2f' visibility='default' filepath='../dbus/dbus-string.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int DBusString::dummy2 -->
        <var-decl name='dummy2' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-string.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int DBusString::dummy3 -->
        <var-decl name='dummy3' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-string.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int DBusString::dummy_bit1 -->
        <var-decl name='dummy_bit1' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-string.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129'>
        <!-- unsigned int DBusString::dummy_bit2 -->
        <var-decl name='dummy_bit2' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-string.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='130'>
        <!-- unsigned int DBusString::dummy_bit3 -->
        <var-decl name='dummy_bit3' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-string.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131'>
        <!-- unsigned int DBusString::dummy_bits -->
        <var-decl name='dummy_bits' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-string.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusList DBusList -->
    <typedef-decl name='DBusList' type-id='67a60633' filepath='../dbus/dbus-sysdeps.h' line='74' column='1' id='8ad1e022'/>
    <!-- typedef dbus_uint32_t dbus_bool_t -->
    <typedef-decl name='dbus_bool_t' type-id='9086907d' filepath='../dbus/dbus-types.h' line='35' column='1' id='3cc8ee4c'/>
    <!-- struct DBusAddressEntry -->
    <class-decl name='DBusAddressEntry' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='44' column='1' id='17e63207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusString DBusAddressEntry::method -->
        <var-decl name='method' type-id='7d741547' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusList* DBusAddressEntry::keys -->
        <var-decl name='keys' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- DBusList* DBusAddressEntry::values -->
        <var-decl name='values' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='48' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusAddressEntry DBusAddressEntry -->
    <typedef-decl name='DBusAddressEntry' type-id='17e63207' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.h' line='41' column='1' id='d7da5706'/>
    <!-- struct DBusList -->
    <class-decl name='DBusList' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='35' column='1' id='67a60633'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusList* DBusList::prev -->
        <var-decl name='prev' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusList* DBusList::next -->
        <var-decl name='next' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* DBusList::data -->
        <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <!-- DBusAddressEntry* -->
    <pointer-type-def type-id='d7da5706' size-in-bits='64' id='5b59ee6f'/>
    <!-- DBusAddressEntry** -->
    <pointer-type-def type-id='5b59ee6f' size-in-bits='64' id='1392169f'/>
    <!-- DBusAddressEntry*** -->
    <pointer-type-def type-id='1392169f' size-in-bits='64' id='83f9beef'/>
    <!-- DBusError* -->
    <pointer-type-def type-id='740e0640' size-in-bits='64' id='bb26f813'/>
    <!-- DBusList* -->
    <pointer-type-def type-id='8ad1e022' size-in-bits='64' id='860c24f3'/>
    <!-- char* -->
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <!-- const char -->
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <!-- const char* -->
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <!-- int* -->
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <!-- void* -->
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <!-- void dbus_address_entries_free(DBusAddressEntry**) -->
    <function-decl name='dbus_address_entries_free' mangled-name='dbus_address_entries_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entries_free'>
      <!-- parameter of type 'DBusAddressEntry**' -->
      <parameter type-id='1392169f' name='entries' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='189' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- const char* dbus_address_entry_get_method(DBusAddressEntry*) -->
    <function-decl name='dbus_address_entry_get_method' mangled-name='dbus_address_entry_get_method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entry_get_method'>
      <!-- parameter of type 'DBusAddressEntry*' -->
      <parameter type-id='5b59ee6f' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='227' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- const char* dbus_address_entry_get_value(DBusAddressEntry*, const char*) -->
    <function-decl name='dbus_address_entry_get_value' mangled-name='dbus_address_entry_get_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entry_get_value'>
      <!-- parameter of type 'DBusAddressEntry*' -->
      <parameter type-id='5b59ee6f' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='244' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='245' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- dbus_bool_t dbus_parse_address(const char*, DBusAddressEntry***, int*, DBusError*) -->
    <function-decl name='dbus_parse_address' mangled-name='dbus_parse_address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_parse_address'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='363' column='1'/>
      <!-- parameter of type 'DBusAddressEntry***' -->
      <parameter type-id='83f9beef' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='364' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='7292109c' name='array_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='365' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='366' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- char* dbus_address_escape_value(const char*) -->
    <function-decl name='dbus_address_escape_value' mangled-name='dbus_address_escape_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_escape_value'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='583' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- char* dbus_address_unescape_value(const char*, DBusError*) -->
    <function-decl name='dbus_address_unescape_value' mangled-name='dbus_address_unescape_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='617' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_unescape_value'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='617' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='618' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- void -->
    <type-decl name='void' id='48b5725f'/>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-bus.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <!-- typedef DBusConnection DBusConnection -->
    <typedef-decl name='DBusConnection' type-id='9926af9b' filepath='../dbus/dbus-connection.h' line='51' column='1' id='5627a592'/>
    <!-- enum DBusBusType -->
    <enum-decl name='DBusBusType' naming-typedef-id='ae9febe0' filepath='../dbus/dbus-shared.h' line='57' column='1' id='676809d4'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DBUS_BUS_SESSION' value='0'/>
      <enumerator name='DBUS_BUS_SYSTEM' value='1'/>
      <enumerator name='DBUS_BUS_STARTER' value='2'/>
    </enum-decl>
    <!-- typedef DBusBusType DBusBusType -->
    <typedef-decl name='DBusBusType' type-id='676809d4' filepath='../dbus/dbus-shared.h' line='61' column='1' id='ae9febe0'/>
    <!-- DBusConnection* -->
    <pointer-type-def type-id='5627a592' size-in-bits='64' id='a25b1cfb'/>
    <!-- dbus_uint32_t* -->
    <pointer-type-def type-id='9086907d' size-in-bits='64' id='e90fbcd4'/>
    <!-- struct DBusConnection -->
    <class-decl name='DBusConnection' size-in-bits='2112' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='257' column='1' id='9926af9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusAtomic DBusConnection::refcount -->
        <var-decl name='refcount' type-id='1000c06f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusRMutex* DBusConnection::mutex -->
        <var-decl name='mutex' type-id='fa4b2ae4' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- DBusCMutex* DBusConnection::dispatch_mutex -->
        <var-decl name='dispatch_mutex' type-id='9270a98b' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusCondVar* DBusConnection::dispatch_cond -->
        <var-decl name='dispatch_cond' type-id='700d1892' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- DBusCMutex* DBusConnection::io_path_mutex -->
        <var-decl name='io_path_mutex' type-id='9270a98b' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- DBusCondVar* DBusConnection::io_path_cond -->
        <var-decl name='io_path_cond' type-id='700d1892' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- DBusList* DBusConnection::outgoing_messages -->
        <var-decl name='outgoing_messages' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- DBusList* DBusConnection::incoming_messages -->
        <var-decl name='incoming_messages' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- DBusList* DBusConnection::expired_messages -->
        <var-decl name='expired_messages' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- DBusMessage* DBusConnection::message_borrowed -->
        <var-decl name='message_borrowed' type-id='77ff0180' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- int DBusConnection::n_outgoing -->
        <var-decl name='n_outgoing' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- int DBusConnection::n_incoming -->
        <var-decl name='n_incoming' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- DBusCounter* DBusConnection::outgoing_counter -->
        <var-decl name='outgoing_counter' type-id='b50eaaed' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- DBusTransport* DBusConnection::transport -->
        <var-decl name='transport' type-id='da14ea16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- DBusWatchList* DBusConnection::watches -->
        <var-decl name='watches' type-id='d6d1021c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- DBusTimeoutList* DBusConnection::timeouts -->
        <var-decl name='timeouts' type-id='3dbedd50' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- DBusList* DBusConnection::filter_list -->
        <var-decl name='filter_list' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- DBusRMutex* DBusConnection::slot_mutex -->
        <var-decl name='slot_mutex' type-id='fa4b2ae4' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- DBusDataSlotList DBusConnection::slot_list -->
        <var-decl name='slot_list' type-id='e381768e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- DBusHashTable* DBusConnection::pending_replies -->
        <var-decl name='pending_replies' type-id='a4aa47bd' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- dbus_uint32_t DBusConnection::client_serial -->
        <var-decl name='client_serial' type-id='9086907d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- DBusList* DBusConnection::disconnect_message_link -->
        <var-decl name='disconnect_message_link' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- DBusWakeupMainFunction DBusConnection::wakeup_main_function -->
        <var-decl name='wakeup_main_function' type-id='d976896e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- void* DBusConnection::wakeup_main_data -->
        <var-decl name='wakeup_main_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- DBusFreeFunction DBusConnection::free_wakeup_main_data -->
        <var-decl name='free_wakeup_main_data' type-id='ddc1415c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <!-- DBusDispatchStatusFunction DBusConnection::dispatch_status_function -->
        <var-decl name='dispatch_status_function' type-id='812f2056' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <!-- void* DBusConnection::dispatch_status_data -->
        <var-decl name='dispatch_status_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <!-- DBusFreeFunction DBusConnection::free_dispatch_status_data -->
        <var-decl name='free_dispatch_status_data' type-id='ddc1415c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <!-- DBusDispatchStatus DBusConnection::last_dispatch_status -->
        <var-decl name='last_dispatch_status' type-id='770545c2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <!-- DBusObjectTree* DBusConnection::objects -->
        <var-decl name='objects' type-id='5ec9adbe' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <!-- char* DBusConnection::server_guid -->
        <var-decl name='server_guid' type-id='26a90f95' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <!-- dbus_bool_t DBusConnection::dispatch_acquired -->
        <var-decl name='dispatch_acquired' type-id='3cc8ee4c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <!-- dbus_bool_t DBusConnection::io_path_acquired -->
        <var-decl name='io_path_acquired' type-id='3cc8ee4c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- unsigned int DBusConnection::shareable -->
        <var-decl name='shareable' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2049'>
        <!-- unsigned int DBusConnection::exit_on_disconnect -->
        <var-decl name='exit_on_disconnect' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2050'>
        <!-- unsigned int DBusConnection::route_peer_messages -->
        <var-decl name='route_peer_messages' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2051'>
        <!-- unsigned int DBusConnection::disconnected_message_arrived -->
        <var-decl name='disconnected_message_arrived' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2052'>
        <!-- unsigned int DBusConnection::disconnected_message_processed -->
        <var-decl name='disconnected_message_processed' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2053'>
        <!-- unsigned int DBusConnection::have_connection_lock -->
        <var-decl name='have_connection_lock' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <!-- int DBusConnection::generation -->
        <var-decl name='generation' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='334' column='1'/>
      </data-member>
    </class-decl>
    <!-- DBusConnection* dbus_bus_get(DBusBusType, DBusError*) -->
    <function-decl name='dbus_bus_get' mangled-name='dbus_bus_get' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get'>
      <!-- parameter of type 'typedef DBusBusType' -->
      <parameter type-id='ae9febe0' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='558' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='559' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='a25b1cfb'/>
    </function-decl>
    <!-- DBusConnection* dbus_bus_get_private(DBusBusType, DBusError*) -->
    <function-decl name='dbus_bus_get_private' mangled-name='dbus_bus_get_private' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_private'>
      <!-- parameter of type 'typedef DBusBusType' -->
      <parameter type-id='ae9febe0' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='590' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='591' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='a25b1cfb'/>
    </function-decl>
    <!-- dbus_bool_t dbus_bus_register(DBusConnection*, DBusError*) -->
    <function-decl name='dbus_bus_register' mangled-name='dbus_bus_register' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_register'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='646' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='647' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_bus_set_unique_name(DBusConnection*, const char*) -->
    <function-decl name='dbus_bus_set_unique_name' mangled-name='dbus_bus_set_unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_set_unique_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='766' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='767' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- const char* dbus_bus_get_unique_name(DBusConnection*) -->
    <function-decl name='dbus_bus_get_unique_name' mangled-name='dbus_bus_get_unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_unique_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='815' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- unsigned long int dbus_bus_get_unix_user(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_get_unix_user' mangled-name='dbus_bus_get_unix_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='865' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_unix_user'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='865' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='866' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='867' column='1'/>
      <!-- unsigned long int -->
      <return type-id='7359adad'/>
    </function-decl>
    <!-- char* dbus_bus_get_id(DBusConnection*, DBusError*) -->
    <function-decl name='dbus_bus_get_id' mangled-name='dbus_bus_get_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_id'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='948' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='949' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- int dbus_bus_request_name(DBusConnection*, const char*, unsigned int, DBusError*) -->
    <function-decl name='dbus_bus_request_name' mangled-name='dbus_bus_request_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_request_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1112' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1113' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1114' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1115' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int dbus_bus_release_name(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_release_name' mangled-name='dbus_bus_release_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_release_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1198' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1199' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1200' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- dbus_bool_t dbus_bus_name_has_owner(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_name_has_owner' mangled-name='dbus_bus_name_has_owner' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_name_has_owner'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1280' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1281' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1282' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_bus_start_service_by_name(DBusConnection*, const char*, dbus_uint32_t, dbus_uint32_t*, DBusError*) -->
    <function-decl name='dbus_bus_start_service_by_name' mangled-name='dbus_bus_start_service_by_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_start_service_by_name'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1356' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1357' column='1'/>
      <!-- parameter of type 'typedef dbus_uint32_t' -->
      <parameter type-id='9086907d' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1358' column='1'/>
      <!-- parameter of type 'dbus_uint32_t*' -->
      <parameter type-id='e90fbcd4' name='result' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1359' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1360' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_bus_add_match(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_add_match' mangled-name='dbus_bus_add_match' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_add_match'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1526' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='rule' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1527' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1528' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_bus_remove_match(DBusConnection*, const char*, DBusError*) -->
    <function-decl name='dbus_bus_remove_match' mangled-name='dbus_bus_remove_match' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_remove_match'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1576' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='rule' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1577' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1578' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-connection.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- DBusHeaderField[10] -->
    <array-type-def dimensions='1' type-id='5f771b49' size-in-bits='320' id='4797b821'>
      <!-- <anonymous range>[10] -->
      <subrange length='10' type-id='7359adad' id='487da03a'/>
    </array-type-def>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <!-- typedef int dbus_int32_t -->
    <typedef-decl name='dbus_int32_t' type-id='95e97e5e' filepath='../dbus/dbus-arch-deps.h' line='42' column='1' id='9107d76e'/>
    <!-- typedef DBusDataSlotList DBusDataSlotList -->
    <typedef-decl name='DBusDataSlotList' type-id='ca2e2627' filepath='../dbus/dbus-dataslot.h' line='31' column='1' id='e381768e'/>
    <!-- typedef DBusDataSlot DBusDataSlot -->
    <typedef-decl name='DBusDataSlot' type-id='51a2367f' filepath='../dbus/dbus-dataslot.h' line='34' column='1' id='f10c9972'/>
    <!-- struct DBusDataSlot -->
    <class-decl name='DBusDataSlot' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='37' column='1' id='51a2367f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* DBusDataSlot::data -->
        <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='../dbus/dbus-dataslot.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusFreeFunction DBusDataSlot::free_data_func -->
        <var-decl name='free_data_func' type-id='ddc1415c' visibility='default' filepath='../dbus/dbus-dataslot.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusDataSlotList -->
    <class-decl name='DBusDataSlotList' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='70' column='1' id='ca2e2627'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusDataSlot* DBusDataSlotList::slots -->
        <var-decl name='slots' type-id='46315687' visibility='default' filepath='../dbus/dbus-dataslot.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int DBusDataSlotList::n_slots -->
        <var-decl name='n_slots' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-dataslot.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusHeader DBusHeader -->
    <typedef-decl name='DBusHeader' type-id='37633c2a' filepath='../dbus/dbus-marshal-header.h' line='30' column='1' id='a50e11b7'/>
    <!-- typedef DBusHeaderField DBusHeaderField -->
    <typedef-decl name='DBusHeaderField' type-id='da0ff8be' filepath='../dbus/dbus-marshal-header.h' line='31' column='1' id='5f771b49'/>
    <!-- struct DBusHeaderField -->
    <class-decl name='DBusHeaderField' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='40' column='1' id='da0ff8be'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int DBusHeaderField::value_pos -->
        <var-decl name='value_pos' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusHeader -->
    <class-decl name='DBusHeader' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='48' column='1' id='37633c2a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusString DBusHeader::data -->
        <var-decl name='data' type-id='7d741547' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusHeaderField DBusHeader::fields[10] -->
        <var-decl name='fields' type-id='4797b821' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- dbus_uint32_t DBusHeader::padding -->
        <var-decl name='padding' type-id='9086907d' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='515'>
        <!-- dbus_uint32_t DBusHeader::byte_order -->
        <var-decl name='byte_order' type-id='9086907d' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef void (void*)* DBusFreeFunction -->
    <typedef-decl name='DBusFreeFunction' type-id='b7f9d8e6' filepath='../dbus/dbus-memory.h' line='64' column='1' id='ddc1415c'/>
    <!-- typedef DBusMessage DBusMessage -->
    <typedef-decl name='DBusMessage' type-id='473632d2' filepath='../dbus/dbus-message.h' line='44' column='1' id='45094a95'/>
    <!-- typedef DBusCounter DBusCounter -->
    <typedef-decl name='DBusCounter' type-id='53ebc74d' filepath='../dbus/dbus-resources.h' line='32' column='1' id='6ac856b6'/>
    <!-- typedef DBusAtomic DBusAtomic -->
    <typedef-decl name='DBusAtomic' type-id='12b3356e' filepath='../dbus/dbus-sysdeps.h' line='222' column='1' id='1000c06f'/>
    <!-- struct DBusAtomic -->
    <class-decl name='DBusAtomic' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='228' column='1' id='12b3356e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- volatile dbus_int32_t DBusAtomic::value -->
        <var-decl name='value' type-id='45290571' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusRMutex DBusRMutex -->
    <typedef-decl name='DBusRMutex' type-id='32b69a8e' filepath='../dbus/dbus-threads-internal.h' line='39' column='1' id='0b952637'/>
    <!-- typedef DBusCMutex DBusCMutex -->
    <typedef-decl name='DBusCMutex' type-id='7dd0d8ab' filepath='../dbus/dbus-threads-internal.h' line='45' column='1' id='3f742c1a'/>
    <!-- typedef DBusCondVar DBusCondVar -->
    <typedef-decl name='DBusCondVar' type-id='e09597a4' filepath='../dbus/dbus-threads.h' line='43' column='1' id='c0f44227'/>
    <!-- struct DBusPreallocatedSend -->
    <class-decl name='DBusPreallocatedSend' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='241' column='1' id='febaa03f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusConnection* DBusPreallocatedSend::connection -->
        <var-decl name='connection' type-id='a25b1cfb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusList* DBusPreallocatedSend::queue_link -->
        <var-decl name='queue_link' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- DBusList* DBusPreallocatedSend::counter_link -->
        <var-decl name='counter_link' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='244' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusWatch DBusWatch -->
    <typedef-decl name='DBusWatch' type-id='dc4355ea' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='43' column='1' id='b6c727f5'/>
    <!-- typedef DBusTimeout DBusTimeout -->
    <typedef-decl name='DBusTimeout' type-id='54869c76' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='45' column='1' id='3d58aa21'/>
    <!-- typedef DBusPreallocatedSend DBusPreallocatedSend -->
    <typedef-decl name='DBusPreallocatedSend' type-id='febaa03f' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='47' column='1' id='c7818976'/>
    <!-- typedef DBusPendingCall DBusPendingCall -->
    <typedef-decl name='DBusPendingCall' type-id='d286a1ae' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='49' column='1' id='ca108f9d'/>
    <!-- typedef DBusObjectPathVTable DBusObjectPathVTable -->
    <typedef-decl name='DBusObjectPathVTable' type-id='35b3db65' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='53' column='1' id='e6772f94'/>
    <!-- enum DBusDispatchStatus -->
    <enum-decl name='DBusDispatchStatus' naming-typedef-id='770545c2' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='80' column='1' id='ac594d0e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DBUS_DISPATCH_DATA_REMAINS' value='0'/>
      <enumerator name='DBUS_DISPATCH_COMPLETE' value='1'/>
      <enumerator name='DBUS_DISPATCH_NEED_MEMORY' value='2'/>
    </enum-decl>
    <!-- typedef DBusDispatchStatus DBusDispatchStatus -->
    <typedef-decl name='DBusDispatchStatus' type-id='ac594d0e' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='84' column='1' id='770545c2'/>
    <!-- typedef typedef dbus_bool_t (DBusWatch*, void*)* DBusAddWatchFunction -->
    <typedef-decl name='DBusAddWatchFunction' type-id='f57bf6c4' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='91' column='1' id='0bde67d0'/>
    <!-- typedef void (DBusWatch*, void*)* DBusWatchToggledFunction -->
    <typedef-decl name='DBusWatchToggledFunction' type-id='057cd9d9' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='97' column='1' id='2762a4e3'/>
    <!-- typedef void (DBusWatch*, void*)* DBusRemoveWatchFunction -->
    <typedef-decl name='DBusRemoveWatchFunction' type-id='057cd9d9' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='103' column='1' id='86b61a5d'/>
    <!-- typedef typedef dbus_bool_t (DBusTimeout*, void*)* DBusAddTimeoutFunction -->
    <typedef-decl name='DBusAddTimeoutFunction' type-id='ec4cf230' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='110' column='1' id='7afc4cf0'/>
    <!-- typedef void (DBusTimeout*, void*)* DBusTimeoutToggledFunction -->
    <typedef-decl name='DBusTimeoutToggledFunction' type-id='d849c399' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='117' column='1' id='a9588fff'/>
    <!-- typedef void (DBusTimeout*, void*)* DBusRemoveTimeoutFunction -->
    <typedef-decl name='DBusRemoveTimeoutFunction' type-id='d849c399' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='123' column='1' id='c639be29'/>
    <!-- typedef void (DBusConnection*, typedef DBusDispatchStatus, void*)* DBusDispatchStatusFunction -->
    <typedef-decl name='DBusDispatchStatusFunction' type-id='80e4d755' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='128' column='1' id='812f2056'/>
    <!-- typedef void (void*)* DBusWakeupMainFunction -->
    <typedef-decl name='DBusWakeupMainFunction' type-id='b7f9d8e6' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='135' column='1' id='d976896e'/>
    <!-- typedef typedef dbus_bool_t (DBusConnection*, unsigned long int, void*)* DBusAllowUnixUserFunction -->
    <typedef-decl name='DBusAllowUnixUserFunction' type-id='5a66a449' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='143' column='1' id='f25ccf06'/>
    <!-- typedef typedef dbus_bool_t (DBusConnection*, const char*, void*)* DBusAllowWindowsUserFunction -->
    <typedef-decl name='DBusAllowWindowsUserFunction' type-id='ff0566cc' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='153' column='1' id='c9b65873'/>
    <!-- typedef typedef DBusHandlerResult (DBusConnection*, DBusMessage*, void*)* DBusHandleMessageFunction -->
    <typedef-decl name='DBusHandleMessageFunction' type-id='c938de37' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='169' column='1' id='4aae3da7'/>
    <!-- typedef void (DBusConnection*, void*)* DBusObjectPathUnregisterFunction -->
    <typedef-decl name='DBusObjectPathUnregisterFunction' type-id='cd9549e0' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='367' column='1' id='aa4cdf48'/>
    <!-- typedef typedef DBusHandlerResult (DBusConnection*, DBusMessage*, void*)* DBusObjectPathMessageFunction -->
    <typedef-decl name='DBusObjectPathMessageFunction' type-id='c938de37' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='374' column='1' id='0d079289'/>
    <!-- struct DBusObjectPathVTable -->
    <class-decl name='DBusObjectPathVTable' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='385' column='1' id='35b3db65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusObjectPathUnregisterFunction DBusObjectPathVTable::unregister_function -->
        <var-decl name='unregister_function' type-id='aa4cdf48' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusObjectPathMessageFunction DBusObjectPathVTable::message_function -->
        <var-decl name='message_function' type-id='0d079289' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad1 -->
        <var-decl name='dbus_internal_pad1' type-id='b7f9d8e6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad2 -->
        <var-decl name='dbus_internal_pad2' type-id='b7f9d8e6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad3 -->
        <var-decl name='dbus_internal_pad3' type-id='b7f9d8e6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad4 -->
        <var-decl name='dbus_internal_pad4' type-id='b7f9d8e6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='392' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusHashTable DBusHashTable -->
    <typedef-decl name='DBusHashTable' type-id='ee751e0d' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-hash.h' line='59' column='1' id='ce04288e'/>
    <!-- struct DBusMessage -->
    <class-decl name='DBusMessage' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='100' column='1' id='473632d2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusAtomic DBusMessage::refcount -->
        <var-decl name='refcount' type-id='1000c06f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusHeader DBusMessage::header -->
        <var-decl name='header' type-id='a50e11b7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- DBusString DBusMessage::body -->
        <var-decl name='body' type-id='7d741547' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- unsigned int DBusMessage::locked -->
        <var-decl name='locked' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='833'>
        <!-- unsigned int DBusMessage::in_cache -->
        <var-decl name='in_cache' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- DBusList* DBusMessage::counters -->
        <var-decl name='counters' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- long int DBusMessage::size_counter_delta -->
        <var-decl name='size_counter_delta' type-id='bd54fe1a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- dbus_uint32_t DBusMessage::changed_stamp -->
        <var-decl name='changed_stamp' type-id='9086907d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- DBusDataSlotList DBusMessage::slot_list -->
        <var-decl name='slot_list' type-id='e381768e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- int DBusMessage::generation -->
        <var-decl name='generation' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- int* DBusMessage::unix_fds -->
        <var-decl name='unix_fds' type-id='7292109c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- unsigned int DBusMessage::n_unix_fds -->
        <var-decl name='n_unix_fds' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <!-- unsigned int DBusMessage::n_unix_fds_allocated -->
        <var-decl name='n_unix_fds_allocated' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- long int DBusMessage::unix_fd_counter_delta -->
        <var-decl name='unix_fd_counter_delta' type-id='bd54fe1a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusObjectTree DBusObjectTree -->
    <typedef-decl name='DBusObjectTree' type-id='ec8dcf68' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-object-tree.h' line='30' column='1' id='84b94705'/>
    <!-- enum DBusHandlerResult -->
    <enum-decl name='DBusHandlerResult' naming-typedef-id='2cbc28cf' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='67' column='1' id='a224cddb'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DBUS_HANDLER_RESULT_HANDLED' value='0'/>
      <enumerator name='DBUS_HANDLER_RESULT_NOT_YET_HANDLED' value='1'/>
      <enumerator name='DBUS_HANDLER_RESULT_NEED_MEMORY' value='2'/>
    </enum-decl>
    <!-- typedef DBusHandlerResult DBusHandlerResult -->
    <typedef-decl name='DBusHandlerResult' type-id='a224cddb' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='71' column='1' id='2cbc28cf'/>
    <!-- typedef DBusTimeoutList DBusTimeoutList -->
    <typedef-decl name='DBusTimeoutList' type-id='9b71e0e2' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='38' column='1' id='bbe98fed'/>
    <!-- typedef DBusTransport DBusTransport -->
    <typedef-decl name='DBusTransport' type-id='88618050' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-transport.h' line='33' column='1' id='906b0593'/>
    <!-- typedef DBusWatchList DBusWatchList -->
    <typedef-decl name='DBusWatchList' type-id='35965606' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='38' column='1' id='b74955d1'/>
    <!-- DBusCMutex* -->
    <pointer-type-def type-id='3f742c1a' size-in-bits='64' id='9270a98b'/>
    <!-- DBusCondVar* -->
    <pointer-type-def type-id='c0f44227' size-in-bits='64' id='700d1892'/>
    <!-- DBusCounter* -->
    <pointer-type-def type-id='6ac856b6' size-in-bits='64' id='b50eaaed'/>
    <!-- DBusDataSlot* -->
    <pointer-type-def type-id='f10c9972' size-in-bits='64' id='46315687'/>
    <!-- DBusHashTable* -->
    <pointer-type-def type-id='ce04288e' size-in-bits='64' id='a4aa47bd'/>
    <!-- DBusMessage* -->
    <pointer-type-def type-id='45094a95' size-in-bits='64' id='77ff0180'/>
    <!-- DBusObjectTree* -->
    <pointer-type-def type-id='84b94705' size-in-bits='64' id='5ec9adbe'/>
    <!-- DBusPendingCall* -->
    <pointer-type-def type-id='ca108f9d' size-in-bits='64' id='7ff886a4'/>
    <!-- DBusPendingCall** -->
    <pointer-type-def type-id='7ff886a4' size-in-bits='64' id='023bd18a'/>
    <!-- DBusPreallocatedSend* -->
    <pointer-type-def type-id='c7818976' size-in-bits='64' id='35966c87'/>
    <!-- DBusRMutex* -->
    <pointer-type-def type-id='0b952637' size-in-bits='64' id='fa4b2ae4'/>
    <!-- DBusTimeout* -->
    <pointer-type-def type-id='3d58aa21' size-in-bits='64' id='61f110cc'/>
    <!-- DBusTimeoutList* -->
    <pointer-type-def type-id='bbe98fed' size-in-bits='64' id='3dbedd50'/>
    <!-- DBusTransport* -->
    <pointer-type-def type-id='906b0593' size-in-bits='64' id='da14ea16'/>
    <!-- DBusWatch* -->
    <pointer-type-def type-id='b6c727f5' size-in-bits='64' id='36f9a538'/>
    <!-- DBusWatchList* -->
    <pointer-type-def type-id='b74955d1' size-in-bits='64' id='d6d1021c'/>
    <!-- char** -->
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <!-- char*** -->
    <pointer-type-def type-id='9b23c9ad' size-in-bits='64' id='c0563f85'/>
    <!-- const DBusObjectPathVTable -->
    <qualified-type-def type-id='e6772f94' const='yes' id='a9fe31c4'/>
    <!-- const DBusObjectPathVTable* -->
    <pointer-type-def type-id='a9fe31c4' size-in-bits='64' id='892899aa'/>
    <!-- dbus_int32_t* -->
    <pointer-type-def type-id='9107d76e' size-in-bits='64' id='2a22110b'/>
    <!-- typedef DBusHandlerResult (DBusConnection*, DBusMessage*, void*)* -->
    <pointer-type-def type-id='bf585833' size-in-bits='64' id='c938de37'/>
    <!-- typedef dbus_bool_t (DBusConnection*, const char*, void*)* -->
    <pointer-type-def type-id='8b0e432a' size-in-bits='64' id='ff0566cc'/>
    <!-- typedef dbus_bool_t (DBusConnection*, unsigned long int, void*)* -->
    <pointer-type-def type-id='0ae2fc9d' size-in-bits='64' id='5a66a449'/>
    <!-- typedef dbus_bool_t (DBusTimeout*, void*)* -->
    <pointer-type-def type-id='6d7f6e3e' size-in-bits='64' id='ec4cf230'/>
    <!-- typedef dbus_bool_t (DBusWatch*, void*)* -->
    <pointer-type-def type-id='20b6e28a' size-in-bits='64' id='f57bf6c4'/>
    <!-- unsigned long int* -->
    <pointer-type-def type-id='7359adad' size-in-bits='64' id='1d2c2b85'/>
    <!-- void (DBusConnection*, typedef DBusDispatchStatus, void*)* -->
    <pointer-type-def type-id='25efba21' size-in-bits='64' id='80e4d755'/>
    <!-- void (DBusConnection*, void*)* -->
    <pointer-type-def type-id='0d2d75f6' size-in-bits='64' id='cd9549e0'/>
    <!-- void (DBusTimeout*, void*)* -->
    <pointer-type-def type-id='177be825' size-in-bits='64' id='d849c399'/>
    <!-- void (DBusWatch*, void*)* -->
    <pointer-type-def type-id='94ca0625' size-in-bits='64' id='057cd9d9'/>
    <!-- void (void*)* -->
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <!-- void** -->
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <!-- volatile dbus_int32_t -->
    <qualified-type-def type-id='9107d76e' volatile='yes' id='45290571'/>
    <!-- struct DBusCMutex -->
    <class-decl name='DBusCMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='7dd0d8ab'/>
    <!-- struct DBusCondVar -->
    <class-decl name='DBusCondVar' is-struct='yes' visibility='default' is-declaration-only='yes' id='e09597a4'/>
    <!-- struct DBusCounter -->
    <class-decl name='DBusCounter' is-struct='yes' visibility='default' is-declaration-only='yes' id='53ebc74d'/>
    <!-- struct DBusHashTable -->
    <class-decl name='DBusHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='ee751e0d'/>
    <!-- struct DBusObjectTree -->
    <class-decl name='DBusObjectTree' is-struct='yes' visibility='default' is-declaration-only='yes' id='ec8dcf68'/>
    <!-- struct DBusPendingCall -->
    <class-decl name='DBusPendingCall' size-in-bits='576' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='63' column='1' id='d286a1ae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusAtomic DBusPendingCall::refcount -->
        <var-decl name='refcount' type-id='1000c06f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusDataSlotList DBusPendingCall::slot_list -->
        <var-decl name='slot_list' type-id='e381768e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusPendingCallNotifyFunction DBusPendingCall::function -->
        <var-decl name='function' type-id='1e4bbcbc' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- DBusConnection* DBusPendingCall::connection -->
        <var-decl name='connection' type-id='a25b1cfb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- DBusMessage* DBusPendingCall::reply -->
        <var-decl name='reply' type-id='77ff0180' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- DBusTimeout* DBusPendingCall::timeout -->
        <var-decl name='timeout' type-id='61f110cc' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- DBusList* DBusPendingCall::timeout_link -->
        <var-decl name='timeout_link' type-id='860c24f3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- dbus_uint32_t DBusPendingCall::reply_serial -->
        <var-decl name='reply_serial' type-id='9086907d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- unsigned int DBusPendingCall::completed -->
        <var-decl name='completed' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='545'>
        <!-- unsigned int DBusPendingCall::timeout_added -->
        <var-decl name='timeout_added' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='79' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusRMutex -->
    <class-decl name='DBusRMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='32b69a8e'/>
    <!-- struct DBusTimeout -->
    <class-decl name='DBusTimeout' size-in-bits='448' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='41' column='1' id='54869c76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int DBusTimeout::refcount -->
        <var-decl name='refcount' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int DBusTimeout::interval -->
        <var-decl name='interval' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusTimeoutHandler DBusTimeout::handler -->
        <var-decl name='handler' type-id='9f06b367' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* DBusTimeout::handler_data -->
        <var-decl name='handler_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusFreeFunction DBusTimeout::free_handler_data_function -->
        <var-decl name='free_handler_data_function' type-id='ddc1415c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void* DBusTimeout::data -->
        <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- DBusFreeFunction DBusTimeout::free_data_function -->
        <var-decl name='free_data_function' type-id='ddc1415c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- unsigned int DBusTimeout::enabled -->
        <var-decl name='enabled' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='51' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusTimeoutList -->
    <class-decl name='DBusTimeoutList' is-struct='yes' visibility='default' is-declaration-only='yes' id='9b71e0e2'/>
    <!-- struct DBusTransport -->
    <class-decl name='DBusTransport' is-struct='yes' visibility='default' is-declaration-only='yes' id='88618050'/>
    <!-- struct DBusWatch -->
    <class-decl name='DBusWatch' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='41' column='1' id='dc4355ea'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int DBusWatch::refcount -->
        <var-decl name='refcount' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int DBusWatch::fd -->
        <var-decl name='fd' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int DBusWatch::flags -->
        <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- DBusWatchHandler DBusWatch::handler -->
        <var-decl name='handler' type-id='e081a6c3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* DBusWatch::handler_data -->
        <var-decl name='handler_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- DBusFreeFunction DBusWatch::free_handler_data_function -->
        <var-decl name='free_handler_data_function' type-id='ddc1415c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void* DBusWatch::data -->
        <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- DBusFreeFunction DBusWatch::free_data_function -->
        <var-decl name='free_data_function' type-id='ddc1415c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- unsigned int DBusWatch::enabled -->
        <var-decl name='enabled' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='449'>
        <!-- unsigned int DBusWatch::oom_last_time -->
        <var-decl name='oom_last_time' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='53' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusWatchList -->
    <class-decl name='DBusWatchList' is-struct='yes' visibility='default' is-declaration-only='yes' id='35965606'/>
    <!-- dbus_bool_t dbus_connection_has_messages_to_send(DBusConnection*) -->
    <function-decl name='dbus_connection_has_messages_to_send' mangled-name='dbus_connection_has_messages_to_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_has_messages_to_send'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='588' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- DBusConnection* dbus_connection_open(const char*, DBusError*) -->
    <function-decl name='dbus_connection_open' mangled-name='dbus_connection_open' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_open'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2616' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2617' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='a25b1cfb'/>
    </function-decl>
    <!-- DBusConnection* dbus_connection_open_private(const char*, DBusError*) -->
    <function-decl name='dbus_connection_open_private' mangled-name='dbus_connection_open_private' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_open_private'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2659' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2660' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='a25b1cfb'/>
    </function-decl>
    <!-- DBusConnection* dbus_connection_ref(DBusConnection*) -->
    <function-decl name='dbus_connection_ref' mangled-name='dbus_connection_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_ref'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2681' column='1'/>
      <!-- DBusConnection* -->
      <return type-id='a25b1cfb'/>
    </function-decl>
    <!-- void dbus_connection_unref(DBusConnection*) -->
    <function-decl name='dbus_connection_unref' mangled-name='dbus_connection_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_unref'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2817' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_connection_close(DBusConnection*) -->
    <function-decl name='dbus_connection_close' mangled-name='dbus_connection_close' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_close'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2932' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_is_connected(DBusConnection*) -->
    <function-decl name='dbus_connection_get_is_connected' mangled-name='dbus_connection_get_is_connected' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_connected'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2973' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_is_authenticated(DBusConnection*) -->
    <function-decl name='dbus_connection_get_is_authenticated' mangled-name='dbus_connection_get_is_authenticated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_authenticated'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2995' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_is_anonymous(DBusConnection*) -->
    <function-decl name='dbus_connection_get_is_anonymous' mangled-name='dbus_connection_get_is_anonymous' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_anonymous'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3029' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- char* dbus_connection_get_server_id(DBusConnection*) -->
    <function-decl name='dbus_connection_get_server_id' mangled-name='dbus_connection_get_server_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3074' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_server_id'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3074' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_can_send_type(DBusConnection*, int) -->
    <function-decl name='dbus_connection_can_send_type' mangled-name='dbus_connection_can_send_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_can_send_type'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3105' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3106' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_connection_set_exit_on_disconnect(DBusConnection*, dbus_bool_t) -->
    <function-decl name='dbus_connection_set_exit_on_disconnect' mangled-name='dbus_connection_set_exit_on_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_exit_on_disconnect'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3145' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='3cc8ee4c' name='exit_on_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3146' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- DBusPreallocatedSend* dbus_connection_preallocate_send(DBusConnection*) -->
    <function-decl name='dbus_connection_preallocate_send' mangled-name='dbus_connection_preallocate_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_preallocate_send'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3165' column='1'/>
      <!-- DBusPreallocatedSend* -->
      <return type-id='35966c87'/>
    </function-decl>
    <!-- void dbus_connection_free_preallocated_send(DBusConnection*, DBusPreallocatedSend*) -->
    <function-decl name='dbus_connection_free_preallocated_send' mangled-name='dbus_connection_free_preallocated_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_free_preallocated_send'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3191' column='1'/>
      <!-- parameter of type 'DBusPreallocatedSend*' -->
      <parameter type-id='35966c87' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3192' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_connection_send_preallocated(DBusConnection*, DBusPreallocatedSend*, DBusMessage*, dbus_uint32_t*) -->
    <function-decl name='dbus_connection_send_preallocated' mangled-name='dbus_connection_send_preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_preallocated'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3217' column='1'/>
      <!-- parameter of type 'DBusPreallocatedSend*' -->
      <parameter type-id='35966c87' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3218' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3219' column='1'/>
      <!-- parameter of type 'dbus_uint32_t*' -->
      <parameter type-id='e90fbcd4' name='client_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3220' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_send(DBusConnection*, DBusMessage*, dbus_uint32_t*) -->
    <function-decl name='dbus_connection_send' mangled-name='dbus_connection_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3302' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3303' column='1'/>
      <!-- parameter of type 'dbus_uint32_t*' -->
      <parameter type-id='e90fbcd4' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3304' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_send_with_reply(DBusConnection*, DBusMessage*, DBusPendingCall**, int) -->
    <function-decl name='dbus_connection_send_with_reply' mangled-name='dbus_connection_send_with_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_with_reply'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3399' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3400' column='1'/>
      <!-- parameter of type 'DBusPendingCall**' -->
      <parameter type-id='023bd18a' name='pending_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3401' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3402' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- DBusMessage* dbus_connection_send_with_reply_and_block(DBusConnection*, DBusMessage*, int, DBusError*) -->
    <function-decl name='dbus_connection_send_with_reply_and_block' mangled-name='dbus_connection_send_with_reply_and_block' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_with_reply_and_block'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3535' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3536' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3537' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3538' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- void dbus_connection_flush(DBusConnection*) -->
    <function-decl name='dbus_connection_flush' mangled-name='dbus_connection_flush' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_flush'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3641' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_read_write_dispatch(DBusConnection*, int) -->
    <function-decl name='dbus_connection_read_write_dispatch' mangled-name='dbus_connection_read_write_dispatch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_read_write_dispatch'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3769' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3770' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_read_write(DBusConnection*, int) -->
    <function-decl name='dbus_connection_read_write' mangled-name='dbus_connection_read_write' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_read_write'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3801' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3802' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- DBusMessage* dbus_connection_borrow_message(DBusConnection*) -->
    <function-decl name='dbus_connection_borrow_message' mangled-name='dbus_connection_borrow_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_borrow_message'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- void dbus_connection_return_message(DBusConnection*, DBusMessage*) -->
    <function-decl name='dbus_connection_return_message' mangled-name='dbus_connection_return_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_return_message'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3901' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3902' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_connection_steal_borrowed_message(DBusConnection*, DBusMessage*) -->
    <function-decl name='dbus_connection_steal_borrowed_message' mangled-name='dbus_connection_steal_borrowed_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_steal_borrowed_message'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3936' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- DBusMessage* dbus_connection_pop_message(DBusConnection*) -->
    <function-decl name='dbus_connection_pop_message' mangled-name='dbus_connection_pop_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_pop_message'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- DBusDispatchStatus dbus_connection_get_dispatch_status(DBusConnection*) -->
    <function-decl name='dbus_connection_get_dispatch_status' mangled-name='dbus_connection_get_dispatch_status' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_dispatch_status'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4378' column='1'/>
      <!-- typedef DBusDispatchStatus -->
      <return type-id='770545c2'/>
    </function-decl>
    <!-- DBusDispatchStatus dbus_connection_dispatch(DBusConnection*) -->
    <function-decl name='dbus_connection_dispatch' mangled-name='dbus_connection_dispatch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_dispatch'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1'/>
      <!-- typedef DBusDispatchStatus -->
      <return type-id='770545c2'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_set_watch_functions(DBusConnection*, DBusAddWatchFunction, DBusRemoveWatchFunction, DBusWatchToggledFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_watch_functions' mangled-name='dbus_connection_set_watch_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_watch_functions'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4926' column='1'/>
      <!-- parameter of type 'typedef DBusAddWatchFunction' -->
      <parameter type-id='0bde67d0' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4927' column='1'/>
      <!-- parameter of type 'typedef DBusRemoveWatchFunction' -->
      <parameter type-id='86b61a5d' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4928' column='1'/>
      <!-- parameter of type 'typedef DBusWatchToggledFunction' -->
      <parameter type-id='2762a4e3' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4929' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4930' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4931' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_set_timeout_functions(DBusConnection*, DBusAddTimeoutFunction, DBusRemoveTimeoutFunction, DBusTimeoutToggledFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_timeout_functions' mangled-name='dbus_connection_set_timeout_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_timeout_functions'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4989' column='1'/>
      <!-- parameter of type 'typedef DBusAddTimeoutFunction' -->
      <parameter type-id='7afc4cf0' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4990' column='1'/>
      <!-- parameter of type 'typedef DBusRemoveTimeoutFunction' -->
      <parameter type-id='c639be29' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4991' column='1'/>
      <!-- parameter of type 'typedef DBusTimeoutToggledFunction' -->
      <parameter type-id='a9588fff' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4992' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4993' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4994' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_connection_set_wakeup_main_function(DBusConnection*, DBusWakeupMainFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_wakeup_main_function' mangled-name='dbus_connection_set_wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5027' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_wakeup_main_function'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5027' column='1'/>
      <!-- parameter of type 'typedef DBusWakeupMainFunction' -->
      <parameter type-id='d976896e' name='wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5028' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5029' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5030' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_connection_set_dispatch_status_function(DBusConnection*, DBusDispatchStatusFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_dispatch_status_function' mangled-name='dbus_connection_set_dispatch_status_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_dispatch_status_function'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5073' column='1'/>
      <!-- parameter of type 'typedef DBusDispatchStatusFunction' -->
      <parameter type-id='812f2056' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5074' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5075' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5076' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_unix_fd(DBusConnection*, int*) -->
    <function-decl name='dbus_connection_get_unix_fd' mangled-name='dbus_connection_get_unix_fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_fd'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5118' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='7292109c' name='fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5119' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_socket(DBusConnection*, int*) -->
    <function-decl name='dbus_connection_get_socket' mangled-name='dbus_connection_get_socket' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_socket'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5148' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='7292109c' name='fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5149' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_unix_user(DBusConnection*, unsigned long int*) -->
    <function-decl name='dbus_connection_get_unix_user' mangled-name='dbus_connection_get_unix_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_user'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5190' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='1d2c2b85' name='uid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5191' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_unix_process_id(DBusConnection*, unsigned long int*) -->
    <function-decl name='dbus_connection_get_unix_process_id' mangled-name='dbus_connection_get_unix_process_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_process_id'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5226' column='1'/>
      <!-- parameter of type 'unsigned long int*' -->
      <parameter type-id='1d2c2b85' name='pid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5227' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_adt_audit_session_data(DBusConnection*, void**, dbus_int32_t*) -->
    <function-decl name='dbus_connection_get_adt_audit_session_data' mangled-name='dbus_connection_get_adt_audit_session_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_adt_audit_session_data'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5259' column='1'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='63e171df' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5260' column='1'/>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='2a22110b' name='data_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5261' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_connection_set_unix_user_function(DBusConnection*, DBusAllowUnixUserFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_unix_user_function' mangled-name='dbus_connection_set_unix_user_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_unix_user_function'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5305' column='1'/>
      <!-- parameter of type 'typedef DBusAllowUnixUserFunction' -->
      <parameter type-id='f25ccf06' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5306' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5307' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5308' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_windows_user(DBusConnection*, char**) -->
    <function-decl name='dbus_connection_get_windows_user' mangled-name='dbus_connection_get_windows_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_windows_user'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5357' column='1'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='9b23c9ad' name='windows_sid_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5358' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_connection_set_windows_user_function(DBusConnection*, DBusAllowWindowsUserFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_windows_user_function' mangled-name='dbus_connection_set_windows_user_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_windows_user_function'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5404' column='1'/>
      <!-- parameter of type 'typedef DBusAllowWindowsUserFunction' -->
      <parameter type-id='c9b65873' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5405' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5406' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5407' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_connection_set_allow_anonymous(DBusConnection*, dbus_bool_t) -->
    <function-decl name='dbus_connection_set_allow_anonymous' mangled-name='dbus_connection_set_allow_anonymous' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_allow_anonymous'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5451' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='3cc8ee4c' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5452' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_connection_set_route_peer_messages(DBusConnection*, dbus_bool_t) -->
    <function-decl name='dbus_connection_set_route_peer_messages' mangled-name='dbus_connection_set_route_peer_messages' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_route_peer_messages'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5479' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='3cc8ee4c' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5480' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_add_filter(DBusConnection*, DBusHandleMessageFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_add_filter' mangled-name='dbus_connection_add_filter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_add_filter'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5511' column='1'/>
      <!-- parameter of type 'typedef DBusHandleMessageFunction' -->
      <parameter type-id='4aae3da7' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5512' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5513' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5514' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_connection_remove_filter(DBusConnection*, DBusHandleMessageFunction, void*) -->
    <function-decl name='dbus_connection_remove_filter' mangled-name='dbus_connection_remove_filter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_remove_filter'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5563' column='1'/>
      <!-- parameter of type 'typedef DBusHandleMessageFunction' -->
      <parameter type-id='4aae3da7' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5564' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5565' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_try_register_object_path(DBusConnection*, const char*, const DBusObjectPathVTable*, void*, DBusError*) -->
    <function-decl name='dbus_connection_try_register_object_path' mangled-name='dbus_connection_try_register_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_try_register_object_path'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5672' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5673' column='1'/>
      <!-- parameter of type 'const DBusObjectPathVTable*' -->
      <parameter type-id='892899aa' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5674' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5675' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5676' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_register_object_path(DBusConnection*, const char*, const DBusObjectPathVTable*, void*) -->
    <function-decl name='dbus_connection_register_object_path' mangled-name='dbus_connection_register_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_register_object_path'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5702' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5703' column='1'/>
      <!-- parameter of type 'const DBusObjectPathVTable*' -->
      <parameter type-id='892899aa' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5704' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5705' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_try_register_fallback(DBusConnection*, const char*, const DBusObjectPathVTable*, void*, DBusError*) -->
    <function-decl name='dbus_connection_try_register_fallback' mangled-name='dbus_connection_try_register_fallback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_try_register_fallback'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5742' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5743' column='1'/>
      <!-- parameter of type 'const DBusObjectPathVTable*' -->
      <parameter type-id='892899aa' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5744' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5745' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5746' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_register_fallback(DBusConnection*, const char*, const DBusObjectPathVTable*, void*) -->
    <function-decl name='dbus_connection_register_fallback' mangled-name='dbus_connection_register_fallback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_register_fallback'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5774' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5775' column='1'/>
      <!-- parameter of type 'const DBusObjectPathVTable*' -->
      <parameter type-id='892899aa' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5776' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5777' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_unregister_object_path(DBusConnection*, const char*) -->
    <function-decl name='dbus_connection_unregister_object_path' mangled-name='dbus_connection_unregister_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_unregister_object_path'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5809' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5810' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_get_object_path_data(DBusConnection*, const char*, void**) -->
    <function-decl name='dbus_connection_get_object_path_data' mangled-name='dbus_connection_get_object_path_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_object_path_data'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5841' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5842' column='1'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='63e171df' name='data_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5843' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_list_registered(DBusConnection*, const char*, char***) -->
    <function-decl name='dbus_connection_list_registered' mangled-name='dbus_connection_list_registered' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5878' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_list_registered'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5878' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='parent_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5879' column='1'/>
      <!-- parameter of type 'char***' -->
      <parameter type-id='c0563f85' name='child_entries' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5880' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_allocate_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_connection_allocate_data_slot' mangled-name='dbus_connection_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_allocate_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='2a22110b' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5920' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_connection_free_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_connection_free_data_slot' mangled-name='dbus_connection_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5938' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_free_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='2a22110b' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5938' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_connection_set_data(DBusConnection*, dbus_int32_t, void*, DBusFreeFunction) -->
    <function-decl name='dbus_connection_set_data' mangled-name='dbus_connection_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_data'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5968' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='9107d76e' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5969' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5970' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5971' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void* dbus_connection_get_data(DBusConnection*, dbus_int32_t) -->
    <function-decl name='dbus_connection_get_data' mangled-name='dbus_connection_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6017' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_data'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6017' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='9107d76e' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6018' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void dbus_connection_set_change_sigpipe(dbus_bool_t) -->
    <function-decl name='dbus_connection_set_change_sigpipe' mangled-name='dbus_connection_set_change_sigpipe' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_change_sigpipe'>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='3cc8ee4c' name='will_modify_sigpipe' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6043' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_connection_set_max_message_size(DBusConnection*, long int) -->
    <function-decl name='dbus_connection_set_max_message_size' mangled-name='dbus_connection_set_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='bd54fe1a' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6058' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- long int dbus_connection_get_max_message_size(DBusConnection*) -->
    <function-decl name='dbus_connection_get_max_message_size' mangled-name='dbus_connection_get_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_message_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6075' column='1'/>
      <!-- long int -->
      <return type-id='bd54fe1a'/>
    </function-decl>
    <!-- void dbus_connection_set_max_message_unix_fds(DBusConnection*, long int) -->
    <function-decl name='dbus_connection_set_max_message_unix_fds' mangled-name='dbus_connection_set_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='bd54fe1a' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6097' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- long int dbus_connection_get_max_message_unix_fds(DBusConnection*) -->
    <function-decl name='dbus_connection_get_max_message_unix_fds' mangled-name='dbus_connection_get_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_message_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6114' column='1'/>
      <!-- long int -->
      <return type-id='bd54fe1a'/>
    </function-decl>
    <!-- void dbus_connection_set_max_received_size(DBusConnection*, long int) -->
    <function-decl name='dbus_connection_set_max_received_size' mangled-name='dbus_connection_set_max_received_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='bd54fe1a' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6153' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- long int dbus_connection_get_max_received_size(DBusConnection*) -->
    <function-decl name='dbus_connection_get_max_received_size' mangled-name='dbus_connection_get_max_received_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_received_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6170' column='1'/>
      <!-- long int -->
      <return type-id='bd54fe1a'/>
    </function-decl>
    <!-- void dbus_connection_set_max_received_unix_fds(DBusConnection*, long int) -->
    <function-decl name='dbus_connection_set_max_received_unix_fds' mangled-name='dbus_connection_set_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='bd54fe1a' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6195' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- long int dbus_connection_get_max_received_unix_fds(DBusConnection*) -->
    <function-decl name='dbus_connection_get_max_received_unix_fds' mangled-name='dbus_connection_get_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_received_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1'/>
      <!-- long int -->
      <return type-id='bd54fe1a'/>
    </function-decl>
    <!-- long int dbus_connection_get_outgoing_size(DBusConnection*) -->
    <function-decl name='dbus_connection_get_outgoing_size' mangled-name='dbus_connection_get_outgoing_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_outgoing_size'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1'/>
      <!-- long int -->
      <return type-id='bd54fe1a'/>
    </function-decl>
    <!-- long int dbus_connection_get_outgoing_unix_fds(DBusConnection*) -->
    <function-decl name='dbus_connection_get_outgoing_unix_fds' mangled-name='dbus_connection_get_outgoing_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_outgoing_unix_fds'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6296' column='1'/>
      <!-- long int -->
      <return type-id='bd54fe1a'/>
    </function-decl>
    <!-- DBusHandlerResult (DBusConnection*, DBusMessage*, void*) -->
    <function-type size-in-bits='64' id='bf585833'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- typedef DBusHandlerResult -->
      <return type-id='2cbc28cf'/>
    </function-type>
    <!-- dbus_bool_t (DBusConnection*, const char*, void*) -->
    <function-type size-in-bits='64' id='8b0e432a'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-type>
    <!-- dbus_bool_t (DBusConnection*, unsigned long int, void*) -->
    <function-type size-in-bits='64' id='0ae2fc9d'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb'/>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='7359adad'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-type>
    <!-- dbus_bool_t (DBusTimeout*, void*) -->
    <function-type size-in-bits='64' id='6d7f6e3e'>
      <!-- parameter of type 'DBusTimeout*' -->
      <parameter type-id='61f110cc'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-type>
    <!-- dbus_bool_t (DBusWatch*, void*) -->
    <function-type size-in-bits='64' id='20b6e28a'>
      <!-- parameter of type 'DBusWatch*' -->
      <parameter type-id='36f9a538'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-type>
    <!-- void (DBusConnection*, DBusDispatchStatus, void*) -->
    <function-type size-in-bits='64' id='25efba21'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb'/>
      <!-- parameter of type 'typedef DBusDispatchStatus' -->
      <parameter type-id='770545c2'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (DBusConnection*, void*) -->
    <function-type size-in-bits='64' id='0d2d75f6'>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (DBusTimeout*, void*) -->
    <function-type size-in-bits='64' id='177be825'>
      <!-- parameter of type 'DBusTimeout*' -->
      <parameter type-id='61f110cc'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (DBusWatch*, void*) -->
    <function-type size-in-bits='64' id='94ca0625'>
      <!-- parameter of type 'DBusWatch*' -->
      <parameter type-id='36f9a538'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (void*) -->
    <function-type size-in-bits='64' id='c5c76c9c'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-errors.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- const DBusError -->
    <qualified-type-def type-id='740e0640' const='yes' id='72880c10'/>
    <!-- const DBusError* -->
    <pointer-type-def type-id='72880c10' size-in-bits='64' id='862b3f4e'/>
    <!-- void dbus_error_init(DBusError*) -->
    <function-decl name='dbus_error_init' mangled-name='dbus_error_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_init'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='188' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_error_free(DBusError*) -->
    <function-decl name='dbus_error_free' mangled-name='dbus_error_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_free'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='211' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_set_error_const(DBusError*, const char*, const char*) -->
    <function-decl name='dbus_set_error_const' mangled-name='dbus_set_error_const' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error_const'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='243' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='244' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='245' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_move_error(DBusError*, DBusError*) -->
    <function-decl name='dbus_move_error' mangled-name='dbus_move_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_move_error'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='src' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='279' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='dest' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='280' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_error_has_name(const DBusError*, const char*) -->
    <function-decl name='dbus_error_has_name' mangled-name='dbus_error_has_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_has_name'>
      <!-- parameter of type 'const DBusError*' -->
      <parameter type-id='862b3f4e' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='302' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='303' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_error_is_set(const DBusError*) -->
    <function-decl name='dbus_error_is_set' mangled-name='dbus_error_is_set' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_is_set'>
      <!-- parameter of type 'const DBusError*' -->
      <parameter type-id='862b3f4e' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='329' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_set_error(DBusError*, const char*, const char*, ...) -->
    <function-decl name='dbus_set_error' mangled-name='dbus_set_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='354' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='355' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='356' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-memory.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='7359adad' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='b59d7dce'/>
    <!-- void* dbus_malloc(size_t) -->
    <function-decl name='dbus_malloc' mangled-name='dbus_malloc' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_malloc'>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='461' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void* dbus_malloc0(size_t) -->
    <function-decl name='dbus_malloc0' mangled-name='dbus_malloc0' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_malloc0'>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='531' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void* dbus_realloc(void*, size_t) -->
    <function-decl name='dbus_realloc' mangled-name='dbus_realloc' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_realloc'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='memory' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='601' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='602' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void dbus_free(void*) -->
    <function-decl name='dbus_free' mangled-name='dbus_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_free'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='memory' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='701' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_free_string_array(char**) -->
    <function-decl name='dbus_free_string_array' mangled-name='dbus_free_string_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_free_string_array'>
      <!-- parameter of type 'char**' -->
      <parameter type-id='9b23c9ad' name='str_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='749' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_shutdown() -->
    <function-decl name='dbus_shutdown' mangled-name='dbus_shutdown' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='890' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_shutdown'>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-message.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- struct __va_list_tag -->
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int __va_list_tag::gp_offset -->
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int __va_list_tag::fp_offset -->
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* __va_list_tag::overflow_arg_area -->
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* __va_list_tag::reg_save_area -->
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusMessageIter DBusMessageIter -->
    <typedef-decl name='DBusMessageIter' type-id='447cf4e4' filepath='../dbus/dbus-message.h' line='46' column='1' id='011bdf57'/>
    <!-- struct DBusMessageIter -->
    <class-decl name='DBusMessageIter' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-message.h' line='52' column='1' id='447cf4e4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* DBusMessageIter::dummy1 -->
        <var-decl name='dummy1' type-id='eaa32e2f' visibility='default' filepath='../dbus/dbus-message.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* DBusMessageIter::dummy2 -->
        <var-decl name='dummy2' type-id='eaa32e2f' visibility='default' filepath='../dbus/dbus-message.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- dbus_uint32_t DBusMessageIter::dummy3 -->
        <var-decl name='dummy3' type-id='9086907d' visibility='default' filepath='../dbus/dbus-message.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int DBusMessageIter::dummy4 -->
        <var-decl name='dummy4' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int DBusMessageIter::dummy5 -->
        <var-decl name='dummy5' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- int DBusMessageIter::dummy6 -->
        <var-decl name='dummy6' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int DBusMessageIter::dummy7 -->
        <var-decl name='dummy7' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- int DBusMessageIter::dummy8 -->
        <var-decl name='dummy8' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int DBusMessageIter::dummy9 -->
        <var-decl name='dummy9' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- int DBusMessageIter::dummy10 -->
        <var-decl name='dummy10' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- int DBusMessageIter::dummy11 -->
        <var-decl name='dummy11' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <!-- int DBusMessageIter::pad1 -->
        <var-decl name='pad1' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int DBusMessageIter::pad2 -->
        <var-decl name='pad2' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-message.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- void* DBusMessageIter::pad3 -->
        <var-decl name='pad3' type-id='eaa32e2f' visibility='default' filepath='../dbus/dbus-message.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <!-- DBusMessageIter* -->
    <pointer-type-def type-id='011bdf57' size-in-bits='64' id='9d2e73d2'/>
    <!-- __va_list_tag* -->
    <pointer-type-def type-id='d5027220' size-in-bits='64' id='b7f2d5e6'/>
    <!-- const DBusMessage -->
    <qualified-type-def type-id='45094a95' const='yes' id='ab536405'/>
    <!-- const DBusMessage* -->
    <pointer-type-def type-id='ab536405' size-in-bits='64' id='e346b5fd'/>
    <!-- void dbus_message_set_serial(DBusMessage*, dbus_uint32_t) -->
    <function-decl name='dbus_message_set_serial' mangled-name='dbus_message_set_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_serial'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='254' column='1'/>
      <!-- parameter of type 'typedef dbus_uint32_t' -->
      <parameter type-id='9086907d' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='255' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_message_lock(DBusMessage*) -->
    <function-decl name='dbus_message_lock' mangled-name='dbus_message_lock' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_lock'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='384' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_uint32_t dbus_message_get_serial(DBusMessage*) -->
    <function-decl name='dbus_message_get_serial' mangled-name='dbus_message_get_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_serial'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1127' column='1'/>
      <!-- typedef dbus_uint32_t -->
      <return type-id='9086907d'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_reply_serial(DBusMessage*, dbus_uint32_t) -->
    <function-decl name='dbus_message_set_reply_serial' mangled-name='dbus_message_set_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_reply_serial'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1'/>
      <!-- parameter of type 'typedef dbus_uint32_t' -->
      <parameter type-id='9086907d' name='reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1144' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_uint32_t dbus_message_get_reply_serial(DBusMessage*) -->
    <function-decl name='dbus_message_get_reply_serial' mangled-name='dbus_message_get_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_reply_serial'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1'/>
      <!-- typedef dbus_uint32_t -->
      <return type-id='9086907d'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new(int) -->
    <function-decl name='dbus_message_new' mangled-name='dbus_message_new' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='message_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1289' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_method_call(const char*, const char*, const char*, const char*) -->
    <function-decl name='dbus_message_new_method_call' mangled-name='dbus_message_new_method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_method_call'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1333' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1334' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1335' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1336' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_method_return(DBusMessage*) -->
    <function-decl name='dbus_message_new_method_return' mangled-name='dbus_message_new_method_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_method_return'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1373' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_signal(const char*, const char*, const char*) -->
    <function-decl name='dbus_message_new_signal' mangled-name='dbus_message_new_signal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_signal'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1424' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1425' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1426' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_error(DBusMessage*, const char*, const char*) -->
    <function-decl name='dbus_message_new_error' mangled-name='dbus_message_new_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_error'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1470' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1471' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='error_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1472' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_new_error_printf(DBusMessage*, const char*, const char*, ...) -->
    <function-decl name='dbus_message_new_error_printf' mangled-name='dbus_message_new_error_printf' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_error_printf'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1542' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1543' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='error_format' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1544' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_copy(const DBusMessage*) -->
    <function-decl name='dbus_message_copy' mangled-name='dbus_message_copy' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_copy'>
      <!-- parameter of type 'const DBusMessage*' -->
      <parameter type-id='e346b5fd' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1587' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_ref(DBusMessage*) -->
    <function-decl name='dbus_message_ref' mangled-name='dbus_message_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_ref'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- void dbus_message_unref(DBusMessage*) -->
    <function-decl name='dbus_message_unref' mangled-name='dbus_message_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_unref'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1690' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- int dbus_message_get_type(DBusMessage*) -->
    <function-decl name='dbus_message_get_type' mangled-name='dbus_message_get_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_type'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1722' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_append_args(DBusMessage*, int, ...) -->
    <function-decl name='dbus_message_append_args' mangled-name='dbus_message_append_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_append_args'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1792' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1793' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_append_args_valist(DBusMessage*, int, __va_list_tag*) -->
    <function-decl name='dbus_message_append_args_valist' mangled-name='dbus_message_append_args_valist' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_append_args_valist'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1824' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1825' column='1'/>
      <!-- parameter of type '__va_list_tag*' -->
      <parameter type-id='b7f2d5e6' name='var_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1826' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_args(DBusMessage*, DBusError*, int, ...) -->
    <function-decl name='dbus_message_get_args' mangled-name='dbus_message_get_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_args'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1980' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1981' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1982' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_args_valist(DBusMessage*, DBusError*, int, __va_list_tag*) -->
    <function-decl name='dbus_message_get_args_valist' mangled-name='dbus_message_get_args_valist' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_args_valist'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2009' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2010' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2011' column='1'/>
      <!-- parameter of type '__va_list_tag*' -->
      <parameter type-id='b7f2d5e6' name='var_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2012' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_init(DBusMessage*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_init' mangled-name='dbus_message_iter_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_init'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2064' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2065' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_has_next(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_has_next' mangled-name='dbus_message_iter_has_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_has_next'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2095' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_next(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_next' mangled-name='dbus_message_iter_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_next'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2114' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- int dbus_message_iter_get_arg_type(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_get_arg_type' mangled-name='dbus_message_iter_get_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_arg_type'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2139' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int dbus_message_iter_get_element_type(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_get_element_type' mangled-name='dbus_message_iter_get_element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_element_type'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2158' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- void dbus_message_iter_recurse(DBusMessageIter*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_recurse' mangled-name='dbus_message_iter_recurse' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_recurse'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2195' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2196' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- char* dbus_message_iter_get_signature(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_get_signature' mangled-name='dbus_message_iter_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_signature'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2220' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- void dbus_message_iter_get_basic(DBusMessageIter*, void*) -->
    <function-decl name='dbus_message_iter_get_basic' mangled-name='dbus_message_iter_get_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_basic'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2293' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2294' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- int dbus_message_iter_get_array_len(DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_get_array_len' mangled-name='dbus_message_iter_get_array_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_array_len'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2346' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- void dbus_message_iter_get_fixed_array(DBusMessageIter*, void*, int*) -->
    <function-decl name='dbus_message_iter_get_fixed_array' mangled-name='dbus_message_iter_get_fixed_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_fixed_array'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2391' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2392' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='7292109c' name='n_elements' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2393' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_message_iter_init_append(DBusMessage*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_init_append' mangled-name='dbus_message_iter_init_append' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_init_append'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2421' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2422' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_append_basic(DBusMessageIter*, int, void*) -->
    <function-decl name='dbus_message_iter_append_basic' mangled-name='dbus_message_iter_append_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_append_basic'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2656' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2657' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2658' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_append_fixed_array(DBusMessageIter*, int, void*, int) -->
    <function-decl name='dbus_message_iter_append_fixed_array' mangled-name='dbus_message_iter_append_fixed_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_append_fixed_array'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2791' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2792' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2793' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='n_elements' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2794' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_open_container(DBusMessageIter*, int, const char*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_open_container' mangled-name='dbus_message_iter_open_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_open_container'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2849' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2850' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='contained_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2851' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2852' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_iter_close_container(DBusMessageIter*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_close_container' mangled-name='dbus_message_iter_close_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_close_container'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2918' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2919' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_message_iter_abandon_container(DBusMessageIter*, DBusMessageIter*) -->
    <function-decl name='dbus_message_iter_abandon_container' mangled-name='dbus_message_iter_abandon_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_abandon_container'>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2951' column='1'/>
      <!-- parameter of type 'DBusMessageIter*' -->
      <parameter type-id='9d2e73d2' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2952' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_message_set_no_reply(DBusMessage*, dbus_bool_t) -->
    <function-decl name='dbus_message_set_no_reply' mangled-name='dbus_message_set_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_no_reply'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='3cc8ee4c' name='no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2985' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_no_reply(DBusMessage*) -->
    <function-decl name='dbus_message_get_no_reply' mangled-name='dbus_message_get_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_no_reply'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_message_set_auto_start(DBusMessage*, dbus_bool_t) -->
    <function-decl name='dbus_message_set_auto_start' mangled-name='dbus_message_set_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_auto_start'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1'/>
      <!-- parameter of type 'typedef dbus_bool_t' -->
      <parameter type-id='3cc8ee4c' name='auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3027' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_auto_start(DBusMessage*) -->
    <function-decl name='dbus_message_get_auto_start' mangled-name='dbus_message_get_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_auto_start'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_path(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_path' mangled-name='dbus_message_set_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_path'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3068' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- const char* dbus_message_get_path(DBusMessage*) -->
    <function-decl name='dbus_message_get_path' mangled-name='dbus_message_get_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_path(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_path' mangled-name='dbus_message_has_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_path'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3121' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_get_path_decomposed(DBusMessage*, char***) -->
    <function-decl name='dbus_message_get_path_decomposed' mangled-name='dbus_message_get_path_decomposed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path_decomposed'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1'/>
      <!-- parameter of type 'char***' -->
      <parameter type-id='c0563f85' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3165' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_interface(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_interface' mangled-name='dbus_message_set_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_interface'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3199' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- const char* dbus_message_get_interface(DBusMessage*) -->
    <function-decl name='dbus_message_get_interface' mangled-name='dbus_message_get_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_interface'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_interface(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_interface' mangled-name='dbus_message_has_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_interface'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3250' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_member(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_member' mangled-name='dbus_message_set_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_member'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3287' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- const char* dbus_message_get_member(DBusMessage*) -->
    <function-decl name='dbus_message_get_member' mangled-name='dbus_message_get_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_member'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_member(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_member' mangled-name='dbus_message_has_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_member'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3336' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_error_name(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_error_name' mangled-name='dbus_message_set_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_error_name'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3372' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- const char* dbus_message_get_error_name(DBusMessage*) -->
    <function-decl name='dbus_message_get_error_name' mangled-name='dbus_message_get_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_error_name'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_destination(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_destination' mangled-name='dbus_message_set_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_destination'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3426' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- const char* dbus_message_get_destination(DBusMessage*) -->
    <function-decl name='dbus_message_get_destination' mangled-name='dbus_message_get_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_destination'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_sender(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_set_sender' mangled-name='dbus_message_set_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_sender'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3480' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- const char* dbus_message_get_sender(DBusMessage*) -->
    <function-decl name='dbus_message_get_sender' mangled-name='dbus_message_get_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_sender'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- const char* dbus_message_get_signature(DBusMessage*) -->
    <function-decl name='dbus_message_get_signature' mangled-name='dbus_message_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_signature'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_is_method_call(DBusMessage*, const char*, const char*) -->
    <function-decl name='dbus_message_is_method_call' mangled-name='dbus_message_is_method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3602' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_method_call'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3602' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3603' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3604' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_is_signal(DBusMessage*, const char*, const char*) -->
    <function-decl name='dbus_message_is_signal' mangled-name='dbus_message_is_signal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_signal'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3630' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3631' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='signal_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3632' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_is_error(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_is_error' mangled-name='dbus_message_is_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_error'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3657' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3658' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_destination(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_destination' mangled-name='dbus_message_has_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_destination'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3691' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_sender(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_sender' mangled-name='dbus_message_has_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_sender'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3726' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_has_signature(DBusMessage*, const char*) -->
    <function-decl name='dbus_message_has_signature' mangled-name='dbus_message_has_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_signature'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3755' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_set_error_from_message(DBusError*, DBusMessage*) -->
    <function-decl name='dbus_set_error_from_message' mangled-name='dbus_set_error_from_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error_from_message'>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3796' column='1'/>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3797' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_contains_unix_fds(DBusMessage*) -->
    <function-decl name='dbus_message_contains_unix_fds' mangled-name='dbus_message_contains_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_contains_unix_fds'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_allocate_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_message_allocate_data_slot' mangled-name='dbus_message_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_allocate_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='2a22110b' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4560' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_message_free_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_message_free_data_slot' mangled-name='dbus_message_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_free_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='2a22110b' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4578' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_set_data(DBusMessage*, dbus_int32_t, void*, DBusFreeFunction) -->
    <function-decl name='dbus_message_set_data' mangled-name='dbus_message_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_data'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='9107d76e' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4600' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4601' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4602' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void* dbus_message_get_data(DBusMessage*, dbus_int32_t) -->
    <function-decl name='dbus_message_get_data' mangled-name='dbus_message_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_data'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='9107d76e' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4636' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- int dbus_message_type_from_string(const char*) -->
    <function-decl name='dbus_message_type_from_string' mangled-name='dbus_message_type_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_type_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4663' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- const char* dbus_message_type_to_string(int) -->
    <function-decl name='dbus_message_type_to_string' mangled-name='dbus_message_type_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_type_to_string'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4691' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- dbus_bool_t dbus_message_marshal(DBusMessage*, char**, int*) -->
    <function-decl name='dbus_message_marshal' mangled-name='dbus_message_marshal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_marshal'>
      <!-- parameter of type 'DBusMessage*' -->
      <parameter type-id='77ff0180' name='msg' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4721' column='1'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='9b23c9ad' name='marshalled_data_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4722' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='7292109c' name='len_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4723' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- DBusMessage* dbus_message_demarshal(const char*, int, DBusError*) -->
    <function-decl name='dbus_message_demarshal' mangled-name='dbus_message_demarshal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_demarshal'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4783' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4784' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4785' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- int dbus_message_demarshal_bytes_needed(const char*, int) -->
    <function-decl name='dbus_message_demarshal_bytes_needed' mangled-name='dbus_message_demarshal_bytes_needed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_demarshal_bytes_needed'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4841' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4842' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-misc.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- char* dbus_get_local_machine_id() -->
    <function-decl name='dbus_get_local_machine_id' mangled-name='dbus_get_local_machine_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_get_local_machine_id'>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- void dbus_get_version(int*, int*, int*) -->
    <function-decl name='dbus_get_version' mangled-name='dbus_get_version' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_get_version'>
      <!-- parameter of type 'int*' -->
      <parameter type-id='7292109c' name='major_version_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='161' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='7292109c' name='minor_version_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='162' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='7292109c' name='micro_version_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='163' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-pending-call.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- typedef void (DBusPendingCall*, void*)* DBusPendingCallNotifyFunction -->
    <typedef-decl name='DBusPendingCallNotifyFunction' type-id='091ef42d' filepath='../dbus/dbus-connection.h' line='162' column='1' id='1e4bbcbc'/>
    <!-- void (DBusPendingCall*, void*)* -->
    <pointer-type-def type-id='e72931c9' size-in-bits='64' id='091ef42d'/>
    <!-- DBusPendingCall* dbus_pending_call_ref(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_ref' mangled-name='dbus_pending_call_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_ref'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='577' column='1'/>
      <!-- DBusPendingCall* -->
      <return type-id='7ff886a4'/>
    </function-decl>
    <!-- void dbus_pending_call_unref(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_unref' mangled-name='dbus_pending_call_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_unref'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='597' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_pending_call_set_notify(DBusPendingCall*, DBusPendingCallNotifyFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_pending_call_set_notify' mangled-name='dbus_pending_call_set_notify' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_set_notify'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='622' column='1'/>
      <!-- parameter of type 'typedef DBusPendingCallNotifyFunction' -->
      <parameter type-id='1e4bbcbc' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='623' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='624' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='625' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_pending_call_cancel(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_cancel' mangled-name='dbus_pending_call_cancel' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_cancel'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='663' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_pending_call_get_completed(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_get_completed' mangled-name='dbus_pending_call_get_completed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_get_completed'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='679' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- DBusMessage* dbus_pending_call_steal_reply(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_steal_reply' mangled-name='dbus_pending_call_steal_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_steal_reply'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='702' column='1'/>
      <!-- DBusMessage* -->
      <return type-id='77ff0180'/>
    </function-decl>
    <!-- void dbus_pending_call_block(DBusPendingCall*) -->
    <function-decl name='dbus_pending_call_block' mangled-name='dbus_pending_call_block' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_block'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='737' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_pending_call_allocate_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_pending_call_allocate_data_slot' mangled-name='dbus_pending_call_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_allocate_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='2a22110b' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='759' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_pending_call_free_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_pending_call_free_data_slot' mangled-name='dbus_pending_call_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_free_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='2a22110b' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='779' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_pending_call_set_data(DBusPendingCall*, dbus_int32_t, void*, DBusFreeFunction) -->
    <function-decl name='dbus_pending_call_set_data' mangled-name='dbus_pending_call_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_set_data'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='801' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='9107d76e' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='802' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='803' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='804' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void* dbus_pending_call_get_data(DBusPendingCall*, dbus_int32_t) -->
    <function-decl name='dbus_pending_call_get_data' mangled-name='dbus_pending_call_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_get_data'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='827' column='1'/>
      <!-- parameter of type 'typedef dbus_int32_t' -->
      <parameter type-id='9107d76e' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='828' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void (DBusPendingCall*, void*) -->
    <function-type size-in-bits='64' id='e72931c9'>
      <!-- parameter of type 'DBusPendingCall*' -->
      <parameter type-id='7ff886a4'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-server.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- char[16] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='128' id='ac1fa8c0'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <!-- dbus_uint32_t[4] -->
    <array-type-def dimensions='1' type-id='9086907d' size-in-bits='128' id='efdbc74c'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <!-- union DBusGUID -->
    <union-decl name='DBusGUID' size-in-bits='128' visibility='default' filepath='../dbus/dbus-internals.h' line='351' column='1' id='ab9af4df'>
      <data-member access='public'>
        <!-- dbus_uint32_t DBusGUID::as_uint32s[4] -->
        <var-decl name='as_uint32s' type-id='efdbc74c' visibility='default' filepath='../dbus/dbus-internals.h' line='352' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- char DBusGUID::as_bytes[16] -->
        <var-decl name='as_bytes' type-id='ac1fa8c0' visibility='default' filepath='../dbus/dbus-internals.h' line='353' column='1'/>
      </data-member>
    </union-decl>
    <!-- typedef DBusServerVTable DBusServerVTable -->
    <typedef-decl name='DBusServerVTable' type-id='db2d1dce' filepath='../dbus/dbus-server-protected.h' line='38' column='1' id='a6626fdf'/>
    <!-- struct DBusServerVTable -->
    <class-decl name='DBusServerVTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-server-protected.h' line='44' column='1' id='db2d1dce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void (DBusServer*)* DBusServerVTable::finalize -->
        <var-decl name='finalize' type-id='c18165eb' visibility='default' filepath='../dbus/dbus-server-protected.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (DBusServer*)* DBusServerVTable::disconnect -->
        <var-decl name='disconnect' type-id='c18165eb' visibility='default' filepath='../dbus/dbus-server-protected.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct DBusServer -->
    <class-decl name='DBusServer' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../dbus/dbus-server-protected.h' line='57' column='1' id='bdbacea8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- DBusAtomic DBusServer::refcount -->
        <var-decl name='refcount' type-id='1000c06f' visibility='default' filepath='../dbus/dbus-server-protected.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const DBusServerVTable* DBusServer::vtable -->
        <var-decl name='vtable' type-id='da23bb5f' visibility='default' filepath='../dbus/dbus-server-protected.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- DBusRMutex* DBusServer::mutex -->
        <var-decl name='mutex' type-id='fa4b2ae4' visibility='default' filepath='../dbus/dbus-server-protected.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusGUID DBusServer::guid -->
        <var-decl name='guid' type-id='ecbe2bcf' visibility='default' filepath='../dbus/dbus-server-protected.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- DBusString DBusServer::guid_hex -->
        <var-decl name='guid_hex' type-id='7d741547' visibility='default' filepath='../dbus/dbus-server-protected.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- DBusWatchList* DBusServer::watches -->
        <var-decl name='watches' type-id='d6d1021c' visibility='default' filepath='../dbus/dbus-server-protected.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- DBusTimeoutList* DBusServer::timeouts -->
        <var-decl name='timeouts' type-id='3dbedd50' visibility='default' filepath='../dbus/dbus-server-protected.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- char* DBusServer::address -->
        <var-decl name='address' type-id='26a90f95' visibility='default' filepath='../dbus/dbus-server-protected.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- dbus_bool_t DBusServer::published_address -->
        <var-decl name='published_address' type-id='3cc8ee4c' visibility='default' filepath='../dbus/dbus-server-protected.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <!-- int DBusServer::max_connections -->
        <var-decl name='max_connections' type-id='95e97e5e' visibility='default' filepath='../dbus/dbus-server-protected.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- DBusDataSlotList DBusServer::slot_list -->
        <var-decl name='slot_list' type-id='e381768e' visibility='default' filepath='../dbus/dbus-server-protected.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- DBusNewConnectionFunction DBusServer::new_connection_function -->
        <var-decl name='new_connection_function' type-id='38f86600' visibility='default' filepath='../dbus/dbus-server-protected.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- void* DBusServer::new_connection_data -->
        <var-decl name='new_connection_data' type-id='eaa32e2f' visibility='default' filepath='../dbus/dbus-server-protected.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- DBusFreeFunction DBusServer::new_connection_free_data_function -->
        <var-decl name='new_connection_free_data_function' type-id='ddc1415c' visibility='default' filepath='../dbus/dbus-server-protected.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- char** DBusServer::auth_mechanisms -->
        <var-decl name='auth_mechanisms' type-id='9b23c9ad' visibility='default' filepath='../dbus/dbus-server-protected.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- unsigned int DBusServer::disconnected -->
        <var-decl name='disconnected' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-server-protected.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1153'>
        <!-- unsigned int DBusServer::have_server_lock -->
        <var-decl name='have_server_lock' type-id='f0981eeb' visibility='default' filepath='../dbus/dbus-server-protected.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusGUID DBusGUID -->
    <typedef-decl name='DBusGUID' type-id='ab9af4df' filepath='../dbus/dbus-sysdeps.h' line='507' column='1' id='ecbe2bcf'/>
    <!-- typedef DBusServer DBusServer -->
    <typedef-decl name='DBusServer' type-id='bdbacea8' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.h' line='42' column='1' id='8dc1e1f1'/>
    <!-- typedef void (DBusServer*, DBusConnection*, void*)* DBusNewConnectionFunction -->
    <typedef-decl name='DBusNewConnectionFunction' type-id='4d5ebb0f' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.h' line='47' column='1' id='38f86600'/>
    <!-- DBusServer* -->
    <pointer-type-def type-id='8dc1e1f1' size-in-bits='64' id='066cd33e'/>
    <!-- const DBusServerVTable -->
    <qualified-type-def type-id='a6626fdf' const='yes' id='6a4baeaf'/>
    <!-- const DBusServerVTable* -->
    <pointer-type-def type-id='6a4baeaf' size-in-bits='64' id='da23bb5f'/>
    <!-- const char** -->
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <!-- void (DBusServer*)* -->
    <pointer-type-def type-id='5e35aeb7' size-in-bits='64' id='c18165eb'/>
    <!-- void (DBusServer*, DBusConnection*, void*)* -->
    <pointer-type-def type-id='6e2d5aa3' size-in-bits='64' id='4d5ebb0f'/>
    <!-- DBusServer* dbus_server_listen(const char*, DBusError*) -->
    <function-decl name='dbus_server_listen' mangled-name='dbus_server_listen' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_listen'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='549' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='550' column='1'/>
      <!-- DBusServer* -->
      <return type-id='066cd33e'/>
    </function-decl>
    <!-- DBusServer* dbus_server_ref(DBusServer*) -->
    <function-decl name='dbus_server_ref' mangled-name='dbus_server_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_ref'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='687' column='1'/>
      <!-- DBusServer* -->
      <return type-id='066cd33e'/>
    </function-decl>
    <!-- void dbus_server_unref(DBusServer*) -->
    <function-decl name='dbus_server_unref' mangled-name='dbus_server_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_unref'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='720' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void dbus_server_disconnect(DBusServer*) -->
    <function-decl name='dbus_server_disconnect' mangled-name='dbus_server_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_disconnect'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='770' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_get_is_connected(DBusServer*) -->
    <function-decl name='dbus_server_get_is_connected' mangled-name='dbus_server_get_is_connected' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_is_connected'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='797' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- char* dbus_server_get_address(DBusServer*) -->
    <function-decl name='dbus_server_get_address' mangled-name='dbus_server_get_address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_address'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='818' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- char* dbus_server_get_id(DBusServer*) -->
    <function-decl name='dbus_server_get_id' mangled-name='dbus_server_get_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_id'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='854' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- void dbus_server_set_new_connection_function(DBusServer*, DBusNewConnectionFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_server_set_new_connection_function' mangled-name='dbus_server_set_new_connection_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_new_connection_function'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='889' column='1'/>
      <!-- parameter of type 'typedef DBusNewConnectionFunction' -->
      <parameter type-id='38f86600' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='890' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='891' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='892' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_set_watch_functions(DBusServer*, DBusAddWatchFunction, DBusRemoveWatchFunction, DBusWatchToggledFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_server_set_watch_functions' mangled-name='dbus_server_set_watch_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='929' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_watch_functions'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='929' column='1'/>
      <!-- parameter of type 'typedef DBusAddWatchFunction' -->
      <parameter type-id='0bde67d0' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='930' column='1'/>
      <!-- parameter of type 'typedef DBusRemoveWatchFunction' -->
      <parameter type-id='86b61a5d' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='931' column='1'/>
      <!-- parameter of type 'typedef DBusWatchToggledFunction' -->
      <parameter type-id='2762a4e3' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='932' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='933' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='934' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_set_timeout_functions(DBusServer*, DBusAddTimeoutFunction, DBusRemoveTimeoutFunction, DBusTimeoutToggledFunction, void*, DBusFreeFunction) -->
    <function-decl name='dbus_server_set_timeout_functions' mangled-name='dbus_server_set_timeout_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_timeout_functions'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='982' column='1'/>
      <!-- parameter of type 'typedef DBusAddTimeoutFunction' -->
      <parameter type-id='7afc4cf0' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='983' column='1'/>
      <!-- parameter of type 'typedef DBusRemoveTimeoutFunction' -->
      <parameter type-id='c639be29' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='984' column='1'/>
      <!-- parameter of type 'typedef DBusTimeoutToggledFunction' -->
      <parameter type-id='a9588fff' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='985' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='986' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='987' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_set_auth_mechanisms(DBusServer*, const char**) -->
    <function-decl name='dbus_server_set_auth_mechanisms' mangled-name='dbus_server_set_auth_mechanisms' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_auth_mechanisms'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1033' column='1'/>
      <!-- parameter of type 'const char**' -->
      <parameter type-id='7d3cd834' name='mechanisms' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1034' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_allocate_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_server_allocate_data_slot' mangled-name='dbus_server_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_allocate_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='2a22110b' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1077' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_server_free_data_slot(dbus_int32_t*) -->
    <function-decl name='dbus_server_free_data_slot' mangled-name='dbus_server_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_free_data_slot'>
      <!-- parameter of type 'dbus_int32_t*' -->
      <parameter type-id='2a22110b' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1095' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_server_set_data(DBusServer*, int, void*, DBusFreeFunction) -->
    <function-decl name='dbus_server_set_data' mangled-name='dbus_server_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_data'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1116' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1117' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1118' column='1'/>
      <!-- parameter of type 'typedef DBusFreeFunction' -->
      <parameter type-id='ddc1415c' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1119' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void* dbus_server_get_data(DBusServer*, int) -->
    <function-decl name='dbus_server_get_data' mangled-name='dbus_server_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_data'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1156' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1157' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void (DBusServer*) -->
    <function-type size-in-bits='64' id='5e35aeb7'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (DBusServer*, DBusConnection*, void*) -->
    <function-type size-in-bits='64' id='6e2d5aa3'>
      <!-- parameter of type 'DBusServer*' -->
      <parameter type-id='066cd33e'/>
      <!-- parameter of type 'DBusConnection*' -->
      <parameter type-id='a25b1cfb'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-signature.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- struct DBusSignatureIter -->
    <class-decl name='DBusSignatureIter' size-in-bits='256' is-struct='yes' naming-typedef-id='d65b7afa' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='45' column='1' id='0e77b735'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* DBusSignatureIter::dummy1 -->
        <var-decl name='dummy1' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* DBusSignatureIter::dummy2 -->
        <var-decl name='dummy2' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- dbus_uint32_t DBusSignatureIter::dummy8 -->
        <var-decl name='dummy8' type-id='9086907d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int DBusSignatureIter::dummy12 -->
        <var-decl name='dummy12' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int DBusSignatureIter::dummy17 -->
        <var-decl name='dummy17' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusSignatureIter DBusSignatureIter -->
    <typedef-decl name='DBusSignatureIter' type-id='0e77b735' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='51' column='1' id='d65b7afa'/>
    <!-- DBusSignatureIter* -->
    <pointer-type-def type-id='d65b7afa' size-in-bits='64' id='f12b64e5'/>
    <!-- const DBusSignatureIter -->
    <qualified-type-def type-id='d65b7afa' const='yes' id='5d5c19ea'/>
    <!-- const DBusSignatureIter* -->
    <pointer-type-def type-id='5d5c19ea' size-in-bits='64' id='b7fc8940'/>
    <!-- void dbus_signature_iter_init(DBusSignatureIter*, const char*) -->
    <function-decl name='dbus_signature_iter_init' mangled-name='dbus_signature_iter_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_init'>
      <!-- parameter of type 'DBusSignatureIter*' -->
      <parameter type-id='f12b64e5' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='67' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='68' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- int dbus_signature_iter_get_current_type(const DBusSignatureIter*) -->
    <function-decl name='dbus_signature_iter_get_current_type' mangled-name='dbus_signature_iter_get_current_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_get_current_type'>
      <!-- parameter of type 'const DBusSignatureIter*' -->
      <parameter type-id='b7fc8940' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='92' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- char* dbus_signature_iter_get_signature(const DBusSignatureIter*) -->
    <function-decl name='dbus_signature_iter_get_signature' mangled-name='dbus_signature_iter_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_get_signature'>
      <!-- parameter of type 'const DBusSignatureIter*' -->
      <parameter type-id='b7fc8940' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='112' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- int dbus_signature_iter_get_element_type(const DBusSignatureIter*) -->
    <function-decl name='dbus_signature_iter_get_element_type' mangled-name='dbus_signature_iter_get_element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_get_element_type'>
      <!-- parameter of type 'const DBusSignatureIter*' -->
      <parameter type-id='b7fc8940' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='146' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- dbus_bool_t dbus_signature_iter_next(DBusSignatureIter*) -->
    <function-decl name='dbus_signature_iter_next' mangled-name='dbus_signature_iter_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_next'>
      <!-- parameter of type 'DBusSignatureIter*' -->
      <parameter type-id='f12b64e5' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='164' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- void dbus_signature_iter_recurse(const DBusSignatureIter*, DBusSignatureIter*) -->
    <function-decl name='dbus_signature_iter_recurse' mangled-name='dbus_signature_iter_recurse' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_recurse'>
      <!-- parameter of type 'const DBusSignatureIter*' -->
      <parameter type-id='b7fc8940' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='207' column='1'/>
      <!-- parameter of type 'DBusSignatureIter*' -->
      <parameter type-id='f12b64e5' name='subiter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='208' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- dbus_bool_t dbus_signature_validate(const char*, DBusError*) -->
    <function-decl name='dbus_signature_validate' mangled-name='dbus_signature_validate' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_validate'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='233' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='234' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_signature_validate_single(const char*, DBusError*) -->
    <function-decl name='dbus_signature_validate_single' mangled-name='dbus_signature_validate_single' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_validate_single'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='264' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='265' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_type_is_container(int) -->
    <function-decl name='dbus_type_is_container' mangled-name='dbus_type_is_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_container'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='294' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_type_is_basic(int) -->
    <function-decl name='dbus_type_is_basic' mangled-name='dbus_type_is_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_basic'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='318' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_type_is_fixed(int) -->
    <function-decl name='dbus_type_is_fixed' mangled-name='dbus_type_is_fixed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_fixed'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='349' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_type_is_valid(int) -->
    <function-decl name='dbus_type_is_valid' mangled-name='dbus_type_is_valid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_valid'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='383' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-syntax.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- dbus_bool_t dbus_validate_path(const char*, DBusError*) -->
    <function-decl name='dbus_validate_path' mangled-name='dbus_validate_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_path'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='54' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='55' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_validate_interface(const char*, DBusError*) -->
    <function-decl name='dbus_validate_interface' mangled-name='dbus_validate_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_interface'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='101' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='102' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_validate_member(const char*, DBusError*) -->
    <function-decl name='dbus_validate_member' mangled-name='dbus_validate_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_member'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='148' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='149' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_validate_error_name(const char*, DBusError*) -->
    <function-decl name='dbus_validate_error_name' mangled-name='dbus_validate_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_error_name'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='195' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='196' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_validate_bus_name(const char*, DBusError*) -->
    <function-decl name='dbus_validate_bus_name' mangled-name='dbus_validate_bus_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_bus_name'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='242' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='243' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
    <!-- dbus_bool_t dbus_validate_utf8(const char*, DBusError*) -->
    <function-decl name='dbus_validate_utf8' mangled-name='dbus_validate_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_utf8'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='alleged_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='289' column='1'/>
      <!-- parameter of type 'DBusError*' -->
      <parameter type-id='bb26f813' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='290' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-sysdeps.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- dbus_bool_t dbus_setenv(const char*, const char*) -->
    <function-decl name='dbus_setenv' mangled-name='dbus_setenv' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-sysdeps.c' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_setenv'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='varname' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-sysdeps.c' line='114' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-sysdeps.c' line='115' column='1'/>
      <!-- typedef dbus_bool_t -->
      <return type-id='3cc8ee4c'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-threads.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <!-- typedef DBusMutex DBusMutex -->
    <typedef-decl name='DBusMutex' type-id='c7f3737e' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='41' column='1' id='b19c01ed'/>
    <!-- typedef DBusMutex* ()* DBusMutexNewFunction -->
    <typedef-decl name='DBusMutexNewFunction' type-id='db39266f' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='46' column='1' id='8441699d'/>
    <!-- typedef void (DBusMutex*)* DBusMutexFreeFunction -->
    <typedef-decl name='DBusMutexFreeFunction' type-id='535c8bd9' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='48' column='1' id='9e578843'/>
    <!-- typedef typedef dbus_bool_t (DBusMutex*)* DBusMutexLockFunction -->
    <typedef-decl name='DBusMutexLockFunction' type-id='c5b7ad32' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='50' column='1' id='d279b4ae'/>
    <!-- typedef typedef dbus_bool_t (DBusMutex*)* DBusMutexUnlockFunction -->
    <typedef-decl name='DBusMutexUnlockFunction' type-id='c5b7ad32' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='52' column='1' id='da2da1c1'/>
    <!-- typedef DBusMutex* ()* DBusRecursiveMutexNewFunction -->
    <typedef-decl name='DBusRecursiveMutexNewFunction' type-id='db39266f' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='61' column='1' id='4e687901'/>
    <!-- typedef void (DBusMutex*)* DBusRecursiveMutexFreeFunction -->
    <typedef-decl name='DBusRecursiveMutexFreeFunction' type-id='535c8bd9' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='64' column='1' id='2047aa3f'/>
    <!-- typedef void (DBusMutex*)* DBusRecursiveMutexLockFunction -->
    <typedef-decl name='DBusRecursiveMutexLockFunction' type-id='535c8bd9' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='68' column='1' id='77804c12'/>
    <!-- typedef void (DBusMutex*)* DBusRecursiveMutexUnlockFunction -->
    <typedef-decl name='DBusRecursiveMutexUnlockFunction' type-id='535c8bd9' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='72' column='1' id='c1051335'/>
    <!-- typedef DBusCondVar* ()* DBusCondVarNewFunction -->
    <typedef-decl name='DBusCondVarNewFunction' type-id='b288c0f9' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='77' column='1' id='579e9507'/>
    <!-- typedef void (DBusCondVar*)* DBusCondVarFreeFunction -->
    <typedef-decl name='DBusCondVarFreeFunction' type-id='18138d37' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='80' column='1' id='be943209'/>
    <!-- typedef void (DBusCondVar*, DBusMutex*)* DBusCondVarWaitFunction -->
    <typedef-decl name='DBusCondVarWaitFunction' type-id='d1691586' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='92' column='1' id='0d368df2'/>
    <!-- typedef typedef dbus_bool_t (DBusCondVar*, DBusMutex*, int)* DBusCondVarWaitTimeoutFunction -->
    <typedef-decl name='DBusCondVarWaitTimeoutFunction' type-id='a6b9d6ac' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='101' column='1' id='a0e7082d'/>
    <!-- typedef void (DBusCondVar*)* DBusCondVarWakeOneFunction -->
    <typedef-decl name='DBusCondVarWakeOneFunction' type-id='18138d37' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='108' column='1' id='cf9d0389'/>
    <!-- typedef void (DBusCondVar*)* DBusCondVarWakeAllFunction -->
    <typedef-decl name='DBusCondVarWakeAllFunction' type-id='18138d37' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='114' column='1' id='84005076'/>
    <!-- struct DBusThreadFunctions -->
    <class-decl name='DBusThreadFunctions' size-in-bits='1216' is-struct='yes' naming-typedef-id='a3cf150f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='153' column='1' id='8dc06f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int DBusThreadFunctions::mask -->
        <var-decl name='mask' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- DBusMutexNewFunction DBusThreadFunctions::mutex_new -->
        <var-decl name='mutex_new' type-id='8441699d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- DBusMutexFreeFunction DBusThreadFunctions::mutex_free -->
        <var-decl name='mutex_free' type-id='9e578843' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- DBusMutexLockFunction DBusThreadFunctions::mutex_lock -->
        <var-decl name='mutex_lock' type-id='d279b4ae' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- DBusMutexUnlockFunction DBusThreadFunctions::mutex_unlock -->
        <var-decl name='mutex_unlock' type-id='da2da1c1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- DBusCondVarNewFunction DBusThreadFunctions::condvar_new -->
        <var-decl name='condvar_new' type-id='579e9507' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- DBusCondVarFreeFunction DBusThreadFunctions::condvar_free -->
        <var-decl name='condvar_free' type-id='be943209' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- DBusCondVarWaitFunction DBusThreadFunctions::condvar_wait -->
        <var-decl name='condvar_wait' type-id='0d368df2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- DBusCondVarWaitTimeoutFunction DBusThreadFunctions::condvar_wait_timeout -->
        <var-decl name='condvar_wait_timeout' type-id='a0e7082d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- DBusCondVarWakeOneFunction DBusThreadFunctions::condvar_wake_one -->
        <var-decl name='condvar_wake_one' type-id='cf9d0389' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- DBusCondVarWakeAllFunction DBusThreadFunctions::condvar_wake_all -->
        <var-decl name='condvar_wake_all' type-id='84005076' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- DBusRecursiveMutexNewFunction DBusThreadFunctions::recursive_mutex_new -->
        <var-decl name='recursive_mutex_new' type-id='4e687901' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- DBusRecursiveMutexFreeFunction DBusThreadFunctions::recursive_mutex_free -->
        <var-decl name='recursive_mutex_free' type-id='2047aa3f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- DBusRecursiveMutexLockFunction DBusThreadFunctions::recursive_mutex_lock -->
        <var-decl name='recursive_mutex_lock' type-id='77804c12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- DBusRecursiveMutexUnlockFunction DBusThreadFunctions::recursive_mutex_unlock -->
        <var-decl name='recursive_mutex_unlock' type-id='c1051335' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- void ()* DBusThreadFunctions::padding1 -->
        <var-decl name='padding1' type-id='953b12f8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- void ()* DBusThreadFunctions::padding2 -->
        <var-decl name='padding2' type-id='953b12f8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- void ()* DBusThreadFunctions::padding3 -->
        <var-decl name='padding3' type-id='953b12f8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- void ()* DBusThreadFunctions::padding4 -->
        <var-decl name='padding4' type-id='953b12f8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='176' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef DBusThreadFunctions DBusThreadFunctions -->
    <typedef-decl name='DBusThreadFunctions' type-id='8dc06f90' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='178' column='1' id='a3cf150f'/>
    <!-- DBusCondVar* ()* -->
    <pointer-type-def type-id='723882a5' size-in-bits='64' id='b288c0f9'/>
    <!-- DBusMutex* -->
    <pointer-type-def type-id='b19c01ed' size-in-bits='64' id='e1aef6a4'/>
    <!-- DBusMutex* ()* -->
    <pointer-type-def type-id='dcd5326b' size-in-bits='64' id='db39266f'/>
    <!-- const DBusThreadFunctions -->
    <qualified-type-def type-id='a3cf150f' const='yes' id='cef2451f'/>
    <!-- const DBusThreadFunctions* -->
    <pointer-type-def type-id='cef2451f' size-in-bits='64' id='fc62f26f'/>
    <!-- typedef dbus_bool_t (DBusCondVar*, DBusMutex*, int)* -->
    <pointer-type-def type-id='a654a832' size-in-bits='64' id='a6b9d6ac'/>
