<abi-corpus version='2.1' architecture='elf-amd-x86_64' soname='libtsan.so.0'>
  <elf-needed>
    <dependency name='librt.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- AnnotateBenignRace -->
    <elf-symbol name='AnnotateBenignRace' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateBenignRaceSized -->
    <elf-symbol name='AnnotateBenignRaceSized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateCondVarSignal -->
    <elf-symbol name='AnnotateCondVarSignal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateCondVarSignalAll -->
    <elf-symbol name='AnnotateCondVarSignalAll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateCondVarWait -->
    <elf-symbol name='AnnotateCondVarWait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateEnableRaceDetection -->
    <elf-symbol name='AnnotateEnableRaceDetection' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='tmpnam_r' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- unlink -->
    <elf-symbol name='unlink' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- usleep -->
    <elf-symbol name='usleep' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- valloc -->
    <elf-symbol name='valloc' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- vfscanf -->
    <elf-symbol name='vfscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- vscanf -->
    <elf-symbol name='vscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- vsscanf -->
    <elf-symbol name='vsscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wait -->
    <elf-symbol name='wait' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wait3 -->
    <elf-symbol name='wait3' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wait4 -->
    <elf-symbol name='wait4' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- waitid -->
    <elf-symbol name='waitid' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- waitpid -->
    <elf-symbol name='waitpid' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wcsnrtombs -->
    <elf-symbol name='wcsnrtombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wcsrtombs -->
    <elf-symbol name='wcsrtombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wcstombs -->
    <elf-symbol name='wcstombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wordexp -->
    <elf-symbol name='wordexp' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- write -->
    <elf-symbol name='write' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- writev -->
    <elf-symbol name='writev' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <!-- __asan_cplus_demangle_builtin_types -->
    <elf-symbol name='__asan_cplus_demangle_builtin_types' size='1056' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __asan_cplus_demangle_operators -->
    <elf-symbol name='__asan_cplus_demangle_operators' size='1488' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../.././libsanitizer/interception/interception_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/interception' language='LANG_C_plus_plus'>
    <!-- bool -->
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <!-- __interception::uptr* -->
    <pointer-type-def type-id='7e779721' size-in-bits='64' id='7f25436e'/>
    <!-- const char -->
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <!-- const char* -->
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <!-- void* -->
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <!-- namespace __interception -->
    <namespace-decl name='__interception'>
      <!-- typedef unsigned long int __interception::uptr -->
      <typedef-decl name='uptr' type-id='7359adad' filepath='../../.././libsanitizer/interception/interception.h' line='230' column='1' id='7e779721'/>
    </namespace-decl>
    <!-- void* dlsym(void*, const char*) -->
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void* dlvsym(void*, const char*, const char*) -->
    <function-decl name='dlvsym' filepath='/usr/include/dlfcn.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void -->
    <type-decl name='void' id='48b5725f'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/interception/interception_type_test.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/interception' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <!-- unsigned char -->
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <!-- typedef void (void*, const char*, int)* backtrace_error_callback -->
    <typedef-decl name='backtrace_error_callback' type-id='b07dc7cc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/backtrace.h' line='82' column='1' id='43010261'/>
    <!-- typedef int (void*, typedef uintptr_t, const char*, int, const char*)* backtrace_full_callback -->
    <typedef-decl name='backtrace_full_callback' type-id='76501d4c' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/backtrace.h' line='110' column='1' id='70626b86'/>
    <!-- typedef void (void*, typedef uintptr_t, const char*, typedef uintptr_t, typedef uintptr_t)* backtrace_syminfo_callback -->
    <typedef-decl name='backtrace_syminfo_callback' type-id='c01c0659' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/backtrace.h' line='175' column='1' id='1cc872ea'/>
    <!-- typedef int (backtrace_state*, typedef uintptr_t, typedef backtrace_full_callback, typedef backtrace_error_callback, void*)* fileline -->
    <typedef-decl name='fileline' type-id='51db67e4' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='114' column='1' id='0ae02d98'/>
    <!-- typedef void (backtrace_state*, typedef uintptr_t, typedef backtrace_syminfo_callback, typedef backtrace_error_callback, void*)* syminfo -->
    <typedef-decl name='syminfo' type-id='e0525277' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='121' column='1' id='06b3d8d7'/>
    <!-- struct backtrace_state -->
    <class-decl name='backtrace_state' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='127' column='1' id='1f9fe12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* backtrace_state::filename -->
        <var-decl name='filename' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int backtrace_state::threaded -->
        <var-decl name='threaded' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* backtrace_state::lock -->
        <var-decl name='lock' type-id='eaa32e2f' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- fileline backtrace_state::fileline_fn -->
        <var-decl name='fileline_fn' type-id='0ae02d98' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void* backtrace_state::fileline_data -->
        <var-decl name='fileline_data' type-id='eaa32e2f' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- syminfo backtrace_state::syminfo_fn -->
        <var-decl name='syminfo_fn' type-id='06b3d8d7' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void* backtrace_state::syminfo_data -->
        <var-decl name='syminfo_data' type-id='eaa32e2f' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int backtrace_state::fileline_initialization_failed -->
        <var-decl name='fileline_initialization_failed' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- int backtrace_state::lock_alloc -->
        <var-decl name='lock_alloc' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- backtrace_freelist_struct* backtrace_state::freelist -->
        <var-decl name='freelist' type-id='ab64235c' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct backtrace_vector -->
    <class-decl name='backtrace_vector' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='221' column='1' id='8df9bc87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* backtrace_vector::base -->
        <var-decl name='base' type-id='eaa32e2f' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t backtrace_vector::size -->
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- size_t backtrace_vector::alc -->
        <var-decl name='alc' type-id='b59d7dce' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='228' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='7359adad' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/stddef.h' line='212' column='1' id='b59d7dce'/>
    <!-- typedef unsigned long int uintptr_t -->
    <typedef-decl name='uintptr_t' type-id='7359adad' filepath='/usr/include/stdint.h' line='123' column='1' id='e475ab95'/>
    <!-- typedef int (void*, void*)* __compar_fn_t -->
    <typedef-decl name='__compar_fn_t' type-id='585e1de9' filepath='/usr/include/stdlib.h' line='742' column='1' id='aba7edd8'/>
    <!-- backtrace_freelist_struct* -->
    <pointer-type-def type-id='334fd126' size-in-bits='64' id='ab64235c'/>
    <!-- backtrace_state* -->
    <pointer-type-def type-id='1f9fe12d' size-in-bits='64' id='8687e9ed'/>
    <!-- backtrace_vector* -->
    <pointer-type-def type-id='8df9bc87' size-in-bits='64' id='f8dcdf3f'/>
    <!-- char* -->
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <!-- const unsigned char -->
    <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
    <!-- const unsigned char* -->
    <pointer-type-def type-id='ea86de29' size-in-bits='64' id='354f7eb9'/>
    <!-- fileline* -->
    <pointer-type-def type-id='0ae02d98' size-in-bits='64' id='e254c359'/>
    <!-- int (backtrace_state*, typedef uintptr_t, typedef backtrace_full_callback, typedef backtrace_error_callback, void*)* -->
    <pointer-type-def type-id='f870d5b2' size-in-bits='64' id='51db67e4'/>
    <!-- int (void*, typedef uintptr_t, const char*, int, const char*)* -->
    <pointer-type-def type-id='d1f0cc1a' size-in-bits='64' id='76501d4c'/>
    <!-- int (void*, void*)* -->
    <pointer-type-def type-id='96ee24a5' size-in-bits='64' id='585e1de9'/>
    <!-- void (backtrace_state*, typedef uintptr_t, typedef backtrace_syminfo_callback, typedef backtrace_error_callback, void*)* -->
    <pointer-type-def type-id='4e15fe9b' size-in-bits='64' id='e0525277'/>
    <!-- void (void*, const char*, int)* -->
    <pointer-type-def type-id='10721eaa' size-in-bits='64' id='b07dc7cc'/>
    <!-- void (void*, typedef uintptr_t, const char*, typedef uintptr_t, typedef uintptr_t)* -->
    <pointer-type-def type-id='bdc9f55d' size-in-bits='64' id='c01c0659'/>
    <!-- struct backtrace_freelist_struct -->
    <class-decl name='backtrace_freelist_struct' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='55' column='1' id='334fd126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- backtrace_freelist_struct* backtrace_freelist_struct::next -->
        <var-decl name='next' type-id='ab64235c' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t backtrace_freelist_struct::size -->
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='60' column='1'/>
      </data-member>
    </class-decl>
    <!-- int __asan_backtrace_dwarf_add(backtrace_state*, uintptr_t, const unsigned char*, size_t, const unsigned char*, size_t, const unsigned char*, size_t, const unsigned char*, size_t, const unsigned char*, size_t, int, backtrace_error_callback, void*, fileline*) -->
    <function-decl name='__asan_backtrace_dwarf_add' mangled-name='__asan_backtrace_dwarf_add' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2958' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_dwarf_add'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2958' column='1'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='e475ab95' name='base_address' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2959' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='354f7eb9' name='dwarf_info' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2960' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='dwarf_info_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2961' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='354f7eb9' name='dwarf_line' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2962' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='dwarf_line_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2963' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='354f7eb9' name='dwarf_abbrev' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2964' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='dwarf_abbrev_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2965' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='354f7eb9' name='dwarf_ranges' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2966' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='dwarf_ranges_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2967' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='354f7eb9' name='dwarf_str' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2968' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='dwarf_str_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2969' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='is_bigendian' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2970' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2971' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2972' column='1'/>
      <!-- parameter of type 'fileline*' -->
      <parameter type-id='e254c359' name='fileline_fn' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2972' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- void __asan_backtrace_qsort(void*, size_t, size_t, int (void*, void*)*) -->
    <function-decl name='__asan_backtrace_qsort' mangled-name='__asan_backtrace_qsort' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_qsort'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'int (void*, void*)*' -->
      <parameter type-id='585e1de9'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void* __asan_backtrace_alloc(backtrace_state*, size_t, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_alloc' mangled-name='__asan_backtrace_alloc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_alloc'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void __asan_backtrace_free(backtrace_state*, void*, size_t, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_free' mangled-name='__asan_backtrace_free' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_free'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void* __asan_backtrace_vector_grow(backtrace_state*, size_t, backtrace_error_callback, void*, backtrace_vector*) -->
    <function-decl name='__asan_backtrace_vector_grow' mangled-name='__asan_backtrace_vector_grow' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_grow'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'backtrace_vector*' -->
      <parameter type-id='f8dcdf3f'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- int __asan_backtrace_vector_release(backtrace_state*, backtrace_vector*, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_vector_release' mangled-name='__asan_backtrace_vector_release' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_release'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed'/>
      <!-- parameter of type 'backtrace_vector*' -->
      <parameter type-id='f8dcdf3f'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- void* __asan_internal_memset(void*, int, size_t) -->
    <function-decl name='__asan_internal_memset' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- int __asan_internal_strcmp(const char*, const char*) -->
    <function-decl name='__asan_internal_strcmp' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- size_t __asan_internal_strnlen(const char*, size_t) -->
    <function-decl name='__asan_internal_strnlen' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- typedef size_t -->
      <return type-id='b59d7dce'/>
    </function-decl>
    <!-- int snprintf(char*, size_t, const char*, ...) -->
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='26a90f95'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- void* bsearch(void*, void*, size_t, size_t, __compar_fn_t) -->
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'typedef __compar_fn_t' -->
      <parameter type-id='aba7edd8'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- int (backtrace_state*, uintptr_t, backtrace_full_callback, backtrace_error_callback, void*) -->
    <function-type size-in-bits='64' id='f870d5b2'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='e475ab95'/>
      <!-- parameter of type 'typedef backtrace_full_callback' -->
      <parameter type-id='70626b86'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-type>
    <!-- int (void*, uintptr_t, const char*, int, const char*) -->
    <function-type size-in-bits='64' id='d1f0cc1a'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='e475ab95'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-type>
    <!-- int (void*, void*) -->
    <function-type size-in-bits='64' id='96ee24a5'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-type>
    <!-- void (backtrace_state*, uintptr_t, backtrace_syminfo_callback, backtrace_error_callback, void*) -->
    <function-type size-in-bits='64' id='4e15fe9b'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='e475ab95'/>
      <!-- parameter of type 'typedef backtrace_syminfo_callback' -->
      <parameter type-id='1cc872ea'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (void*, const char*, int) -->
    <function-type size-in-bits='64' id='10721eaa'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (void*, uintptr_t, const char*, uintptr_t, uintptr_t) -->
    <function-type size-in-bits='64' id='bdc9f55d'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='e475ab95'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='e475ab95'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='e475ab95'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- int (const char*, const char*) -->
    <function-type size-in-bits='64' id='8bb5e773'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- long long unsigned int -->
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <!-- unsigned short int -->
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <!-- typedef uint16_t Elf64_Half -->
    <typedef-decl name='Elf64_Half' type-id='149c6638' filepath='/usr/include/elf.h' line='34' column='1' id='101a70d5'/>
    <!-- typedef uint32_t Elf64_Word -->
    <typedef-decl name='Elf64_Word' type-id='8f92235e' filepath='/usr/include/elf.h' line='39' column='1' id='e57120d4'/>
    <!-- typedef uint64_t Elf64_Xword -->
    <typedef-decl name='Elf64_Xword' type-id='9c313c2d' filepath='/usr/include/elf.h' line='45' column='1' id='c87c44e4'/>
    <!-- typedef uint64_t Elf64_Addr -->
    <typedef-decl name='Elf64_Addr' type-id='9c313c2d' filepath='/usr/include/elf.h' line='50' column='1' id='e14340cf'/>
    <!-- typedef uint64_t Elf64_Off -->
    <typedef-decl name='Elf64_Off' type-id='9c313c2d' filepath='/usr/include/elf.h' line='54' column='1' id='59ecf0a1'/>
    <!-- struct Elf64_Phdr -->
    <class-decl name='Elf64_Phdr' size-in-bits='448' is-struct='yes' naming-typedef-id='21b66a76' visibility='default' filepath='/usr/include/elf.h' line='550' column='1' id='6392ff97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Word Elf64_Phdr::p_type -->
        <var-decl name='p_type' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- Elf64_Word Elf64_Phdr::p_flags -->
        <var-decl name='p_flags' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Elf64_Off Elf64_Phdr::p_offset -->
        <var-decl name='p_offset' type-id='59ecf0a1' visibility='default' filepath='/usr/include/elf.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Addr Elf64_Phdr::p_vaddr -->
        <var-decl name='p_vaddr' type-id='e14340cf' visibility='default' filepath='/usr/include/elf.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- Elf64_Addr Elf64_Phdr::p_paddr -->
        <var-decl name='p_paddr' type-id='e14340cf' visibility='default' filepath='/usr/include/elf.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- Elf64_Xword Elf64_Phdr::p_filesz -->
        <var-decl name='p_filesz' type-id='c87c44e4' visibility='default' filepath='/usr/include/elf.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- Elf64_Xword Elf64_Phdr::p_memsz -->
        <var-decl name='p_memsz' type-id='c87c44e4' visibility='default' filepath='/usr/include/elf.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- Elf64_Xword Elf64_Phdr::p_align -->
        <var-decl name='p_align' type-id='c87c44e4' visibility='default' filepath='/usr/include/elf.h' line='559' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef Elf64_Phdr Elf64_Phdr -->
    <typedef-decl name='Elf64_Phdr' type-id='6392ff97' filepath='/usr/include/elf.h' line='560' column='1' id='21b66a76'/>
    <!-- struct dl_phdr_info -->
    <class-decl name='dl_phdr_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/link.h' line='138' column='1' id='e65aa831'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Addr dl_phdr_info::dlpi_addr -->
        <var-decl name='dlpi_addr' type-id='e14340cf' visibility='default' filepath='/usr/include/link.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* dl_phdr_info::dlpi_name -->
        <var-decl name='dlpi_name' type-id='80f4b756' visibility='default' filepath='/usr/include/link.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- const Elf64_Phdr* dl_phdr_info::dlpi_phdr -->
        <var-decl name='dlpi_phdr' type-id='61accf24' visibility='default' filepath='/usr/include/link.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- Elf64_Half dl_phdr_info::dlpi_phnum -->
        <var-decl name='dlpi_phnum' type-id='101a70d5' visibility='default' filepath='/usr/include/link.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- long long unsigned int dl_phdr_info::dlpi_adds -->
        <var-decl name='dlpi_adds' type-id='3a47d82b' visibility='default' filepath='/usr/include/link.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- long long unsigned int dl_phdr_info::dlpi_subs -->
        <var-decl name='dlpi_subs' type-id='3a47d82b' visibility='default' filepath='/usr/include/link.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- size_t dl_phdr_info::dlpi_tls_modid -->
        <var-decl name='dlpi_tls_modid' type-id='b59d7dce' visibility='default' filepath='/usr/include/link.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- void* dl_phdr_info::dlpi_tls_data -->
        <var-decl name='dlpi_tls_data' type-id='eaa32e2f' visibility='default' filepath='/usr/include/link.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef unsigned short int uint16_t -->
    <typedef-decl name='uint16_t' type-id='8efea9e5' filepath='/usr/include/stdint.h' line='50' column='1' id='149c6638'/>
    <!-- typedef unsigned int uint32_t -->
    <typedef-decl name='uint32_t' type-id='f0981eeb' filepath='/usr/include/stdint.h' line='52' column='1' id='8f92235e'/>
    <!-- typedef unsigned long int uint64_t -->
    <typedef-decl name='uint64_t' type-id='7359adad' filepath='/usr/include/stdint.h' line='56' column='1' id='9c313c2d'/>
    <!-- const Elf64_Phdr -->
    <qualified-type-def type-id='21b66a76' const='yes' id='b896fae6'/>
    <!-- const Elf64_Phdr* -->
    <pointer-type-def type-id='b896fae6' size-in-bits='64' id='61accf24'/>
    <!-- dl_phdr_info* -->
    <pointer-type-def type-id='e65aa831' size-in-bits='64' id='27c49c89'/>
    <!-- int (dl_phdr_info*, typedef size_t, void*)* -->
    <pointer-type-def type-id='967fe4d8' size-in-bits='64' id='743a5be2'/>
    <!-- int* -->
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <!-- int __asan_backtrace_initialize(backtrace_state*, int, backtrace_error_callback, void*, fileline*) -->
    <function-decl name='__asan_backtrace_initialize' mangled-name='__asan_backtrace_initialize' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='921' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_initialize'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='921' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='descriptor' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='921' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='922' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='923' column='1'/>
      <!-- parameter of type 'fileline*' -->
      <parameter type-id='e254c359' name='fileline_fn' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='923' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int __asan_backtrace_open(const char*, backtrace_error_callback, void*, int*) -->
    <function-decl name='__asan_backtrace_open' mangled-name='__asan_backtrace_open' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_open'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='7292109c'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int __asan_backtrace_close(int, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_close' mangled-name='__asan_backtrace_close' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_close'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int dl_iterate_phdr(int (dl_phdr_info*, typedef size_t, void*)*, void*) -->
    <function-decl name='dl_iterate_phdr' filepath='/usr/include/link.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'int (dl_phdr_info*, typedef size_t, void*)*' -->
      <parameter type-id='743a5be2'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int (dl_phdr_info*, size_t, void*) -->
    <function-type size-in-bits='64' id='967fe4d8'>
      <!-- parameter of type 'dl_phdr_info*' -->
      <parameter type-id='27c49c89'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- int __asan_backtrace_pcinfo(backtrace_state*, uintptr_t, backtrace_full_callback, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_pcinfo' mangled-name='__asan_backtrace_pcinfo' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_pcinfo'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='166' column='1'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='e475ab95' name='pc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='166' column='1'/>
      <!-- parameter of type 'typedef backtrace_full_callback' -->
      <parameter type-id='70626b86' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='167' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='168' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='168' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int __asan_backtrace_syminfo(backtrace_state*, uintptr_t, backtrace_syminfo_callback, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_syminfo' mangled-name='__asan_backtrace_syminfo' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_syminfo'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='e475ab95' name='pc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1'/>
      <!-- parameter of type 'typedef backtrace_syminfo_callback' -->
      <parameter type-id='1cc872ea' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='183' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='184' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='184' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <!-- struct backtrace_freelist_struct -->
    <class-decl name='backtrace_freelist_struct' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='55' column='1' id='334fd126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- backtrace_freelist_struct* backtrace_freelist_struct::next -->
        <var-decl name='next' type-id='ab64235c' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t backtrace_freelist_struct::size -->
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='60' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef long int __off_t -->
    <typedef-decl name='__off_t' type-id='bd54fe1a' filepath='/usr/include/bits/types.h' line='141' column='1' id='79989e9c'/>
    <!-- void* __asan_backtrace_vector_finish(backtrace_state*, backtrace_vector*, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_vector_finish' mangled-name='__asan_backtrace_vector_finish' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_finish'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='259' column='1'/>
      <!-- parameter of type 'backtrace_vector*' -->
      <parameter type-id='f8dcdf3f' name='vec' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='260' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='261' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='262' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void* __asan_internal_memcpy(void*, void*, size_t) -->
    <function-decl name='__asan_internal_memcpy' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- int* __errno_location() -->
    <function-decl name='__errno_location' filepath='/usr/include/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- int* -->
      <return type-id='7292109c'/>
    </function-decl>
    <!-- void* mmap(void*, size_t, int, int, int, __off_t) -->
    <function-decl name='mmap' filepath='/usr/include/sys/mman.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- parameter of type 'typedef __off_t' -->
      <parameter type-id='79989e9c'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- int munmap(void*, size_t) -->
    <function-decl name='munmap' filepath='/usr/include/sys/mman.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int getpagesize() -->
    <function-decl name='getpagesize' filepath='/usr/include/unistd.h' line='992' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int () -->
    <function-type size-in-bits='64' id='276427e1'>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- struct backtrace_view -->
    <class-decl name='backtrace_view' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='169' column='1' id='8d94ff69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* backtrace_view::data -->
        <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* backtrace_view::base -->
        <var-decl name='base' type-id='eaa32e2f' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- size_t backtrace_view::len -->
        <var-decl name='len' type-id='b59d7dce' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='176' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __off_t off_t -->
    <typedef-decl name='off_t' type-id='79989e9c' filepath='/usr/include/sys/types.h' line='87' column='1' id='ad707ada'/>
    <!-- backtrace_view* -->
    <pointer-type-def type-id='8d94ff69' size-in-bits='64' id='f7b405a1'/>
    <!-- int __asan_backtrace_get_view(backtrace_state*, int, off_t, size_t, backtrace_error_callback, void*, backtrace_view*) -->
    <function-decl name='__asan_backtrace_get_view' mangled-name='__asan_backtrace_get_view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_get_view'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='53' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='descriptor' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <!-- parameter of type 'typedef off_t' -->
      <parameter type-id='ad707ada' name='offset' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='55' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='56' column='1'/>
      <!-- parameter of type 'backtrace_view*' -->
      <parameter type-id='f7b405a1' name='view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='56' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- void __asan_backtrace_release_view(backtrace_state*, backtrace_view*, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_release_view' mangled-name='__asan_backtrace_release_view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_release_view'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='8687e9ed' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='87' column='1'/>
      <!-- parameter of type 'backtrace_view*' -->
      <parameter type-id='f7b405a1' name='view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='88' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='89' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='90' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- int fcntl(int, int, ...) -->
    <function-decl name='fcntl' filepath='/usr/include/fcntl.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int open(const char*, int, ...) -->
    <function-decl name='open' filepath='/usr/include/fcntl.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int close(int) -->
    <function-decl name='close' filepath='/usr/include/unistd.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int (int) -->
    <function-type size-in-bits='64' id='9b634486'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- backtrace_state* __asan_backtrace_create_state(const char*, int, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_create_state' mangled-name='__asan_backtrace_create_state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_create_state'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='filename' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='threaded' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='43010261' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='47' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='48' column='1'/>
      <!-- backtrace_state* -->
      <return type-id='8687e9ed'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- const demangle_builtin_type_info[33] -->
    <array-type-def dimensions='1' type-id='82ec0423' size-in-bits='8448' id='d527b131'>
      <!-- <anonymous range>[33] -->
      <subrange length='33' type-id='4c87fef4' id='6a5934df'/>
    </array-type-def>
    <!-- const demangle_operator_info[62] -->
    <array-type-def dimensions='1' type-id='28c8cc97' size-in-bits='11904' id='7fb58723'>
      <!-- <anonymous range>[62] -->
      <subrange length='62' type-id='4c87fef4' id='f519cbfd'/>
    </array-type-def>
    <!-- demangle_builtin_type_info[33] -->
    <array-type-def dimensions='1' type-id='d810032e' size-in-bits='8448' id='a6660840'>
      <!-- <anonymous range>[33] -->
      <subrange length='33' type-id='4c87fef4' id='6a5934df'/>
    </array-type-def>
    <!-- demangle_operator_info[62] -->
    <array-type-def dimensions='1' type-id='cbc847f6' size-in-bits='11904' id='908d6162'>
      <!-- <anonymous range>[62] -->
      <subrange length='62' type-id='4c87fef4' id='f519cbfd'/>
    </array-type-def>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <!-- sizetype -->
    <type-decl name='sizetype' size-in-bits='64' id='4c87fef4'/>
    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <!-- typedef void (const char*, typedef size_t, void*)* demangle_callbackref -->
    <typedef-decl name='demangle_callbackref' type-id='0039c01e' filepath='../../.././libsanitizer/../include/demangle.h' line='150' column='1' id='e69e46d6'/>
    <!-- enum gnu_v3_ctor_kinds -->
    <enum-decl name='gnu_v3_ctor_kinds' filepath='../../.././libsanitizer/../include/demangle.h' line='172' column='1' id='192ea7e1'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='gnu_v3_complete_object_ctor' value='1'/>
      <enumerator name='gnu_v3_base_object_ctor' value='2'/>
      <enumerator name='gnu_v3_complete_object_allocating_ctor' value='3'/>
      <enumerator name='gnu_v3_unified_ctor' value='4'/>
      <enumerator name='gnu_v3_object_ctor_group' value='5'/>
    </enum-decl>
    <!-- enum gnu_v3_dtor_kinds -->
    <enum-decl name='gnu_v3_dtor_kinds' filepath='../../.././libsanitizer/../include/demangle.h' line='191' column='1' id='9de26e36'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='gnu_v3_deleting_dtor' value='1'/>
      <enumerator name='gnu_v3_complete_object_dtor' value='2'/>
      <enumerator name='gnu_v3_base_object_dtor' value='3'/>
      <enumerator name='gnu_v3_unified_dtor' value='4'/>
      <enumerator name='gnu_v3_object_dtor_group' value='5'/>
    </enum-decl>
    <!-- enum demangle_component_type -->
    <enum-decl name='demangle_component_type' filepath='../../.././libsanitizer/../include/demangle.h' line='223' column='1' id='79b3b2c2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DEMANGLE_COMPONENT_NAME' value='0'/>
      <enumerator name='DEMANGLE_COMPONENT_QUAL_NAME' value='1'/>
      <enumerator name='DEMANGLE_COMPONENT_LOCAL_NAME' value='2'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPED_NAME' value='3'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE' value='4'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE_PARAM' value='5'/>
      <enumerator name='DEMANGLE_COMPONENT_FUNCTION_PARAM' value='6'/>
      <enumerator name='DEMANGLE_COMPONENT_CTOR' value='7'/>
      <enumerator name='DEMANGLE_COMPONENT_DTOR' value='8'/>
      <enumerator name='DEMANGLE_COMPONENT_VTABLE' value='9'/>
      <enumerator name='DEMANGLE_COMPONENT_VTT' value='10'/>
      <enumerator name='DEMANGLE_COMPONENT_CONSTRUCTION_VTABLE' value='11'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO' value='12'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO_NAME' value='13'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO_FN' value='14'/>
      <enumerator name='DEMANGLE_COMPONENT_THUNK' value='15'/>
      <enumerator name='DEMANGLE_COMPONENT_VIRTUAL_THUNK' value='16'/>
      <enumerator name='DEMANGLE_COMPONENT_COVARIANT_THUNK' value='17'/>
      <enumerator name='DEMANGLE_COMPONENT_JAVA_CLASS' value='18'/>
      <enumerator name='DEMANGLE_COMPONENT_GUARD' value='19'/>
      <enumerator name='DEMANGLE_COMPONENT_TLS_INIT' value='20'/>
      <enumerator name='DEMANGLE_COMPONENT_TLS_WRAPPER' value='21'/>
      <enumerator name='DEMANGLE_COMPONENT_REFTEMP' value='22'/>
      <enumerator name='DEMANGLE_COMPONENT_HIDDEN_ALIAS' value='23'/>
      <enumerator name='DEMANGLE_COMPONENT_SUB_STD' value='24'/>
      <enumerator name='DEMANGLE_COMPONENT_RESTRICT' value='25'/>
      <enumerator name='DEMANGLE_COMPONENT_VOLATILE' value='26'/>
      <enumerator name='DEMANGLE_COMPONENT_CONST' value='27'/>
      <enumerator name='DEMANGLE_COMPONENT_RESTRICT_THIS' value='28'/>
      <enumerator name='DEMANGLE_COMPONENT_VOLATILE_THIS' value='29'/>
      <enumerator name='DEMANGLE_COMPONENT_CONST_THIS' value='30'/>
      <enumerator name='DEMANGLE_COMPONENT_REFERENCE_THIS' value='31'/>
      <enumerator name='DEMANGLE_COMPONENT_RVALUE_REFERENCE_THIS' value='32'/>
      <enumerator name='DEMANGLE_COMPONENT_VENDOR_TYPE_QUAL' value='33'/>
      <enumerator name='DEMANGLE_COMPONENT_POINTER' value='34'/>
      <enumerator name='DEMANGLE_COMPONENT_REFERENCE' value='35'/>
      <enumerator name='DEMANGLE_COMPONENT_RVALUE_REFERENCE' value='36'/>
      <enumerator name='DEMANGLE_COMPONENT_COMPLEX' value='37'/>
      <enumerator name='DEMANGLE_COMPONENT_IMAGINARY' value='38'/>
      <enumerator name='DEMANGLE_COMPONENT_BUILTIN_TYPE' value='39'/>
      <enumerator name='DEMANGLE_COMPONENT_VENDOR_TYPE' value='40'/>
      <enumerator name='DEMANGLE_COMPONENT_FUNCTION_TYPE' value='41'/>
      <enumerator name='DEMANGLE_COMPONENT_ARRAY_TYPE' value='42'/>
      <enumerator name='DEMANGLE_COMPONENT_PTRMEM_TYPE' value='43'/>
      <enumerator name='DEMANGLE_COMPONENT_FIXED_TYPE' value='44'/>
      <enumerator name='DEMANGLE_COMPONENT_VECTOR_TYPE' value='45'/>
      <enumerator name='DEMANGLE_COMPONENT_ARGLIST' value='46'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE_ARGLIST' value='47'/>
      <enumerator name='DEMANGLE_COMPONENT_INITIALIZER_LIST' value='48'/>
      <enumerator name='DEMANGLE_COMPONENT_OPERATOR' value='49'/>
      <enumerator name='DEMANGLE_COMPONENT_EXTENDED_OPERATOR' value='50'/>
      <enumerator name='DEMANGLE_COMPONENT_CAST' value='51'/>
      <enumerator name='DEMANGLE_COMPONENT_NULLARY' value='52'/>
      <enumerator name='DEMANGLE_COMPONENT_UNARY' value='53'/>
      <enumerator name='DEMANGLE_COMPONENT_BINARY' value='54'/>
      <enumerator name='DEMANGLE_COMPONENT_BINARY_ARGS' value='55'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY' value='56'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY_ARG1' value='57'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY_ARG2' value='58'/>
      <enumerator name='DEMANGLE_COMPONENT_LITERAL' value='59'/>
      <enumerator name='DEMANGLE_COMPONENT_LITERAL_NEG' value='60'/>
      <enumerator name='DEMANGLE_COMPONENT_JAVA_RESOURCE' value='61'/>
      <enumerator name='DEMANGLE_COMPONENT_COMPOUND_NAME' value='62'/>
      <enumerator name='DEMANGLE_COMPONENT_CHARACTER' value='63'/>
      <enumerator name='DEMANGLE_COMPONENT_NUMBER' value='64'/>
      <enumerator name='DEMANGLE_COMPONENT_DECLTYPE' value='65'/>
      <enumerator name='DEMANGLE_COMPONENT_GLOBAL_CONSTRUCTORS' value='66'/>
      <enumerator name='DEMANGLE_COMPONENT_GLOBAL_DESTRUCTORS' value='67'/>
      <enumerator name='DEMANGLE_COMPONENT_LAMBDA' value='68'/>
      <enumerator name='DEMANGLE_COMPONENT_DEFAULT_ARG' value='69'/>
      <enumerator name='DEMANGLE_COMPONENT_UNNAMED_TYPE' value='70'/>
      <enumerator name='DEMANGLE_COMPONENT_TRANSACTION_CLONE' value='71'/>
      <enumerator name='DEMANGLE_COMPONENT_NONTRANSACTION_CLONE' value='72'/>
      <enumerator name='DEMANGLE_COMPONENT_PACK_EXPANSION' value='73'/>
      <enumerator name='DEMANGLE_COMPONENT_TAGGED_NAME' value='74'/>
      <enumerator name='DEMANGLE_COMPONENT_CLONE' value='75'/>
    </enum-decl>
    <!-- struct demangle_component -->
    <class-decl name='demangle_component' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='453' column='1' id='ba4bc320'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- demangle_component_type demangle_component::type -->
        <var-decl name='type' type-id='79b3b2c2' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {struct {const char* s; int len;} s_name; struct {const demangle_operator_info* op;} s_operator; struct {int args; demangle_component* name;} s_extended_operator; struct {demangle_component* length; short int accum; short int sat;} s_fixed; struct {gnu_v3_ctor_kinds kind; demangle_component* name;} s_ctor; struct {gnu_v3_dtor_kinds kind; demangle_component* name;} s_dtor; struct {const demangle_builtin_type_info* type;} s_builtin; struct {const char* string; int len;} s_string; struct {long int number;} s_number; struct {int character;} s_character; struct {demangle_component* left; demangle_component* right;} s_binary; struct {demangle_component* sub; int num;} s_unary_num;} demangle_component::u -->
        <var-decl name='u' type-id='ac5ab595' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='560' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {struct {const char* s; int len;} s_name; struct {const demangle_operator_info* op;} s_operator; struct {int args; demangle_component* name;} s_extended_operator; struct {demangle_component* length; short int accum; short int sat;} s_fixed; struct {gnu_v3_ctor_kinds kind; demangle_component* name;} s_ctor; struct {gnu_v3_dtor_kinds kind; demangle_component* name;} s_dtor; struct {const demangle_builtin_type_info* type;} s_builtin; struct {const char* string; int len;} s_string; struct {long int number;} s_number; struct {int character;} s_character; struct {demangle_component* left; demangle_component* right;} s_binary; struct {demangle_component* sub; int num;} s_unary_num;} -->
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='458' column='1' id='ac5ab595'>
      <data-member access='public'>
        <!-- struct {const char* s; int len;} s_name -->
        <var-decl name='s_name' type-id='e7f43f72' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='467' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {const demangle_operator_info* op;} s_operator -->
        <var-decl name='s_operator' type-id='e7f43f73' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='474' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {int args; demangle_component* name;} s_extended_operator -->
        <var-decl name='s_extended_operator' type-id='e7f43f74' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='483' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {demangle_component* length; short int accum; short int sat;} s_fixed -->
        <var-decl name='s_fixed' type-id='e7f43f75' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='494' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {gnu_v3_ctor_kinds kind; demangle_component* name;} s_ctor -->
        <var-decl name='s_ctor' type-id='e7f43f76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='503' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {gnu_v3_dtor_kinds kind; demangle_component* name;} s_dtor -->
        <var-decl name='s_dtor' type-id='e7f43f77' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='512' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {const demangle_builtin_type_info* type;} s_builtin -->
        <var-decl name='s_builtin' type-id='e7f43f78' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='519' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {const char* string; int len;} s_string -->
        <var-decl name='s_string' type-id='e7f43f79' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='528' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {long int number;} s_number -->
        <var-decl name='s_number' type-id='e7f43f7a' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='535' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {int character;} s_character -->
        <var-decl name='s_character' type-id='e7f43f7b' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='541' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {demangle_component* left; demangle_component* right;} s_binary -->
        <var-decl name='s_binary' type-id='e7f43f7c' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='550' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {demangle_component* sub; int num;} s_unary_num -->
        <var-decl name='s_unary_num' type-id='e7f43f7d' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='558' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {const char* s; int len;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='461' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* s -->
        <var-decl name='s' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int len -->
        <var-decl name='len' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='466' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {const demangle_operator_info* op;} -->
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='470' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const demangle_operator_info* op -->
        <var-decl name='op' type-id='f11a4d87' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='473' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int args; demangle_component* name;} -->
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='477' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int args -->
        <var-decl name='args' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- demangle_component* name -->
        <var-decl name='name' type-id='e1bff6e6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='482' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {demangle_component* length; short int accum; short int sat;} -->
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='486' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- demangle_component* length -->
        <var-decl name='length' type-id='e1bff6e6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- short int accum -->
        <var-decl name='accum' type-id='a2185560' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <!-- short int sat -->
        <var-decl name='sat' type-id='a2185560' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='493' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {gnu_v3_ctor_kinds kind; demangle_component* name;} -->
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='497' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- gnu_v3_ctor_kinds kind -->
        <var-decl name='kind' type-id='192ea7e1' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- demangle_component* name -->
        <var-decl name='name' type-id='e1bff6e6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='502' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {gnu_v3_dtor_kinds kind; demangle_component* name;} -->
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='506' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- gnu_v3_dtor_kinds kind -->
        <var-decl name='kind' type-id='9de26e36' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- demangle_component* name -->
        <var-decl name='name' type-id='e1bff6e6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='511' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {const demangle_builtin_type_info* type;} -->
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='515' column='1' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const demangle_builtin_type_info* type -->
        <var-decl name='type' type-id='228a5a2b' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='518' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {const char* string; int len;} -->
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='522' column='1' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* string -->
        <var-decl name='string' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int len -->
        <var-decl name='len' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='527' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {long int number;} -->
    <class-decl name='__anonymous_struct__8' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='531' column='1' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long int number -->
        <var-decl name='number' type-id='bd54fe1a' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='534' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int character;} -->
    <class-decl name='__anonymous_struct__9' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='538' column='1' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int character -->
        <var-decl name='character' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='540' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {demangle_component* left; demangle_component* right;} -->
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='544' column='1' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- demangle_component* left -->
        <var-decl name='left' type-id='e1bff6e6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- demangle_component* right -->
        <var-decl name='right' type-id='e1bff6e6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='549' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {demangle_component* sub; int num;} -->
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='552' column='1' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- demangle_component* sub -->
        <var-decl name='sub' type-id='e1bff6e6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int num -->
        <var-decl name='num' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='557' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct demangle_operator_info -->
    <class-decl name='demangle_operator_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='37' column='1' id='cbc847f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* demangle_operator_info::code -->
        <var-decl name='code' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* demangle_operator_info::name -->
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int demangle_operator_info::len -->
        <var-decl name='len' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int demangle_operator_info::args -->
        <var-decl name='args' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum d_builtin_type_print -->
    <enum-decl name='d_builtin_type_print' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='51' column='1' id='46cd757d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='D_PRINT_DEFAULT' value='0'/>
      <enumerator name='D_PRINT_INT' value='1'/>
      <enumerator name='D_PRINT_UNSIGNED' value='2'/>
      <enumerator name='D_PRINT_LONG' value='3'/>
      <enumerator name='D_PRINT_UNSIGNED_LONG' value='4'/>
      <enumerator name='D_PRINT_LONG_LONG' value='5'/>
      <enumerator name='D_PRINT_UNSIGNED_LONG_LONG' value='6'/>
      <enumerator name='D_PRINT_BOOL' value='7'/>
      <enumerator name='D_PRINT_FLOAT' value='8'/>
      <enumerator name='D_PRINT_VOID' value='9'/>
    </enum-decl>
    <!-- struct demangle_builtin_type_info -->
    <class-decl name='demangle_builtin_type_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='77' column='1' id='d810032e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* demangle_builtin_type_info::name -->
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int demangle_builtin_type_info::len -->
        <var-decl name='len' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- const char* demangle_builtin_type_info::java_name -->
        <var-decl name='java_name' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int demangle_builtin_type_info::java_len -->
        <var-decl name='java_len' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- d_builtin_type_print demangle_builtin_type_info::print -->
        <var-decl name='print' type-id='46cd757d' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct d_info -->
    <class-decl name='d_info' size-in-bits='768' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='93' column='1' id='b1858060'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* d_info::s -->
        <var-decl name='s' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* d_info::send -->
        <var-decl name='send' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int d_info::options -->
        <var-decl name='options' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- const char* d_info::n -->
        <var-decl name='n' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- demangle_component* d_info::comps -->
        <var-decl name='comps' type-id='e1bff6e6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int d_info::next_comp -->
        <var-decl name='next_comp' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- int d_info::num_comps -->
        <var-decl name='num_comps' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- demangle_component** d_info::subs -->
        <var-decl name='subs' type-id='2d318324' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int d_info::next_sub -->
        <var-decl name='next_sub' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- int d_info::num_subs -->
        <var-decl name='num_subs' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int d_info::did_subs -->
        <var-decl name='did_subs' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- demangle_component* d_info::last_name -->
        <var-decl name='last_name' type-id='e1bff6e6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- int d_info::expansion -->
        <var-decl name='expansion' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- int d_info::is_expression -->
        <var-decl name='is_expression' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- int d_info::is_conversion -->
        <var-decl name='is_conversion' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <!-- const demangle_builtin_type_info -->
    <qualified-type-def type-id='d810032e' const='yes' id='82ec0423'/>
    <!-- const demangle_builtin_type_info* -->
    <pointer-type-def type-id='82ec0423' size-in-bits='64' id='228a5a2b'/>
    <!-- const demangle_component -->
    <qualified-type-def type-id='ba4bc320' const='yes' id='0c7361ad'/>
    <!-- const demangle_component* -->
    <pointer-type-def type-id='0c7361ad' size-in-bits='64' id='20a28785'/>
    <!-- const demangle_operator_info -->
    <qualified-type-def type-id='cbc847f6' const='yes' id='28c8cc97'/>
    <!-- const demangle_operator_info* -->
    <pointer-type-def type-id='28c8cc97' size-in-bits='64' id='f11a4d87'/>
    <!-- d_info* -->
    <pointer-type-def type-id='b1858060' size-in-bits='64' id='89d35836'/>
    <!-- demangle_component* -->
    <pointer-type-def type-id='ba4bc320' size-in-bits='64' id='e1bff6e6'/>
    <!-- demangle_component** -->
    <pointer-type-def type-id='e1bff6e6' size-in-bits='64' id='2d318324'/>
    <!-- size_t* -->
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <!-- void (const char*, typedef size_t, void*)* -->
    <pointer-type-def type-id='92128534' size-in-bits='64' id='0039c01e'/>
    <!-- int __asan_cplus_demangle_fill_name(demangle_component*, const char*, int) -->
    <function-decl name='__asan_cplus_demangle_fill_name' mangled-name='__asan_cplus_demangle_fill_name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_name'>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='e1bff6e6' name='p' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='s' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='len' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_fill_extended_operator(demangle_component*, int, demangle_component*) -->
    <function-decl name='__asan_cplus_demangle_fill_extended_operator' mangled-name='__asan_cplus_demangle_fill_extended_operator' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_extended_operator'>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='e1bff6e6' name='p' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='args' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='e1bff6e6' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='798' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_fill_ctor(demangle_component*, gnu_v3_ctor_kinds, demangle_component*) -->
    <function-decl name='__asan_cplus_demangle_fill_ctor' mangled-name='__asan_cplus_demangle_fill_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_ctor'>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='e1bff6e6' name='p' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='812' column='1'/>
      <!-- parameter of type 'enum gnu_v3_ctor_kinds' -->
      <parameter type-id='192ea7e1' name='kind' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='813' column='1'/>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='e1bff6e6' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='814' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_fill_dtor(demangle_component*, gnu_v3_dtor_kinds, demangle_component*) -->
    <function-decl name='__asan_cplus_demangle_fill_dtor' mangled-name='__asan_cplus_demangle_fill_dtor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_dtor'>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='e1bff6e6' name='p' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='831' column='1'/>
      <!-- parameter of type 'enum gnu_v3_dtor_kinds' -->
      <parameter type-id='9de26e36' name='kind' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='832' column='1'/>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='e1bff6e6' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='833' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- demangle_component* __asan_cplus_demangle_mangled_name(d_info*, int) -->
    <function-decl name='__asan_cplus_demangle_mangled_name' mangled-name='__asan_cplus_demangle_mangled_name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_mangled_name'>
      <!-- parameter of type 'd_info*' -->
      <parameter type-id='89d35836' name='di' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='top_level' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
      <!-- demangle_component* -->
      <return type-id='e1bff6e6'/>
    </function-decl>
    <!-- const demangle_operator_info __asan_cplus_demangle_operators[62] -->
    <var-decl name='__asan_cplus_demangle_operators' type-id='7fb58723' mangled-name='__asan_cplus_demangle_operators' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1688' column='1' elf-symbol-id='__asan_cplus_demangle_operators'/>
    <!-- const demangle_builtin_type_info __asan_cplus_demangle_builtin_types[33] -->
    <var-decl name='__asan_cplus_demangle_builtin_types' type-id='d527b131' mangled-name='__asan_cplus_demangle_builtin_types' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2188' column='1' elf-symbol-id='__asan_cplus_demangle_builtin_types'/>
    <!-- demangle_component* __asan_cplus_demangle_type(d_info*) -->
    <function-decl name='__asan_cplus_demangle_type' mangled-name='__asan_cplus_demangle_type' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_type'>
      <!-- parameter of type 'd_info*' -->
      <parameter type-id='89d35836' name='di' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2230' column='1'/>
      <!-- demangle_component* -->
      <return type-id='e1bff6e6'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_print_callback(int, const demangle_component*, demangle_callbackref, void*) -->
    <function-decl name='__asan_cplus_demangle_print_callback' mangled-name='__asan_cplus_demangle_print_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print_callback'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1'/>
      <!-- parameter of type 'const demangle_component*' -->
      <parameter type-id='20a28785' name='dc' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4030' column='1'/>
      <!-- parameter of type 'typedef demangle_callbackref' -->
      <parameter type-id='e69e46d6' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4031' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='opaque' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4031' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- char* __asan_cplus_demangle_print(int, const demangle_component*, int, size_t*) -->
    <function-decl name='__asan_cplus_demangle_print' mangled-name='__asan_cplus_demangle_print' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
      <!-- parameter of type 'const demangle_component*' -->
      <parameter type-id='20a28785' name='dc' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='estimate' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='78c01427' name='palc' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- void __asan_cplus_demangle_init_info(const char*, int, size_t, d_info*) -->
    <function-decl name='__asan_cplus_demangle_init_info' mangled-name='__asan_cplus_demangle_init_info' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_init_info'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce' name='len' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <!-- parameter of type 'd_info*' -->
      <parameter type-id='89d35836' name='di' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5732' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- char* __asan_cplus_demangle_v3(const char*, int) -->
    <function-decl name='__asan_cplus_demangle_v3' mangled-name='__asan_cplus_demangle_v3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_v3'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_v3_callback(const char*, int, demangle_callbackref, void*) -->
    <function-decl name='__asan_cplus_demangle_v3_callback' mangled-name='__asan_cplus_demangle_v3_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_v3_callback'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
      <!-- parameter of type 'typedef demangle_callbackref' -->
      <parameter type-id='e69e46d6' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='opaque' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- char* __asan_java_demangle_v3(const char*) -->
    <function-decl name='__asan_java_demangle_v3' mangled-name='__asan_java_demangle_v3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_java_demangle_v3'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- int __asan_java_demangle_v3_callback(const char*, demangle_callbackref, void*) -->
    <function-decl name='__asan_java_demangle_v3_callback' mangled-name='__asan_java_demangle_v3_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_java_demangle_v3_callback'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6047' column='1'/>
      <!-- parameter of type 'typedef demangle_callbackref' -->
      <parameter type-id='e69e46d6' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6048' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='opaque' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6048' column='1'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- gnu_v3_ctor_kinds __asan_is_gnu_v3_mangled_ctor(const char*) -->
    <function-decl name='__asan_is_gnu_v3_mangled_ctor' mangled-name='__asan_is_gnu_v3_mangled_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_is_gnu_v3_mangled_ctor'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6137' column='1'/>
      <!-- enum gnu_v3_ctor_kinds -->
      <return type-id='192ea7e1'/>
    </function-decl>
    <!-- gnu_v3_dtor_kinds __asan_is_gnu_v3_mangled_dtor(const char*) -->
    <function-decl name='__asan_is_gnu_v3_mangled_dtor' mangled-name='__asan_is_gnu_v3_mangled_dtor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_is_gnu_v3_mangled_dtor'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6152' column='1'/>
      <!-- enum gnu_v3_dtor_kinds -->
      <return type-id='9de26e36'/>
    </function-decl>
    <!-- int __asan_internal_memcmp(void*, void*, size_t) -->
    <function-decl name='__asan_internal_memcmp' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- int __asan_internal_strncmp(const char*, const char*, size_t) -->
    <function-decl name='__asan_internal_strncmp' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- size_t __asan_internal_strlen(const char*) -->
    <function-decl name='__asan_internal_strlen' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- typedef size_t -->
      <return type-id='b59d7dce'/>
    </function-decl>
    <!-- int sprintf(char*, const char*, ...) -->
    <function-decl name='sprintf' filepath='/usr/include/stdio.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='26a90f95'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-decl>
    <!-- void* realloc(void*, size_t) -->
    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='485' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void free(void*) -->
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void (const char*, size_t, void*) -->
    <function-type size-in-bits='64' id='92128534'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='b59d7dce'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- char* (const char*) -->
    <function-type size-in-bits='64' id='1258b361'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='mangled'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-type>
    <!-- void (void*) -->
    <function-type size-in-bits='64' id='c5c76c9c'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/bridge.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C_plus_plus'>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- typedef unsigned long int __sanitizer::uptr -->
      <typedef-decl name='uptr' type-id='7359adad' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='56' column='1' id='c8e929d2'/>
    </namespace-decl>
    <!-- int (const char*, const char*, __sanitizer::uptr) -->
    <function-type size-in-bits='64' id='55d73658'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='c8e929d2'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-type>
    <!-- int (void*, void*, __sanitizer::uptr) -->
    <function-type size-in-bits='64' id='8a0bb7d6'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='c8e929d2'/>
      <!-- int -->
      <return type-id='95e97e5e'/>
    </function-type>
    <!-- __sanitizer::uptr (const char*) -->
    <function-type size-in-bits='64' id='289dc5a2'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- typedef __sanitizer::uptr -->
      <return type-id='c8e929d2'/>
    </function-type>
    <!-- void* (void*, int, __sanitizer::uptr) -->
    <function-type size-in-bits='64' id='78df7a12'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='c8e929d2'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-type>
    <!-- void* (void*, void*, __sanitizer::uptr) -->
    <function-type size-in-bits='64' id='3211796b'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='c8e929d2'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- Header*[262144] -->
    <array-type-def dimensions='1' type-id='6cdced3a' size-in-bits='16777216' id='787a4dbd'>
      <!-- <anonymous range>[262144] -->
      <subrange length='262144' type-id='4c87fef4' id='67de4cb2'/>
    </array-type-def>
    <!-- SizeClassInfo[53] -->
    <array-type-def dimensions='1' type-id='77aae7d3' size-in-bits='27136' id='08341acb'>
      <!-- <anonymous range>[53] -->
      <subrange length='53' type-id='4c87fef4' id='3c1a9f65'/>
    </array-type-def>
    <!-- PerClass[53] -->
    <array-type-def dimensions='1' type-id='5c83a039' size-in-bits='440960' id='0109b7a1'>
      <!-- <anonymous range>[53] -->
      <subrange length='53' type-id='4c87fef4' id='3c1a9f65'/>
    </array-type-def>
    <!-- atomic_uint64_t[4] -->
    <array-type-def dimensions='1' type-id='46b20e41' size-in-bits='256' id='05604081'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='4c87fef4' id='16fe7105'/>
    </array-type-def>
    <!-- atomic_uintptr_t[2048] -->
    <array-type-def dimensions='1' type-id='48f335b9' size-in-bits='131072' id='115e0027'>
      <!-- <anonymous range>[2048] -->
      <subrange length='2048' type-id='4c87fef4' id='e5323efb'/>
    </array-type-def>
    <!-- char[32] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' id='16dc656a'>
      <!-- <anonymous range>[32] -->
      <subrange length='32' type-id='4c87fef4' id='ae5bde82'/>
    </array-type-def>
    <!-- unsigned long int[64] -->
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='4096' id='3f38563f'>
      <!-- <anonymous range>[64] -->
      <subrange length='64' type-id='4c87fef4' id='b10be967'/>
    </array-type-def>
    <!-- void*[128] -->
    <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='8192' id='47dd7ec8'>
      <!-- <anonymous range>[128] -->
      <subrange length='128' type-id='4c87fef4' id='1eb1687a'/>
    </array-type-def>
    <!-- void*[64] -->
    <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='4096' id='56f066f9'>
      <!-- <anonymous range>[64] -->
      <subrange length='64' type-id='4c87fef4' id='b10be967'/>
    </array-type-def>
    <!-- __sanitizer::AllocatorGlobalStats* -->
    <pointer-type-def type-id='e586be27' size-in-bits='64' id='962983ef'/>
    <!-- __sanitizer::AllocatorStats* -->
    <pointer-type-def type-id='d97dbaba' size-in-bits='64' id='71e94878'/>
    <!-- __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >* -->
    <pointer-type-def type-id='119903f8' size-in-bits='64' id='b6513ace'/>
    <!-- __sanitizer::CommonFlags* -->
    <pointer-type-def type-id='b603f416' size-in-bits='64' id='5b7f17ec'/>
    <!-- __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>* -->
    <pointer-type-def type-id='60399268' size-in-bits='64' id='c46c724e'/>
    <!-- __sanitizer::InternalAllocator* -->
    <pointer-type-def type-id='a6afb05d' size-in-bits='64' id='02872a6a'/>
    <!-- __sanitizer::InternalAllocatorCache* -->
    <pointer-type-def type-id='1703d8dd' size-in-bits='64' id='92b9b9fc'/>
    <!-- __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>* -->
    <pointer-type-def type-id='0a5cf380' size-in-bits='64' id='f5ef6db6'/>
    <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>* -->
    <pointer-type-def type-id='2fd4a5b9' size-in-bits='64' id='d24b2ce1'/>
    <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header* -->
    <pointer-type-def type-id='5331122c' size-in-bits='64' id='6cdced3a'/>
    <!-- __sanitizer::LowLevelAllocator* -->
    <pointer-type-def type-id='78f20903' size-in-bits='64' id='5e6e9e43'/>
    <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>* -->
    <pointer-type-def type-id='cc039988' size-in-bits='64' id='10b7d6fe'/>
    <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::AllocatorCache* -->
    <pointer-type-def type-id='1bfa7a0a' size-in-bits='64' id='18f25021'/>
    <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::Batch* -->
    <pointer-type-def type-id='21e3ade9' size-in-bits='64' id='e70acaaa'/>
    <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo* -->
    <pointer-type-def type-id='77aae7d3' size-in-bits='64' id='65509e83'/>
    <!-- __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >* -->
    <pointer-type-def type-id='cdd6cfb4' size-in-bits='64' id='8ebf0942'/>
    <!-- __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch* -->
    <pointer-type-def type-id='fd7147de' size-in-bits='64' id='f62f8fc4'/>
    <!-- __sanitizer::SpinMutex* -->
    <pointer-type-def type-id='ae453aa5' size-in-bits='64' id='97841cd5'/>
    <!-- __sanitizer::StaticSpinMutex* -->
    <pointer-type-def type-id='c5c2fa97' size-in-bits='64' id='2c3af02f'/>
    <!-- __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>* -->
    <pointer-type-def type-id='31cd61f0' size-in-bits='64' id='8cb66236'/>
    <!-- __sanitizer::u64* -->
    <pointer-type-def type-id='ceed60aa' size-in-bits='64' id='92a71083'/>
    <!-- __sanitizer::u8* -->
    <pointer-type-def type-id='62fe98d0' size-in-bits='64' id='403b104b'/>
    <!-- const __sanitizer::AllocatorGlobalStats -->
    <qualified-type-def type-id='e586be27' const='yes' id='905a378c'/>
    <!-- const __sanitizer::AllocatorGlobalStats* -->
    <pointer-type-def type-id='905a378c' size-in-bits='64' id='e4059a52'/>
    <!-- const __sanitizer::AllocatorStats -->
    <qualified-type-def type-id='d97dbaba' const='yes' id='04b22859'/>
    <!-- const __sanitizer::AllocatorStats* -->
    <pointer-type-def type-id='04b22859' size-in-bits='64' id='d775ad09'/>
    <!-- const __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> > -->
    <qualified-type-def type-id='119903f8' const='yes' id='3f7ef1f9'/>
    <!-- const __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >* -->
    <pointer-type-def type-id='3f7ef1f9' size-in-bits='64' id='c7d6af29'/>
    <!-- const __sanitizer::CrashOnMapUnmap -->
    <qualified-type-def type-id='783b9e85' const='yes' id='9824c934'/>
    <!-- const __sanitizer::CrashOnMapUnmap* -->
    <pointer-type-def type-id='9824c934' size-in-bits='64' id='9fe89a3a'/>
    <!-- const __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex> -->
    <qualified-type-def type-id='60399268' const='yes' id='19ae1405'/>
    <!-- const __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>& -->
    <reference-type-def kind='lvalue' type-id='19ae1405' size-in-bits='64' id='9009b319'/>
    <!-- const __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch> -->
    <qualified-type-def type-id='0a5cf380' const='yes' id='81ba86a5'/>
    <!-- const __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>* -->
    <pointer-type-def type-id='81ba86a5' size-in-bits='64' id='c7a1d31d'/>
    <!-- const __sanitizer::NoOpMapUnmapCallback -->
    <qualified-type-def type-id='85b37b38' const='yes' id='ee1e904b'/>
    <!-- const __sanitizer::NoOpMapUnmapCallback* -->
    <pointer-type-def type-id='ee1e904b' size-in-bits='64' id='3b1d48b3'/>
    <!-- const __sanitizer::SpinMutex -->
    <qualified-type-def type-id='ae453aa5' const='yes' id='e9196088'/>
    <!-- const __sanitizer::SpinMutex& -->
    <reference-type-def kind='lvalue' type-id='e9196088' size-in-bits='64' id='a0f331ea'/>
    <!-- const __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback> -->
    <qualified-type-def type-id='31cd61f0' const='yes' id='54ec930f'/>
    <!-- const __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>* -->
    <pointer-type-def type-id='54ec930f' size-in-bits='64' id='d56ba33f'/>
    <!-- const __sanitizer::uptr -->
    <qualified-type-def type-id='c8e929d2' const='yes' id='870ffec2'/>
    <!-- const int -->
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <!-- const volatile __sanitizer::atomic_uint64_t -->
    <qualified-type-def type-id='2cc60feb' const='yes' id='fd276754'/>
    <!-- const volatile __sanitizer::atomic_uint64_t* -->
    <pointer-type-def type-id='fd276754' size-in-bits='64' id='0307eb5a'/>
    <!-- const volatile __sanitizer::atomic_uint8_t -->
    <qualified-type-def type-id='bc18d65d' const='yes' id='40672b14'/>
    <!-- const volatile __sanitizer::atomic_uint8_t* -->
    <pointer-type-def type-id='40672b14' size-in-bits='64' id='a069129a'/>
    <!-- const volatile __sanitizer::atomic_uintptr_t -->
    <qualified-type-def type-id='8d2caa8f' const='yes' id='19d7f142'/>
    <!-- const volatile __sanitizer::atomic_uintptr_t* -->
    <pointer-type-def type-id='19d7f142' size-in-bits='64' id='16f106b8'/>
    <!-- void (typedef __sanitizer::uptr, typedef __sanitizer::uptr)* -->
    <pointer-type-def type-id='c147927c' size-in-bits='64' id='9f2b2a0e'/>
    <!-- void (typedef __sanitizer::uptr, void*)* -->
    <pointer-type-def type-id='930359b3' size-in-bits='64' id='614c624f'/>
    <!-- volatile __sanitizer::atomic_uint64_t -->
    <qualified-type-def type-id='46b20e41' volatile='yes' id='2cc60feb'/>
    <!-- volatile __sanitizer::atomic_uint64_t* -->
    <pointer-type-def type-id='2cc60feb' size-in-bits='64' id='3ccaccd3'/>
    <!-- volatile __sanitizer::atomic_uint64_t::Type -->
    <qualified-type-def type-id='6805d964' volatile='yes' id='48f79e83'/>
    <!-- volatile __sanitizer::atomic_uint8_t -->
    <qualified-type-def type-id='2fc373cb' volatile='yes' id='bc18d65d'/>
    <!-- volatile __sanitizer::atomic_uint8_t* -->
    <pointer-type-def type-id='bc18d65d' size-in-bits='64' id='92199d55'/>
    <!-- volatile __sanitizer::atomic_uint8_t::Type -->
    <qualified-type-def type-id='b02550ac' volatile='yes' id='1307e4e5'/>
    <!-- volatile __sanitizer::atomic_uintptr_t -->
    <qualified-type-def type-id='48f335b9' volatile='yes' id='8d2caa8f'/>
    <!-- volatile __sanitizer::atomic_uintptr_t* -->
    <pointer-type-def type-id='8d2caa8f' size-in-bits='64' id='e250a1bf'/>
    <!-- volatile __sanitizer::atomic_uintptr_t::Type -->
    <qualified-type-def type-id='748d5322' volatile='yes' id='0ebc8057'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::SizeClassMap<17ul, 64ul, 14ul> -->
      <class-decl name='SizeClassMap&lt;17ul, 64ul, 14ul&gt;' size-in-bits='8' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='89' column='1' id='7a6f0121'>
        <member-type access='public'>
          <!-- struct __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch -->
          <class-decl name='TransferBatch' size-in-bits='4224' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='103' column='1' id='fd7147de'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch* __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch::next -->
              <var-decl name='next' type-id='f62f8fc4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='104' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch::count -->
              <var-decl name='count' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='105' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- void* __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch::batch[64] -->
              <var-decl name='batch' type-id='56f066f9' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='106' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::kMinSizeLog -->
          <var-decl name='kMinSizeLog' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='90' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::kMidSizeLog -->
          <var-decl name='kMidSizeLog' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='91' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::kMinSize -->
          <var-decl name='kMinSize' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='92' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::kMidSize -->
          <var-decl name='kMidSize' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='93' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::kMidClass -->
          <var-decl name='kMidClass' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='94' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::S -->
          <var-decl name='S' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='95' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::M -->
          <var-decl name='M' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='96' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::kMaxNumCached -->
          <var-decl name='kMaxNumCached' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='99' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::kMaxSize -->
          <var-decl name='kMaxSize' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='109' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::kNumClasses -->
          <var-decl name='kNumClasses' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='110' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::kNumClassesRounded -->
          <var-decl name='kNumClassesRounded' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='113' column='1'/>
        </data-member>
        <member-function access='public' static='yes'>
          <!-- __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::ClassID() -->
          <function-decl name='ClassID' mangled-name='_ZN11__sanitizer12SizeClassMapILm17ELm64ELm14EE7ClassIDEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <!-- __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::Size() -->
          <function-decl name='Size' mangled-name='_ZN11__sanitizer12SizeClassMapILm17ELm64ELm14EE4SizeEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <!-- __sanitizer::uptr __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::MaxCached() -->
          <function-decl name='MaxCached' mangled-name='_ZN11__sanitizer12SizeClassMapILm17ELm64ELm14EE9MaxCachedEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <!-- bool __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::SizeClassRequiresSeparateTransferBatch() -->
          <function-decl name='SizeClassRequiresSeparateTransferBatch' mangled-name='_ZN11__sanitizer12SizeClassMapILm17ELm64ELm14EE38SizeClassRequiresSeparateTransferBatchEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- bool -->
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- enum __sanitizer::AllocatorStat -->
      <enum-decl name='AllocatorStat' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='198' column='1' id='d3f20cd4'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='AllocatorStatMalloced' value='0'/>
        <enumerator name='AllocatorStatFreed' value='1'/>
        <enumerator name='AllocatorStatMmapped' value='2'/>
        <enumerator name='AllocatorStatUnmapped' value='3'/>
        <enumerator name='AllocatorStatCount' value='4'/>
      </enum-decl>
      <!-- class __sanitizer::AllocatorStats -->
      <class-decl name='AllocatorStats' size-in-bits='384' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='209' column='1' id='d97dbaba'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::AllocatorStats* __sanitizer::AllocatorStats::next_ -->
          <var-decl name='next_' type-id='71e94878' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='230' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::AllocatorStats* __sanitizer::AllocatorStats::prev_ -->
          <var-decl name='prev_' type-id='71e94878' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='231' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::atomic_uint64_t __sanitizer::AllocatorStats::stats_[4] -->
          <var-decl name='stats_' type-id='05604081' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='232' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- void __sanitizer::AllocatorStats::Add(__sanitizer::AllocatorStat, __sanitizer::u64) -->
          <function-decl name='Add' mangled-name='_ZN11__sanitizer14AllocatorStats3AddENS_13AllocatorStatEy' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878' is-artificial='yes'/>
            <!-- parameter of type 'enum __sanitizer::AllocatorStat' -->
            <parameter type-id='d3f20cd4'/>
            <!-- parameter of type 'typedef __sanitizer::u64' -->
            <parameter type-id='ceed60aa'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <!-- __sanitizer::u64 __sanitizer::AllocatorStats::Get(__sanitizer::AllocatorStat) -->
          <function-decl name='Get' mangled-name='_ZNK11__sanitizer14AllocatorStats3GetENS_13AllocatorStatE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::AllocatorStats*' -->
            <parameter type-id='d775ad09' is-artificial='yes'/>
            <!-- parameter of type 'enum __sanitizer::AllocatorStat' -->
            <parameter type-id='d3f20cd4'/>
            <!-- typedef __sanitizer::u64 -->
            <return type-id='ceed60aa'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::AllocatorStats::Init() -->
          <function-decl name='Init' mangled-name='_ZN11__sanitizer14AllocatorStats4InitEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class __sanitizer::AllocatorGlobalStats -->
      <class-decl name='AllocatorGlobalStats' size-in-bits='448' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='236' column='1' id='e586be27'>
        <!-- class __sanitizer::AllocatorStats -->
        <base-class access='public' layout-offset-in-bits='0' type-id='d97dbaba'/>
        <data-member access='private' layout-offset-in-bits='384'>
          <!-- __sanitizer::SpinMutex __sanitizer::AllocatorGlobalStats::mu_ -->
          <var-decl name='mu_' type-id='ae453aa5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='274' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- void __sanitizer::AllocatorGlobalStats::Init() -->
          <function-decl name='Init' mangled-name='_ZN11__sanitizer20AllocatorGlobalStats4InitEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::AllocatorGlobalStats*' -->
            <parameter type-id='962983ef' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::AllocatorGlobalStats::Register(__sanitizer::AllocatorStats*) -->
          <function-decl name='Register' mangled-name='_ZN11__sanitizer20AllocatorGlobalStats8RegisterEPNS_14AllocatorStatsE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::AllocatorGlobalStats*' -->
            <parameter type-id='962983ef' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <!-- void __sanitizer::AllocatorGlobalStats::Get(__sanitizer::u64*) -->
          <function-decl name='Get' mangled-name='_ZNK11__sanitizer20AllocatorGlobalStats3GetEPy' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::AllocatorGlobalStats*' -->
            <parameter type-id='e4059a52' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::u64*' -->
            <parameter type-id='92a71083'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::AllocatorGlobalStats::Unregister(__sanitizer::AllocatorStats*) -->
          <function-decl name='Unregister' mangled-name='_ZN11__sanitizer20AllocatorGlobalStats10UnregisterEPNS_14AllocatorStatsE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::AllocatorGlobalStats*' -->
            <parameter type-id='962983ef' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- struct __sanitizer::NoOpMapUnmapCallback -->
      <class-decl name='NoOpMapUnmapCallback' size-in-bits='8' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='278' column='1' id='85b37b38'>
        <member-function access='public' const='yes'>
          <!-- void __sanitizer::NoOpMapUnmapCallback::OnMap(__sanitizer::uptr, __sanitizer::uptr) -->
          <function-decl name='OnMap' mangled-name='_ZNK11__sanitizer20NoOpMapUnmapCallback5OnMapEmm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::NoOpMapUnmapCallback*' -->
            <parameter type-id='3b1d48b3' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- typedef void (typedef __sanitizer::uptr, void*)* __sanitizer::ForEachChunkCallback -->
      <typedef-decl name='ForEachChunkCallback' type-id='614c624f' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='284' column='1' id='3124ca59'/>
      <!-- class __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback> -->
      <class-decl name='TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;' size-in-bits='131136' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='594' column='1' id='31cd61f0'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::atomic_uintptr_t __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>::map1_[2048] -->
          <var-decl name='map1_' type-id='115e0027' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='648' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='131072'>
          <!-- __sanitizer::StaticSpinMutex __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>::mu_ -->
          <var-decl name='mu_' type-id='c5c2fa97' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='649' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- void __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>::TestOnlyInit() -->
          <function-decl name='TestOnlyInit' mangled-name='_ZN11__sanitizer15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEE12TestOnlyInitEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='596' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='8cb66236' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <!-- __sanitizer::u8* __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>::Get(__sanitizer::uptr) -->
          <function-decl name='Get' mangled-name='_ZNK11__sanitizer15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEE3GetEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='d56ba33f' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- __sanitizer::u8* -->
            <return type-id='403b104b'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <!-- __sanitizer::u8 __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>::operator[](__sanitizer::uptr) -->
          <function-decl name='operator[]' mangled-name='_ZNK11__sanitizer15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEixEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='d56ba33f' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- typedef __sanitizer::u8 -->
            <return type-id='62fe98d0'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- __sanitizer::u8* __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>::GetOrCreate(__sanitizer::uptr) -->
          <function-decl name='GetOrCreate' mangled-name='_ZN11__sanitizer15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEE11GetOrCreateEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='8cb66236' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- __sanitizer::u8* -->
            <return type-id='403b104b'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>::set(__sanitizer::uptr, __sanitizer::u8) -->
          <function-decl name='set' mangled-name='_ZN11__sanitizer15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEE3setEmh' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='613' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='8cb66236' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'typedef __sanitizer::u8' -->
            <parameter type-id='62fe98d0'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> -->
      <class-decl name='SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt;' size-in-bits='158272' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='677' column='1' id='cc039988'>
        <member-type access='public'>
          <!-- typedef __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::Batch -->
          <typedef-decl name='Batch' type-id='fd7147de' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='679' column='1' id='21e3ade9'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> > __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::AllocatorCache -->
          <typedef-decl name='AllocatorCache' type-id='cdd6cfb4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='682' column='1' id='1bfa7a0a'/>
        </member-type>
        <member-type access='private'>
          <!-- struct __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo -->
          <class-decl name='SizeClassInfo' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='820' column='1' id='77aae7d3'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- __sanitizer::SpinMutex __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo::mutex -->
              <var-decl name='mutex' type-id='ae453aa5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='821' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch> __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo::free_list -->
              <var-decl name='free_list' type-id='0a5cf380' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='822' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <!-- char __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo::padding[32] -->
              <var-decl name='padding' type-id='16dc656a' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='823' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::kNumClasses -->
          <var-decl name='kNumClasses' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='814' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::kRegionSize -->
          <var-decl name='kRegionSize' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='817' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::kNumPossibleRegions -->
          <var-decl name='kNumPossibleRegions' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='818' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback> __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::possible_regions -->
          <var-decl name='possible_regions' type-id='31cd61f0' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='881' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='131136'>
          <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::size_class_info_array[53] -->
          <var-decl name='size_class_info_array' type-id='08341acb' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='882' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- __sanitizer::uptr __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::ClassID(__sanitizer::uptr) -->
          <function-decl name='ClassID' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E7ClassIDEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='762' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- __sanitizer::uptr __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::ComputeRegionId(__sanitizer::uptr) -->
          <function-decl name='ComputeRegionId' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E15ComputeRegionIdEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='827' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo* __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::GetSizeClassInfo(__sanitizer::uptr) -->
          <function-decl name='GetSizeClassInfo' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E16GetSizeClassInfoEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='848' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo* -->
            <return type-id='65509e83'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- __sanitizer::uptr __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::GetSizeClass(void*) -->
          <function-decl name='GetSizeClass' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E12GetSizeClassEPKv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='742' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='eaa32e2f'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::DeallocateBatch(__sanitizer::AllocatorStats*, __sanitizer::uptr, __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::Batch*) -->
          <function-decl name='DeallocateBatch' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E15DeallocateBatchEPNS_14AllocatorStatsEmPNS2_13TransferBatchE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='730' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::Batch*' -->
            <parameter type-id='e70acaaa'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- __sanitizer::uptr __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::AllocateRegion(__sanitizer::AllocatorStats*, __sanitizer::uptr) -->
          <function-decl name='AllocateRegion' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E14AllocateRegionEPNS_14AllocatorStatsEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='837' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <!-- bool __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::CanAllocate(__sanitizer::uptr) -->
          <function-decl name='CanAllocate' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E11CanAllocateEmm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='701' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- bool -->
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::Init() -->
          <function-decl name='Init' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E4InitEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='684' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::PopulateFreeList(__sanitizer::AllocatorStats*, __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::AllocatorCache*, __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo*, __sanitizer::uptr) -->
          <function-decl name='PopulateFreeList' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E16PopulateFreeListEPNS_14AllocatorStatsEPNS_28SizeClassAllocatorLocalCacheIS6_EEPNS6_13SizeClassInfoEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='853' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::AllocatorCache*' -->
            <parameter type-id='18f25021'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::SizeClassInfo*' -->
            <parameter type-id='65509e83'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::Batch* __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::AllocateBatch(__sanitizer::AllocatorStats*, __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::AllocatorCache*, __sanitizer::uptr) -->
          <function-decl name='AllocateBatch' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E13AllocateBatchEPNS_14AllocatorStatsEPNS_28SizeClassAllocatorLocalCacheIS6_EEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='717' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::AllocatorCache*' -->
            <parameter type-id='18f25021'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::Batch* -->
            <return type-id='e70acaaa'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- bool __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::PointerIsMine(void*) -->
          <function-decl name='PointerIsMine' mangled-name='_ZN11__sanitizer20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES4_E13PointerIsMineEPKv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='738' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='eaa32e2f'/>
            <!-- bool -->
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- struct __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> > -->
      <class-decl name='SizeClassAllocatorLocalCache&lt;__sanitizer::SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt; &gt;' size-in-bits='441344' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='889' column='1' id='cdd6cfb4'>
        <member-type access='public'>
          <!-- typedef __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::Batch -->
          <typedef-decl name='Batch' type-id='fd7147de' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='941' column='1' id='6e12dfa1'/>
        </member-type>
        <member-type access='public'>
          <!-- struct __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass -->
          <class-decl name='PerClass' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='942' column='1' id='5c83a039'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- __sanitizer::uptr __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass::count -->
              <var-decl name='count' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='943' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- __sanitizer::uptr __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass::max_count -->
              <var-decl name='max_count' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='944' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- void* __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass::batch[128] -->
              <var-decl name='batch' type-id='47dd7ec8' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='945' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::kNumClasses -->
          <var-decl name='kNumClasses' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='891' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::per_class_[53] -->
          <var-decl name='per_class_' type-id='0109b7a1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='947' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='440960'>
          <!-- __sanitizer::AllocatorStats __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::stats_ -->
          <var-decl name='stats_' type-id='d97dbaba' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='948' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- void __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::InitCache() -->
          <function-decl name='InitCache' mangled-name='_ZN11__sanitizer28SizeClassAllocatorLocalCacheINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EEE9InitCacheEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='950' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void* __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::Allocate(__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*, __sanitizer::uptr) -->
          <function-decl name='Allocate' mangled-name='_ZN11__sanitizer28SizeClassAllocatorLocalCacheINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EEE8AllocateEPS7_m' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='905' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void* -->
            <return type-id='eaa32e2f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::Deallocate(__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*, __sanitizer::uptr, void*) -->
          <function-decl name='Deallocate' mangled-name='_ZN11__sanitizer28SizeClassAllocatorLocalCacheINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EEE10DeallocateEPS7_mPv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='917' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='eaa32e2f'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::Refill(__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*, __sanitizer::uptr) -->
          <function-decl name='Refill' mangled-name='_ZN11__sanitizer28SizeClassAllocatorLocalCacheINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EEE6RefillEPS7_m' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='959' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::Drain(__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*, __sanitizer::uptr) -->
          <function-decl name='Drain' mangled-name='_ZN11__sanitizer28SizeClassAllocatorLocalCacheINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EEE5DrainEPS7_m' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='971' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::Init(__sanitizer::AllocatorGlobalStats*) -->
          <function-decl name='Init' mangled-name='_ZN11__sanitizer28SizeClassAllocatorLocalCacheINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EEE4InitEPNS_20AllocatorGlobalStatsE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='893' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::AllocatorGlobalStats*' -->
            <parameter type-id='962983ef'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::Destroy(__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*, __sanitizer::AllocatorGlobalStats*) -->
          <function-decl name='Destroy' mangled-name='_ZN11__sanitizer28SizeClassAllocatorLocalCacheINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EEE7DestroyEPS7_PNS_20AllocatorGlobalStatsE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='899' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe'/>
            <!-- parameter of type '__sanitizer::AllocatorGlobalStats*' -->
            <parameter type-id='962983ef'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::Drain(__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*) -->
          <function-decl name='Drain' mangled-name='_ZN11__sanitizer28SizeClassAllocatorLocalCacheINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EEE5DrainEPS7_' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='931' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>*' -->
            <parameter type-id='10b7d6fe'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> -->
      <class-decl name='LargeMmapAllocator&lt;__sanitizer::CrashOnMapUnmap&gt;' size-in-bits='16781952' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='995' column='1' id='2fd4a5b9'>
        <member-type access='private'>
          <!-- struct __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header -->
          <class-decl name='Header' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1186' column='1' id='5331122c'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header::map_beg -->
              <var-decl name='map_beg' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1187' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header::map_size -->
              <var-decl name='map_size' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1188' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header::size -->
              <var-decl name='size' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1189' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header::chunk_idx -->
              <var-decl name='chunk_idx' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1190' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <!-- struct __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Stats -->
          <class-decl name='Stats' size-in-bits='4352' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1215' column='1' id='0df76e78'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Stats::n_allocs -->
              <var-decl name='n_allocs' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Stats::n_frees -->
              <var-decl name='n_frees' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Stats::currently_allocated -->
              <var-decl name='currently_allocated' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Stats::max_allocated -->
              <var-decl name='max_allocated' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <!-- unsigned long int __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Stats::by_size_log[64] -->
              <var-decl name='by_size_log' type-id='3f38563f' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <!-- static const int __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::kMaxNumChunks -->
          <var-decl name='kMaxNumChunks' type-id='2448a865' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1185' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::page_size_ -->
          <var-decl name='page_size_' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1210' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header* __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::chunks_[262144] -->
          <var-decl name='chunks_' type-id='787a4dbd' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1211' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777280'>
          <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::n_chunks_ -->
          <var-decl name='n_chunks_' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1212' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777344'>
          <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::min_mmap_ -->
          <var-decl name='min_mmap_' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1213' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777408'>
          <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::max_mmap_ -->
          <var-decl name='max_mmap_' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1213' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777472'>
          <!-- bool __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::chunks_sorted_ -->
          <var-decl name='chunks_sorted_' type-id='c894953d' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1214' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777536'>
          <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Stats __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::stats -->
          <var-decl name='stats' type-id='0df76e78' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1217' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16781888'>
          <!-- __sanitizer::SpinMutex __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::mutex_ -->
          <var-decl name='mutex_' type-id='ae453aa5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1218' column='1'/>
        </data-member>
        <member-function access='private'>
          <!-- __sanitizer::uptr __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::RoundUpMapSize(__sanitizer::uptr) -->
          <function-decl name='RoundUpMapSize' mangled-name='_ZN11__sanitizer18LargeMmapAllocatorINS_15CrashOnMapUnmapEE14RoundUpMapSizeEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1206' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>*' -->
            <parameter type-id='d24b2ce1' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void* __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Allocate(__sanitizer::AllocatorStats*, __sanitizer::uptr, __sanitizer::uptr) -->
          <function-decl name='Allocate' mangled-name='_ZN11__sanitizer18LargeMmapAllocatorINS_15CrashOnMapUnmapEE8AllocateEPNS_14AllocatorStatsEmm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1002' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>*' -->
            <parameter type-id='d24b2ce1' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void* -->
            <return type-id='eaa32e2f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header* __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::GetHeader(void*) -->
          <function-decl name='GetHeader' mangled-name='_ZN11__sanitizer18LargeMmapAllocatorINS_15CrashOnMapUnmapEE9GetHeaderEPKv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1197' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>*' -->
            <parameter type-id='d24b2ce1' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='eaa32e2f'/>
            <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header* -->
            <return type-id='6cdced3a'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Init() -->
          <function-decl name='Init' mangled-name='_ZN11__sanitizer18LargeMmapAllocatorINS_15CrashOnMapUnmapEE4InitEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='997' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>*' -->
            <parameter type-id='d24b2ce1' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header* __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::GetHeader(__sanitizer::uptr) -->
          <function-decl name='GetHeader' mangled-name='_ZN11__sanitizer18LargeMmapAllocatorINS_15CrashOnMapUnmapEE9GetHeaderEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1193' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>*' -->
            <parameter type-id='d24b2ce1' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header* -->
            <return type-id='6cdced3a'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Deallocate(__sanitizer::AllocatorStats*, void*) -->
          <function-decl name='Deallocate' mangled-name='_ZN11__sanitizer18LargeMmapAllocatorINS_15CrashOnMapUnmapEE10DeallocateEPNS_14AllocatorStatsEPv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1040' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>*' -->
            <parameter type-id='d24b2ce1' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::AllocatorStats*' -->
            <parameter type-id='71e94878'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='eaa32e2f'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> > -->
      <class-decl name='CombinedAllocator&lt;__sanitizer::SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::SizeClassAllocatorLocalCache&lt;__sanitizer::SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt; &gt;, __sanitizer::LargeMmapAllocator&lt;__sanitizer::CrashOnMapUnmap&gt; &gt;' size-in-bits='16940672' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1229' column='1' id='119903f8'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >::primary_ -->
          <var-decl name='primary_' type-id='cc039988' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1368' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='158272'>
          <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >::secondary_ -->
          <var-decl name='secondary_' type-id='2fd4a5b9' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1369' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16940224'>
          <!-- __sanitizer::AllocatorGlobalStats __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >::stats_ -->
          <var-decl name='stats_' type-id='e586be27' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1370' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- void* __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >::Allocate(__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*, __sanitizer::uptr, __sanitizer::uptr, bool) -->
          <function-decl name='Allocate' mangled-name='_ZN11__sanitizer17CombinedAllocatorINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EENS_28SizeClassAllocatorLocalCacheIS7_EENS_18LargeMmapAllocatorINS_15CrashOnMapUnmapEEEE8AllocateEPS9_mmb' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1237' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >*' -->
            <parameter type-id='b6513ace' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'bool' -->
            <parameter type-id='c894953d'/>
            <!-- void* -->
            <return type-id='eaa32e2f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >::Init() -->
          <function-decl name='Init' mangled-name='_ZN11__sanitizer17CombinedAllocatorINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EENS_28SizeClassAllocatorLocalCacheIS7_EENS_18LargeMmapAllocatorINS_15CrashOnMapUnmapEEEE4InitEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1231' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >*' -->
            <parameter type-id='b6513ace' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >::Deallocate(__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*, void*) -->
          <function-decl name='Deallocate' mangled-name='_ZN11__sanitizer17CombinedAllocatorINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EENS_28SizeClassAllocatorLocalCacheIS7_EENS_18LargeMmapAllocatorINS_15CrashOnMapUnmapEEEE10DeallocateEPS9_Pv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1259' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >*' -->
            <parameter type-id='b6513ace' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='eaa32e2f'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >::InitCache(__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*) -->
          <function-decl name='InitCache' mangled-name='_ZN11__sanitizer17CombinedAllocatorINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EENS_28SizeClassAllocatorLocalCacheIS7_EENS_18LargeMmapAllocatorINS_15CrashOnMapUnmapEEEE9InitCacheEPS9_' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1327' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >*' -->
            <parameter type-id='b6513ace' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >::DestroyCache(__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*) -->
          <function-decl name='DestroyCache' mangled-name='_ZN11__sanitizer17CombinedAllocatorINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EENS_28SizeClassAllocatorLocalCacheIS7_EENS_18LargeMmapAllocatorINS_15CrashOnMapUnmapEEEE12DestroyCacheEPS9_' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1331' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >*' -->
            <parameter type-id='b6513ace' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >::SwallowCache(__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*) -->
          <function-decl name='SwallowCache' mangled-name='_ZN11__sanitizer17CombinedAllocatorINS_20SizeClassAllocator32ILm0ELy140737488355328ELm16ENS_12SizeClassMapILm17ELm64ELm14EEELm24ENS_15TwoLevelByteMapILy2048ELy4096ENS_20NoOpMapUnmapCallbackEEES5_EENS_28SizeClassAllocatorLocalCacheIS7_EENS_18LargeMmapAllocatorINS_15CrashOnMapUnmapEEEE12SwallowCacheEPS9_' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1335' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> >*' -->
            <parameter type-id='b6513ace' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >*' -->
            <parameter type-id='8ebf0942'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- typedef __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> > __sanitizer::InternalAllocatorCache -->
      <typedef-decl name='InternalAllocatorCache' type-id='cdd6cfb4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='43' column='1' id='1703d8dd'/>
      <!-- struct __sanitizer::CrashOnMapUnmap -->
      <class-decl name='CrashOnMapUnmap' size-in-bits='8' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='47' column='1' id='783b9e85'>
        <member-function access='public' const='yes'>
          <!-- void __sanitizer::CrashOnMapUnmap::OnMap(__sanitizer::uptr, __sanitizer::uptr) -->
          <function-decl name='OnMap' mangled-name='_ZNK11__sanitizer15CrashOnMapUnmap5OnMapEmm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::CrashOnMapUnmap*' -->
            <parameter type-id='9fe89a3a' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <!-- void __sanitizer::CrashOnMapUnmap::OnUnmap(__sanitizer::uptr, __sanitizer::uptr) -->
          <function-decl name='OnUnmap' mangled-name='_ZNK11__sanitizer15CrashOnMapUnmap7OnUnmapEmm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::CrashOnMapUnmap*' -->
            <parameter type-id='9fe89a3a' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- typedef __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> > __sanitizer::InternalAllocator -->
      <typedef-decl name='InternalAllocator' type-id='119903f8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='58' column='1' id='a6afb05d'/>
      <!-- enum __sanitizer::memory_order -->
      <enum-decl name='memory_order' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='19' column='1' id='6a042121'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='memory_order_relaxed' value='1'/>
        <enumerator name='memory_order_consume' value='2'/>
        <enumerator name='memory_order_acquire' value='4'/>
        <enumerator name='memory_order_release' value='8'/>
        <enumerator name='memory_order_acq_rel' value='16'/>
        <enumerator name='memory_order_seq_cst' value='32'/>
      </enum-decl>
      <!-- struct __sanitizer::atomic_uint8_t -->
      <class-decl name='atomic_uint8_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='28' column='1' id='2fc373cb'>
        <member-type access='public'>
          <!-- typedef __sanitizer::u8 __sanitizer::atomic_uint8_t::Type -->
          <typedef-decl name='Type' type-id='62fe98d0' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='29' column='1' id='b02550ac'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- volatile __sanitizer::atomic_uint8_t::Type __sanitizer::atomic_uint8_t::val_dont_use -->
          <var-decl name='val_dont_use' type-id='1307e4e5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='30' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::atomic_uint64_t -->
      <class-decl name='atomic_uint64_t' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='43' column='1' id='46b20e41'>
        <member-type access='public'>
          <!-- typedef __sanitizer::u64 __sanitizer::atomic_uint64_t::Type -->
          <typedef-decl name='Type' type-id='ceed60aa' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='44' column='1' id='6805d964'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- volatile __sanitizer::atomic_uint64_t::Type __sanitizer::atomic_uint64_t::val_dont_use -->
          <var-decl name='val_dont_use' type-id='48f79e83' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='45' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::atomic_uintptr_t -->
      <class-decl name='atomic_uintptr_t' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='48' column='1' id='48f335b9'>
        <member-type access='public'>
          <!-- typedef __sanitizer::uptr __sanitizer::atomic_uintptr_t::Type -->
          <typedef-decl name='Type' type-id='c8e929d2' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='49' column='1' id='748d5322'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- volatile __sanitizer::atomic_uintptr_t::Type __sanitizer::atomic_uintptr_t::val_dont_use -->
          <var-decl name='val_dont_use' type-id='0ebc8057' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='50' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::LowLevelAllocator -->
      <class-decl name='LowLevelAllocator' size-in-bits='128' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='108' column='1' id='78f20903'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- char* __sanitizer::LowLevelAllocator::allocated_end_ -->
          <var-decl name='allocated_end_' type-id='26a90f95' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='113' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- char* __sanitizer::LowLevelAllocator::allocated_current_ -->
          <var-decl name='allocated_current_' type-id='26a90f95' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='114' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- void* __sanitizer::LowLevelAllocator::Allocate(__sanitizer::uptr) -->
          <function-decl name='Allocate' mangled-name='_ZN11__sanitizer17LowLevelAllocator8AllocateEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LowLevelAllocator*' -->
            <parameter type-id='5e6e9e43' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void* -->
            <return type-id='eaa32e2f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- typedef void (typedef __sanitizer::uptr, typedef __sanitizer::uptr)* __sanitizer::LowLevelAllocateCallback -->
      <typedef-decl name='LowLevelAllocateCallback' type-id='9f2b2a0e' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='116' column='1' id='87a1dc59'/>
      <!-- struct __sanitizer::CommonFlags -->
      <class-decl name='CommonFlags' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='23' column='1' id='b603f416'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- bool __sanitizer::CommonFlags::symbolize -->
          <var-decl name='symbolize' type-id='c894953d' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='25' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- const char* __sanitizer::CommonFlags::external_symbolizer_path -->
          <var-decl name='external_symbolizer_path' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- const char* __sanitizer::CommonFlags::strip_path_prefix -->
          <var-decl name='strip_path_prefix' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <!-- bool __sanitizer::CommonFlags::fast_unwind_on_fatal -->
          <var-decl name='fast_unwind_on_fatal' type-id='c894953d' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='200'>
          <!-- bool __sanitizer::CommonFlags::fast_unwind_on_malloc -->
          <var-decl name='fast_unwind_on_malloc' type-id='c894953d' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='208'>
          <!-- bool __sanitizer::CommonFlags::handle_ioctl -->
          <var-decl name='handle_ioctl' type-id='c894953d' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <!-- int __sanitizer::CommonFlags::malloc_context_size -->
          <var-decl name='malloc_context_size' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <!-- const char* __sanitizer::CommonFlags::log_path -->
          <var-decl name='log_path' type-id='80f4b756' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='42' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <!-- int __sanitizer::CommonFlags::verbosity -->
          <var-decl name='verbosity' type-id='95e97e5e' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='352'>
          <!-- bool __sanitizer::CommonFlags::detect_leaks -->
          <var-decl name='detect_leaks' type-id='c894953d' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='360'>
          <!-- bool __sanitizer::CommonFlags::leak_check_at_exit -->
          <var-decl name='leak_check_at_exit' type-id='c894953d' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='368'>
          <!-- bool __sanitizer::CommonFlags::allocator_may_return_null -->
          <var-decl name='allocator_may_return_null' type-id='c894953d' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='376'>
          <!-- bool __sanitizer::CommonFlags::print_summary -->
          <var-decl name='print_summary' type-id='c894953d' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='54' column='1'/>
        </data-member>
      </class-decl>
      <!-- typedef unsigned char __sanitizer::u8 -->
      <typedef-decl name='u8' type-id='002ac4a6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='66' column='1' id='62fe98d0'/>
      <!-- typedef long long unsigned int __sanitizer::u64 -->
      <typedef-decl name='u64' type-id='3a47d82b' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='69' column='1' id='ceed60aa'/>
      <!-- struct __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch> -->
      <class-decl name='IntrusiveList&lt;__sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;::TransferBatch&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='26' column='1' id='0a5cf380'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- __sanitizer::uptr __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>::size_ -->
          <var-decl name='size_' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='115' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch* __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>::first_ -->
          <var-decl name='first_' type-id='f62f8fc4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='116' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch* __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>::last_ -->
          <var-decl name='last_' type-id='f62f8fc4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='117' column='1'/>
        </data-member>
        <member-function access='public' const='yes'>
          <!-- bool __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>::empty() -->
          <function-decl name='empty' mangled-name='_ZNK11__sanitizer13IntrusiveListINS_12SizeClassMapILm17ELm64ELm14EE13TransferBatchEE5emptyEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>*' -->
            <parameter type-id='c7a1d31d' is-artificial='yes'/>
            <!-- bool -->
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch* __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>::front() -->
          <function-decl name='front' mangled-name='_ZN11__sanitizer13IntrusiveListINS_12SizeClassMapILm17ELm64ELm14EE13TransferBatchEE5frontEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>*' -->
            <parameter type-id='f5ef6db6' is-artificial='yes'/>
            <!-- __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch* -->
            <return type-id='f62f8fc4'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>::push_front(__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch*) -->
          <function-decl name='push_front' mangled-name='_ZN11__sanitizer13IntrusiveListINS_12SizeClassMapILm17ELm64ELm14EE13TransferBatchEE10push_frontEPS3_' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>*' -->
            <parameter type-id='f5ef6db6' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch*' -->
            <parameter type-id='f62f8fc4'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>::push_back(__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch*) -->
          <function-decl name='push_back' mangled-name='_ZN11__sanitizer13IntrusiveListINS_12SizeClassMapILm17ELm64ELm14EE13TransferBatchEE9push_backEPS3_' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>*' -->
            <parameter type-id='f5ef6db6' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch*' -->
            <parameter type-id='f62f8fc4'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>::pop_front() -->
          <function-decl name='pop_front' mangled-name='_ZN11__sanitizer13IntrusiveListINS_12SizeClassMapILm17ELm64ELm14EE13TransferBatchEE9pop_frontEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::IntrusiveList<__sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch>*' -->
            <parameter type-id='f5ef6db6' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class __sanitizer::StaticSpinMutex -->
      <class-decl name='StaticSpinMutex' size-in-bits='8' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='21' column='1' id='c5c2fa97'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::atomic_uint8_t __sanitizer::StaticSpinMutex::state_ -->
          <var-decl name='state_' type-id='2fc373cb' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='46' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- bool __sanitizer::StaticSpinMutex::TryLock() -->
          <function-decl name='TryLock' mangled-name='_ZN11__sanitizer15StaticSpinMutex7TryLockEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::StaticSpinMutex*' -->
            <parameter type-id='2c3af02f' is-artificial='yes'/>
            <!-- bool -->
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::StaticSpinMutex::Unlock() -->
          <function-decl name='Unlock' mangled-name='_ZN11__sanitizer15StaticSpinMutex6UnlockEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::StaticSpinMutex*' -->
            <parameter type-id='2c3af02f' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::StaticSpinMutex::Init() -->
          <function-decl name='Init' mangled-name='_ZN11__sanitizer15StaticSpinMutex4InitEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::StaticSpinMutex*' -->
            <parameter type-id='2c3af02f' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void __sanitizer::StaticSpinMutex::LockSlow() -->
          <function-decl name='LockSlow' mangled-name='_ZN11__sanitizer15StaticSpinMutex8LockSlowEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::StaticSpinMutex*' -->
            <parameter type-id='2c3af02f' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::StaticSpinMutex::Lock() -->
          <function-decl name='Lock' mangled-name='_ZN11__sanitizer15StaticSpinMutex4LockEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::StaticSpinMutex*' -->
            <parameter type-id='2c3af02f' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class __sanitizer::SpinMutex -->
      <class-decl name='SpinMutex' size-in-bits='8' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='61' column='1' id='ae453aa5'>
        <!-- class __sanitizer::StaticSpinMutex -->
        <base-class access='public' layout-offset-in-bits='0' type-id='c5c2fa97'/>
        <member-function access='public' constructor='yes'>
          <!-- __sanitizer::SpinMutex::SpinMutex() -->
          <function-decl name='SpinMutex' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SpinMutex*' -->
            <parameter type-id='97841cd5' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <!-- __sanitizer::SpinMutex::SpinMutex(const __sanitizer::SpinMutex&) -->
          <function-decl name='SpinMutex' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::SpinMutex*' -->
            <parameter type-id='97841cd5' is-artificial='yes'/>
            <!-- parameter of type 'const __sanitizer::SpinMutex&' -->
            <parameter type-id='a0f331ea'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex> -->
      <class-decl name='GenericScopedLock&lt;__sanitizer::StaticSpinMutex&gt;' size-in-bits='64' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='85' column='1' id='60399268'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::StaticSpinMutex* __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>::mu_ -->
          <var-decl name='mu_' type-id='2c3af02f' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='97' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- void __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>::GenericScopedLock(__sanitizer::StaticSpinMutex*) -->
          <function-decl name='GenericScopedLock' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>*' -->
            <parameter type-id='c46c724e' is-artificial='yes'/>
            <!-- parameter of type '__sanitizer::StaticSpinMutex*' -->
            <parameter type-id='2c3af02f'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <!-- __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>::~GenericScopedLock(int) -->
          <function-decl name='~GenericScopedLock' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>*' -->
            <parameter type-id='c46c724e' is-artificial='yes'/>
            <!-- artificial parameter of type 'int' -->
            <parameter type-id='95e97e5e' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>::GenericScopedLock(const __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>&) -->
          <function-decl name='GenericScopedLock' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>*' -->
            <parameter type-id='c46c724e' is-artificial='yes'/>
            <!-- parameter of type 'const __sanitizer::GenericScopedLock<__sanitizer::StaticSpinMutex>&' -->
            <parameter type-id='9009b319'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- __sanitizer::InternalAllocator* __sanitizer::internal_allocator() -->
      <function-decl name='internal_allocator' mangled-name='_ZN11__sanitizer18internal_allocatorEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- __sanitizer::InternalAllocator* -->
        <return type-id='02872a6a'/>
      </function-decl>
      <!-- void* __sanitizer::AllocatorReturnNull() -->
      <function-decl name='AllocatorReturnNull' mangled-name='_ZN11__sanitizer19AllocatorReturnNullEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- void* -->
        <return type-id='eaa32e2f'/>
      </function-decl>
      <!-- void __sanitizer::atomic_signal_fence(__sanitizer::memory_order) -->
      <function-decl name='atomic_signal_fence' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'enum __sanitizer::memory_order' -->
        <parameter type-id='6a042121'/>
        <!-- void -->
        <return type-id='48b5725f'/>
      </function-decl>
      <!-- void __sanitizer::atomic_thread_fence(__sanitizer::memory_order) -->
      <function-decl name='atomic_thread_fence' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'enum __sanitizer::memory_order' -->
        <parameter type-id='6a042121'/>
        <!-- void -->
        <return type-id='48b5725f'/>
      </function-decl>
      <!-- void __sanitizer::proc_yield(int) -->
      <function-decl name='proc_yield' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'int' -->
        <parameter type-id='95e97e5e'/>
        <!-- void -->
        <return type-id='48b5725f'/>
      </function-decl>
      <!-- __sanitizer::atomic_uint64_t::Type __sanitizer::atomic_load<__sanitizer::atomic_uint64_t>(const volatile __sanitizer::atomic_uint64_t*, __sanitizer::memory_order) -->
      <function-decl name='atomic_load&lt;__sanitizer::atomic_uint64_t&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'const volatile __sanitizer::atomic_uint64_t*' -->
        <parameter type-id='0307eb5a'/>
        <!-- parameter of type 'enum __sanitizer::memory_order' -->
        <parameter type-id='6a042121'/>
        <!-- typedef __sanitizer::atomic_uint64_t::Type -->
        <return type-id='6805d964'/>
      </function-decl>
      <!-- __sanitizer::atomic_uint8_t::Type __sanitizer::atomic_load<__sanitizer::atomic_uint8_t>(const volatile __sanitizer::atomic_uint8_t*, __sanitizer::memory_order) -->
      <function-decl name='atomic_load&lt;__sanitizer::atomic_uint8_t&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'const volatile __sanitizer::atomic_uint8_t*' -->
        <parameter type-id='a069129a'/>
        <!-- parameter of type 'enum __sanitizer::memory_order' -->
        <parameter type-id='6a042121'/>
        <!-- typedef __sanitizer::atomic_uint8_t::Type -->
        <return type-id='b02550ac'/>
      </function-decl>
      <!-- __sanitizer::atomic_uintptr_t::Type __sanitizer::atomic_load<__sanitizer::atomic_uintptr_t>(const volatile __sanitizer::atomic_uintptr_t*, __sanitizer::memory_order) -->
      <function-decl name='atomic_load&lt;__sanitizer::atomic_uintptr_t&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'const volatile __sanitizer::atomic_uintptr_t*' -->
        <parameter type-id='16f106b8'/>
        <!-- parameter of type 'enum __sanitizer::memory_order' -->
        <parameter type-id='6a042121'/>
        <!-- typedef __sanitizer::atomic_uintptr_t::Type -->
        <return type-id='748d5322'/>
      </function-decl>
      <!-- void __sanitizer::atomic_store<__sanitizer::atomic_uint64_t>(volatile __sanitizer::atomic_uint64_t*, __sanitizer::atomic_uint64_t::Type, __sanitizer::memory_order) -->
      <function-decl name='atomic_store&lt;__sanitizer::atomic_uint64_t&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'volatile __sanitizer::atomic_uint64_t*' -->
        <parameter type-id='3ccaccd3'/>
        <!-- parameter of type 'typedef __sanitizer::atomic_uint64_t::Type' -->
        <parameter type-id='6805d964'/>
        <!-- parameter of type 'enum __sanitizer::memory_order' -->
        <parameter type-id='6a042121'/>
        <!-- void -->
        <return type-id='48b5725f'/>
      </function-decl>
      <!-- void __sanitizer::atomic_store<__sanitizer::atomic_uint8_t>(volatile __sanitizer::atomic_uint8_t*, __sanitizer::atomic_uint8_t::Type, __sanitizer::memory_order) -->
      <function-decl name='atomic_store&lt;__sanitizer::atomic_uint8_t&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'volatile __sanitizer::atomic_uint8_t*' -->
        <parameter type-id='92199d55'/>
        <!-- parameter of type 'typedef __sanitizer::atomic_uint8_t::Type' -->
        <parameter type-id='b02550ac'/>
        <!-- parameter of type 'enum __sanitizer::memory_order' -->
        <parameter type-id='6a042121'/>
        <!-- void -->
        <return type-id='48b5725f'/>
      </function-decl>
      <!-- void __sanitizer::atomic_store<__sanitizer::atomic_uintptr_t>(volatile __sanitizer::atomic_uintptr_t*, __sanitizer::atomic_uintptr_t::Type, __sanitizer::memory_order) -->
      <function-decl name='atomic_store&lt;__sanitizer::atomic_uintptr_t&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'volatile __sanitizer::atomic_uintptr_t*' -->
        <parameter type-id='e250a1bf'/>
        <!-- parameter of type 'typedef __sanitizer::atomic_uintptr_t::Type' -->
        <parameter type-id='748d5322'/>
        <!-- parameter of type 'enum __sanitizer::memory_order' -->
        <parameter type-id='6a042121'/>
        <!-- void -->
        <return type-id='48b5725f'/>
      </function-decl>
      <!-- __sanitizer::atomic_uint8_t::Type __sanitizer::atomic_exchange<__sanitizer::atomic_uint8_t>(volatile __sanitizer::atomic_uint8_t*, __sanitizer::atomic_uint8_t::Type, __sanitizer::memory_order) -->
      <function-decl name='atomic_exchange&lt;__sanitizer::atomic_uint8_t&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'volatile __sanitizer::atomic_uint8_t*' -->
        <parameter type-id='92199d55'/>
        <!-- parameter of type 'typedef __sanitizer::atomic_uint8_t::Type' -->
        <parameter type-id='b02550ac'/>
        <!-- parameter of type 'enum __sanitizer::memory_order' -->
        <parameter type-id='6a042121'/>
        <!-- typedef __sanitizer::atomic_uint8_t::Type -->
        <return type-id='b02550ac'/>
      </function-decl>
      <!-- __sanitizer::uptr __sanitizer::MostSignificantSetBitIndex(__sanitizer::uptr) -->
      <function-decl name='MostSignificantSetBitIndex' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'typedef __sanitizer::uptr' -->
        <parameter type-id='c8e929d2'/>
        <!-- typedef __sanitizer::uptr -->
        <return type-id='c8e929d2'/>
      </function-decl>
      <!-- bool __sanitizer::IsPowerOfTwo(__sanitizer::uptr) -->
      <function-decl name='IsPowerOfTwo' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'typedef __sanitizer::uptr' -->
        <parameter type-id='c8e929d2'/>
        <!-- bool -->
        <return type-id='c894953d'/>
      </function-decl>
      <!-- __sanitizer::uptr __sanitizer::RoundUpTo(__sanitizer::uptr, __sanitizer::uptr) -->
      <function-decl name='RoundUpTo' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'typedef __sanitizer::uptr' -->
        <parameter type-id='c8e929d2'/>
        <!-- parameter of type 'typedef __sanitizer::uptr' -->
        <parameter type-id='c8e929d2'/>
        <!-- typedef __sanitizer::uptr -->
        <return type-id='c8e929d2'/>
      </function-decl>
      <!-- bool __sanitizer::IsAligned(__sanitizer::uptr, __sanitizer::uptr) -->
      <function-decl name='IsAligned' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'typedef __sanitizer::uptr' -->
        <parameter type-id='c8e929d2'/>
        <!-- parameter of type 'typedef __sanitizer::uptr' -->
        <parameter type-id='c8e929d2'/>
        <!-- bool -->
        <return type-id='c894953d'/>
      </function-decl>
      <!-- unsigned long int __sanitizer::Min<long unsigned int>(unsigned long int, unsigned long int) -->
      <function-decl name='Min&lt;long unsigned int&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'unsigned long int' -->
        <parameter type-id='7359adad'/>
        <!-- parameter of type 'unsigned long int' -->
        <parameter type-id='7359adad'/>
        <!-- unsigned long int -->
        <return type-id='7359adad'/>
      </function-decl>
      <!-- unsigned long int __sanitizer::Max<long unsigned int>(unsigned long int, unsigned long int) -->
      <function-decl name='Max&lt;long unsigned int&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- parameter of type 'unsigned long int' -->
        <parameter type-id='7359adad'/>
        <!-- parameter of type 'unsigned long int' -->
        <parameter type-id='7359adad'/>
        <!-- unsigned long int -->
        <return type-id='7359adad'/>
      </function-decl>
      <!-- __sanitizer::CommonFlags* __sanitizer::common_flags() -->
      <function-decl name='common_flags' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_flags.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
        <!-- __sanitizer::CommonFlags* -->
        <return type-id='5b7f17ec'/>
      </function-decl>
    </namespace-decl>
    <!-- void (__sanitizer::uptr, __sanitizer::uptr) -->
    <function-type size-in-bits='64' id='c147927c'>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='c8e929d2'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='c8e929d2'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (__sanitizer::uptr, void*) -->
    <function-type size-in-bits='64' id='930359b3'>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='c8e929d2'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void () -->
    <function-type size-in-bits='64' id='ee076206'>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (const char*) -->
    <function-type size-in-bits='64' id='b77bdc37'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (const char*, int, const char*, __sanitizer::u64, __sanitizer::u64) -->
    <function-type size-in-bits='64' id='73cabc0d'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- parameter of type 'typedef __sanitizer::u64' -->
      <parameter type-id='ceed60aa'/>
      <!-- parameter of type 'typedef __sanitizer::u64' -->
      <parameter type-id='ceed60aa'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (int) -->
    <function-type size-in-bits='64' id='f712e2b7'>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- AddressRange[6] -->
    <array-type-def dimensions='1' type-id='14943646' size-in-bits='768' id='19d8bc52'>
      <!-- <anonymous range>[6] -->
      <subrange length='6' type-id='4c87fef4' id='52fa524b'/>
    </array-type-def>
    <!-- char[4096] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
      <!-- <anonymous range>[4096] -->
      <subrange length='4096' type-id='4c87fef4' id='bc1b5ddc'/>
    </array-type-def>
    <!-- unsigned long int[256] -->
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='16384' id='d362a102'>
      <!-- <anonymous range>[256] -->
      <subrange length='256' type-id='4c87fef4' id='36e5b9fa'/>
    </array-type-def>
    <!-- __sanitizer::AddressInfo* -->
    <pointer-type-def type-id='39f1f1c6' size-in-bits='64' id='b5fba8cc'/>
    <!-- __sanitizer::InternalScopedBuffer<char>* -->
    <pointer-type-def type-id='a137668f' size-in-bits='64' id='f39b4c27'/>
    <!-- __sanitizer::InternalScopedString* -->
    <pointer-type-def type-id='d19834e2' size-in-bits='64' id='de331450'/>
    <!-- __sanitizer::LoadedModule* -->
    <pointer-type-def type-id='3c87abeb' size-in-bits='64' id='30b3560b'/>
    <!-- __sanitizer::StackTrace* -->
    <pointer-type-def type-id='44c4da33' size-in-bits='64' id='bc3acb33'/>
    <!-- __sanitizer::Symbolizer* -->
    <pointer-type-def type-id='30a82206' size-in-bits='64' id='8d9c69cc'/>
    <!-- __sanitizer::uptr* -->
    <pointer-type-def type-id='c8e929d2' size-in-bits='64' id='60a62555'/>
    <!-- bool (const unsigned long int&, const unsigned long int&)* -->
    <pointer-type-def type-id='96035b84' size-in-bits='64' id='fdcd7b56'/>
    <!-- bool (void*, char*, int)* -->
    <pointer-type-def type-id='0c8f1687' size-in-bits='64' id='eb904c8b'/>
    <!-- char& -->
    <reference-type-def kind='lvalue' type-id='a84c031d' size-in-bits='64' id='2aa915e1'/>
    <!-- char** -->
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <!-- const __sanitizer::InternalScopedBuffer<char> -->
    <qualified-type-def type-id='a137668f' const='yes' id='fcd9a480'/>
    <!-- const __sanitizer::InternalScopedBuffer<char>& -->
    <reference-type-def kind='lvalue' type-id='fcd9a480' size-in-bits='64' id='b09e3152'/>
    <!-- const __sanitizer::LoadedModule -->
    <qualified-type-def type-id='3c87abeb' const='yes' id='5ece1df0'/>
    <!-- const __sanitizer::LoadedModule* -->
    <pointer-type-def type-id='5ece1df0' size-in-bits='64' id='1878fe2e'/>
    <!-- const __sanitizer::uptr* -->
    <pointer-type-def type-id='870ffec2' size-in-bits='64' id='862e4738'/>
    <!-- const unsigned long int -->
    <qualified-type-def type-id='7359adad' const='yes' id='9cbd1c16'/>
    <!-- const unsigned long int& -->
    <reference-type-def kind='lvalue' type-id='9cbd1c16' size-in-bits='64' id='edb35f90'/>
    <!-- unsigned long int& -->
    <reference-type-def kind='lvalue' type-id='7359adad' size-in-bits='64' id='212c31d1'/>
    <!-- unsigned long int* -->
    <pointer-type-def type-id='7359adad' size-in-bits='64' id='1d2c2b85'/>
    <!-- unsigned long int** -->
    <pointer-type-def type-id='1d2c2b85' size-in-bits='64' id='9b88c47d'/>
    <!-- void ()* -->
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <!-- void (const char*, int, const char*, typedef __sanitizer::u64, typedef __sanitizer::u64)* -->
    <pointer-type-def type-id='73cabc0d' size-in-bits='64' id='3c440d01'/>
    <!-- void __sanitizer_set_report_path(const char*) -->
    <function-decl name='__sanitizer_set_report_path' mangled-name='__sanitizer_set_report_path' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_set_report_path'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void __sanitizer_sandbox_on_notify(void*) -->
    <function-decl name='__sanitizer_sandbox_on_notify' mangled-name='__sanitizer_sandbox_on_notify' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_sandbox_on_notify'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void __sanitizer_report_error_summary(const char*) -->
    <function-decl name='__sanitizer_report_error_summary' mangled-name='__sanitizer_report_error_summary' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_report_error_summary'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::InternalScopedBuffer<char> -->
      <class-decl name='InternalScopedBuffer&lt;char&gt;' size-in-bits='128' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='67' column='1' id='a137668f'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- char* __sanitizer::InternalScopedBuffer<char>::ptr_ -->
          <var-decl name='ptr_' type-id='26a90f95' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='81' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::InternalScopedBuffer<char>::cnt_ -->
          <var-decl name='cnt_' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='82' column='1'/>
        </data-member>
        <member-function access='public'>
          <!-- void __sanitizer::InternalScopedBuffer<char>::InternalScopedBuffer(__sanitizer::uptr) -->
          <function-decl name='InternalScopedBuffer' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::InternalScopedBuffer<char>*' -->
            <parameter type-id='f39b4c27' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <!-- __sanitizer::InternalScopedBuffer<char>::~InternalScopedBuffer(int) -->
          <function-decl name='~InternalScopedBuffer' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::InternalScopedBuffer<char>*' -->
            <parameter type-id='f39b4c27' is-artificial='yes'/>
            <!-- artificial parameter of type 'int' -->
            <parameter type-id='95e97e5e' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void __sanitizer::InternalScopedBuffer<char>::InternalScopedBuffer(const __sanitizer::InternalScopedBuffer<char>&) -->
          <function-decl name='InternalScopedBuffer' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::InternalScopedBuffer<char>*' -->
            <parameter type-id='f39b4c27' is-artificial='yes'/>
            <!-- parameter of type 'const __sanitizer::InternalScopedBuffer<char>&' -->
            <parameter type-id='b09e3152'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- char* __sanitizer::InternalScopedBuffer<char>::data() -->
          <function-decl name='data' mangled-name='_ZN11__sanitizer20InternalScopedBufferIcE4dataEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::InternalScopedBuffer<char>*' -->
            <parameter type-id='f39b4c27' is-artificial='yes'/>
            <!-- char* -->
            <return type-id='26a90f95'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- __sanitizer::uptr __sanitizer::InternalScopedBuffer<char>::size() -->
          <function-decl name='size' mangled-name='_ZN11__sanitizer20InternalScopedBufferIcE4sizeEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::InternalScopedBuffer<char>*' -->
            <parameter type-id='f39b4c27' is-artificial='yes'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- char& __sanitizer::InternalScopedBuffer<char>::operator[](__sanitizer::uptr) -->
          <function-decl name='operator[]' mangled-name='_ZN11__sanitizer20InternalScopedBufferIcEixEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::InternalScopedBuffer<char>*' -->
            <parameter type-id='f39b4c27' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- char& -->
            <return type-id='2aa915e1'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class __sanitizer::InternalScopedString -->
      <class-decl name='InternalScopedString' size-in-bits='192' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='88' column='1' id='d19834e2'>
        <!-- class __sanitizer::InternalScopedBuffer<char> -->
        <base-class access='public' layout-offset-in-bits='0' type-id='a137668f'/>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::uptr __sanitizer::InternalScopedString::length_ -->
          <var-decl name='length_' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='102' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <!-- __sanitizer::InternalScopedString::InternalScopedString(__sanitizer::uptr) -->
          <function-decl name='InternalScopedString' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::InternalScopedString*' -->
            <parameter type-id='de331450' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::InternalScopedString::append(const char*, ...) -->
          <function-decl name='append' mangled-name='_ZN11__sanitizer20InternalScopedString6appendEPKcz' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::InternalScopedString*' -->
            <parameter type-id='de331450' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='80f4b756'/>
            <parameter is-variadic='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::InternalScopedString::clear() -->
          <function-decl name='clear' mangled-name='_ZN11__sanitizer20InternalScopedString5clearEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::InternalScopedString*' -->
            <parameter type-id='de331450' is-artificial='yes'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- typedef void ()* __sanitizer::DieCallbackType -->
      <typedef-decl name='DieCallbackType' type-id='953b12f8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='202' column='1' id='ad9506aa'/>
      <!-- typedef void (const char*, int, const char*, typedef __sanitizer::u64, typedef __sanitizer::u64)* __sanitizer::CheckFailedCallbackType -->
      <typedef-decl name='CheckFailedCallbackType' type-id='3c440d01' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='205' column='1' id='33cca925'/>
      <!-- class __sanitizer::LoadedModule -->
      <class-decl name='LoadedModule' size-in-bits='960' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='442' column='1' id='3c87abeb'>
        <member-type access='private'>
          <!-- struct __sanitizer::LoadedModule::AddressRange -->
          <class-decl name='AddressRange' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='452' column='1' id='14943646'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- __sanitizer::uptr __sanitizer::LoadedModule::AddressRange::beg -->
              <var-decl name='beg' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='453' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- __sanitizer::uptr __sanitizer::LoadedModule::AddressRange::end -->
              <var-decl name='end' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='454' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- char* __sanitizer::LoadedModule::full_name_ -->
          <var-decl name='full_name_' type-id='26a90f95' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='456' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::LoadedModule::base_address_ -->
          <var-decl name='base_address_' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='457' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <!-- static const __sanitizer::uptr __sanitizer::LoadedModule::kMaxNumberOfAddressRanges -->
          <var-decl name='kMaxNumberOfAddressRanges' type-id='870ffec2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='458' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::LoadedModule::AddressRange __sanitizer::LoadedModule::ranges_[6] -->
          <var-decl name='ranges_' type-id='19d8bc52' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='459' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='896'>
          <!-- __sanitizer::uptr __sanitizer::LoadedModule::n_ranges_ -->
          <var-decl name='n_ranges_' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='460' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <!-- __sanitizer::LoadedModule::LoadedModule(const char*, __sanitizer::uptr) -->
          <function-decl name='LoadedModule' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='444' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LoadedModule*' -->
            <parameter type-id='30b3560b' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='80f4b756'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <!-- __sanitizer::LoadedModule::LoadedModule(const char*, __sanitizer::uptr) -->
          <function-decl name='LoadedModule' mangled-name='_ZN11__sanitizer12LoadedModuleC2EPKcm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='444' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LoadedModule*' -->
            <parameter type-id='30b3560b' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='80f4b756'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <!-- void __sanitizer::LoadedModule::addAddressRange(__sanitizer::uptr, __sanitizer::uptr) -->
          <function-decl name='addAddressRange' mangled-name='_ZN11__sanitizer12LoadedModule15addAddressRangeEmm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='445' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::LoadedModule*' -->
            <parameter type-id='30b3560b' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <!-- bool __sanitizer::LoadedModule::containsAddress(__sanitizer::uptr) -->
          <function-decl name='containsAddress' mangled-name='_ZNK11__sanitizer12LoadedModule15containsAddressEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='446' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::LoadedModule*' -->
            <parameter type-id='1878fe2e' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- bool -->
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <!-- const char* __sanitizer::LoadedModule::full_name() -->
          <function-decl name='full_name' mangled-name='_ZNK11__sanitizer12LoadedModule9full_nameEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='448' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::LoadedModule*' -->
            <parameter type-id='1878fe2e' is-artificial='yes'/>
            <!-- const char* -->
            <return type-id='80f4b756'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <!-- __sanitizer::uptr __sanitizer::LoadedModule::base_address() -->
          <function-decl name='base_address' mangled-name='_ZNK11__sanitizer12LoadedModule12base_addressEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='449' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type 'const __sanitizer::LoadedModule*' -->
            <parameter type-id='1878fe2e' is-artificial='yes'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='c8e929d2'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- typedef int __sanitizer::fd_t -->
      <typedef-decl name='fd_t' type-id='95e97e5e' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='74' column='1' id='32bd5dec'/>
      <!-- struct __sanitizer::StackTrace -->
      <class-decl name='StackTrace' size-in-bits='16512' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='31' column='1' id='44c4da33'>
        <member-type access='public'>
          <!-- typedef bool (void*, char*, int)* __sanitizer::StackTrace::SymbolizeCallback -->
          <typedef-decl name='SymbolizeCallback' type-id='eb904c8b' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='33' column='1' id='c27db549'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- __sanitizer::uptr __sanitizer::StackTrace::top_frame_bp -->
          <var-decl name='top_frame_bp' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::StackTrace::size -->
          <var-decl name='size' type-id='c8e929d2' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- unsigned long int __sanitizer::StackTrace::trace[256] -->
          <var-decl name='trace' type-id='d362a102' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='36' column='1'/>
        </data-member>
        <member-function access='private'>
          <!-- void __sanitizer::StackTrace::SlowUnwindStack(__sanitizer::uptr, __sanitizer::uptr) -->
          <function-decl name='SlowUnwindStack' mangled-name='_ZN11__sanitizer10StackTrace15SlowUnwindStackEmm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
            <!-- implicit parameter of type '__sanitizer::StackTrace*' -->
            <parameter type-id='bc3acb33' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='c8e929d2'/>
            <!-- void -->
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <!-- __sanitizer::uptr __sanitizer::StackTrace::GetPreviousInstructionPc() -->
