<abi-corpus version='2.1' architecture='elf-amd-x86_64' soname='libharfbuzz.so.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libfreetype.so.6'/>
    <dependency name='libpng16.so.16'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libbz2.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- _fini -->
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _init -->
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_create -->
    <elf-symbol name='hb_blob_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_create_sub_blob -->
    <elf-symbol name='hb_blob_create_sub_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_destroy -->
    <elf-symbol name='hb_blob_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_get_data -->
    <elf-symbol name='hb_blob_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_get_data_writable -->

    <elf-symbol name='hb_unicode_funcs_make_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_reference -->
    <elf-symbol name='hb_unicode_funcs_reference' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_combining_class_func -->
    <elf-symbol name='hb_unicode_funcs_set_combining_class_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_compose_func -->
    <elf-symbol name='hb_unicode_funcs_set_compose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_decompose_compatibility_func -->
    <elf-symbol name='hb_unicode_funcs_set_decompose_compatibility_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_decompose_func -->
    <elf-symbol name='hb_unicode_funcs_set_decompose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_eastasian_width_func -->
    <elf-symbol name='hb_unicode_funcs_set_eastasian_width_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_general_category_func -->
    <elf-symbol name='hb_unicode_funcs_set_general_category_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_mirroring_func -->
    <elf-symbol name='hb_unicode_funcs_set_mirroring_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_script_func -->
    <elf-symbol name='hb_unicode_funcs_set_script_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_user_data -->
    <elf-symbol name='hb_unicode_funcs_set_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_general_category -->
    <elf-symbol name='hb_unicode_general_category' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_mirroring -->
    <elf-symbol name='hb_unicode_mirroring' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_script -->
    <elf-symbol name='hb_unicode_script' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_version -->
    <elf-symbol name='hb_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_version_atleast -->
    <elf-symbol name='hb_version_atleast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_version_string -->
    <elf-symbol name='hb_version_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='hb-blob.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- bool -->
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <!-- char[40] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <!-- hb_user_data_item_t[2] -->
    <array-type-def dimensions='1' type-id='6697334d' size-in-bits='384' id='bf5a2b7f'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <!-- typedef int hb_atomic_int_t -->
    <typedef-decl name='hb_atomic_int_t' type-id='95e97e5e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-atomic-private.hh' line='94' column='1' id='9046ccab'/>
    <!-- enum hb_memory_mode_t -->
    <enum-decl name='hb_memory_mode_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='58' column='1' id='3e97254d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_MEMORY_MODE_DUPLICATE' value='0'/>
      <enumerator name='HB_MEMORY_MODE_READONLY' value='1'/>
      <enumerator name='HB_MEMORY_MODE_WRITABLE' value='2'/>
      <enumerator name='HB_MEMORY_MODE_READONLY_MAY_MAKE_WRITABLE' value='3'/>
    </enum-decl>
    <!-- typedef hb_blob_t hb_blob_t -->
    <typedef-decl name='hb_blob_t' type-id='a7cfc628' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='65' column='1' id='a08f20c3'/>
    <!-- typedef int hb_bool_t -->
    <typedef-decl name='hb_bool_t' type-id='95e97e5e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='73' column='1' id='fd106398'/>
    <!-- struct hb_user_data_key_t -->
    <class-decl name='hb_user_data_key_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='334' column='1' id='0ca54af3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char hb_user_data_key_t::unused -->
        <var-decl name='unused' type-id='a84c031d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_user_data_key_t hb_user_data_key_t -->
    <typedef-decl name='hb_user_data_key_t' type-id='0ca54af3' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='337' column='1' id='8f0d6582'/>
    <!-- typedef void (void*)* hb_destroy_func_t -->
    <typedef-decl name='hb_destroy_func_t' type-id='b7f9d8e6' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='339' column='1' id='ed954d2d'/>
    <!-- typedef pthread_mutex_t hb_mutex_impl_t -->
    <typedef-decl name='hb_mutex_impl_t' type-id='70681f9b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='59' column='1' id='1e219f0a'/>
    <!-- struct hb_mutex_t -->
    <class-decl name='hb_mutex_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='117' column='1' id='64a0d528'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_mutex_impl_t hb_mutex_t::m -->
        <var-decl name='m' type-id='1e219f0a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='120' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- void hb_mutex_t::lock() -->
        <function-decl name='lock' mangled-name='_ZN10hb_mutex_t4lockEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_mutex_t*' -->
          <parameter type-id='89f016ee' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_mutex_t::unlock() -->
        <function-decl name='unlock' mangled-name='_ZN10hb_mutex_t6unlockEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_mutex_t*' -->
          <parameter type-id='89f016ee' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_mutex_t::finish() -->
        <function-decl name='finish' mangled-name='_ZN10hb_mutex_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_mutex_t*' -->
          <parameter type-id='89f016ee' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_mutex_t::init() -->
        <function-decl name='init' mangled-name='_ZN10hb_mutex_t4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_mutex_t*' -->
          <parameter type-id='89f016ee' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_reference_count_t -->
    <class-decl name='hb_reference_count_t' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='53' column='1' id='775272c6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_atomic_int_t hb_reference_count_t::ref_count -->
        <var-decl name='ref_count' type-id='9046ccab' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='54' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- bool hb_reference_count_t::is_invalid() -->
        <function-decl name='is_invalid' mangled-name='_ZNK20hb_reference_count_t10is_invalidEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_reference_count_t*' -->
          <parameter type-id='7d1bead3' is-artificial='yes'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- int hb_reference_count_t::inc() -->
        <function-decl name='inc' mangled-name='_ZN20hb_reference_count_t3incEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_reference_count_t*' -->
          <parameter type-id='e82fe34c' is-artificial='yes'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- int hb_reference_count_t::dec() -->
        <function-decl name='dec' mangled-name='_ZN20hb_reference_count_t3decEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_reference_count_t*' -->
          <parameter type-id='e82fe34c' is-artificial='yes'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_reference_count_t::finish() -->
        <function-decl name='finish' mangled-name='_ZN20hb_reference_count_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_reference_count_t*' -->
          <parameter type-id='e82fe34c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_reference_count_t::init(int) -->
        <function-decl name='init' mangled-name='_ZN20hb_reference_count_t4initEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_reference_count_t*' -->
          <parameter type-id='e82fe34c' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_user_data_array_t -->
    <class-decl name='hb_user_data_array_t' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='70' column='1' id='6e658f81'>
      <member-type access='public'>
        <!-- struct hb_user_data_array_t::hb_user_data_item_t -->
        <class-decl name='hb_user_data_item_t' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='71' column='1' id='6697334d'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_user_data_key_t* hb_user_data_array_t::hb_user_data_item_t::key -->
            <var-decl name='key' type-id='49203b03' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='72' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* hb_user_data_array_t::hb_user_data_item_t::data -->
            <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='73' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t hb_user_data_array_t::hb_user_data_item_t::destroy -->
            <var-decl name='destroy' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='74' column='1'/>
          </data-member>
          <member-function access='public'>
            <!-- void hb_user_data_array_t::hb_user_data_item_t::finish() -->
            <function-decl name='finish' mangled-name='_ZN20hb_user_data_array_t19hb_user_data_item_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'hb_user_data_array_t::hb_user_data_item_t*' -->
              <parameter type-id='4e6ceb9d' is-artificial='yes'/>
              <!-- void -->
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- bool hb_user_data_array_t::hb_user_data_item_t::operator==(hb_user_data_key_t*) -->
            <function-decl name='operator==' mangled-name='_ZNK20hb_user_data_array_t19hb_user_data_item_teqEP18hb_user_data_key_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'const hb_user_data_array_t::hb_user_data_item_t*' -->
              <parameter type-id='d75a0968' is-artificial='yes'/>
              <!-- parameter of type 'hb_user_data_key_t*' -->
              <parameter type-id='49203b03'/>
              <!-- bool -->
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- bool hb_user_data_array_t::hb_user_data_item_t::operator==(hb_user_data_array_t::hb_user_data_item_t&) -->
            <function-decl name='operator==' mangled-name='_ZNK20hb_user_data_array_t19hb_user_data_item_teqERS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
              <!-- implicit parameter of type 'const hb_user_data_array_t::hb_user_data_item_t*' -->
              <parameter type-id='d75a0968' is-artificial='yes'/>
              <!-- parameter of type 'hb_user_data_array_t::hb_user_data_item_t&' -->
              <parameter type-id='426cd8b9'/>
              <!-- bool -->
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_mutex_t hb_user_data_array_t::lock -->
        <var-decl name='lock' type-id='64a0d528' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t> hb_user_data_array_t::items -->
        <var-decl name='items' type-id='8806fe52' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='83' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- void hb_user_data_array_t::finish() -->
        <function-decl name='finish' mangled-name='_ZN20hb_user_data_array_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_user_data_array_t*' -->
          <parameter type-id='1020ec09' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_user_data_array_t::init() -->
        <function-decl name='init' mangled-name='_ZN20hb_user_data_array_t4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_user_data_array_t*' -->
          <parameter type-id='1020ec09' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void* hb_user_data_array_t::get(hb_user_data_key_t*) -->
        <function-decl name='get' mangled-name='_ZN20hb_user_data_array_t3getEP18hb_user_data_key_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_user_data_array_t*' -->
          <parameter type-id='1020ec09' is-artificial='yes'/>
          <!-- parameter of type 'hb_user_data_key_t*' -->
          <parameter type-id='49203b03'/>
          <!-- void* -->
          <return type-id='eaa32e2f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_user_data_array_t::set(hb_user_data_key_t*, void*, hb_destroy_func_t, hb_bool_t) -->
        <function-decl name='set' mangled-name='_ZN20hb_user_data_array_t3setEP18hb_user_data_key_tPvPFvS2_Ei' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_user_data_array_t*' -->
          <parameter type-id='1020ec09' is-artificial='yes'/>
          <!-- parameter of type 'hb_user_data_key_t*' -->
          <parameter type-id='49203b03'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='eaa32e2f'/>
          <!-- parameter of type 'typedef hb_destroy_func_t' -->
          <parameter type-id='ed954d2d'/>
          <!-- parameter of type 'typedef hb_bool_t' -->
          <parameter type-id='fd106398'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_object_header_t -->
    <class-decl name='hb_object_header_t' size-in-bits='896' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='101' column='1' id='825dc3de'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_reference_count_t hb_object_header_t::ref_count -->
        <var-decl name='ref_count' type-id='775272c6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_user_data_array_t hb_object_header_t::user_data -->
        <var-decl name='user_data' type-id='6e658f81' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='103' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u> -->
    <class-decl name='hb_prealloced_array_t&lt;hb_user_data_array_t::hb_user_data_item_t, 2u&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='329' column='1' id='f1a94475'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::len -->
        <var-decl name='len' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::allocated -->
        <var-decl name='allocated' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::array -->
        <var-decl name='array' type-id='4e6ceb9d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- hb_user_data_array_t::hb_user_data_item_t hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::static_array[2] -->
        <var-decl name='static_array' type-id='bf5a2b7f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='333' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- void hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::finish() -->
        <function-decl name='finish' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='429' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>*' -->
          <parameter type-id='5f7263a5' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_user_data_array_t::hb_user_data_item_t& hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::operator[](unsigned int) -->
        <function-decl name='operator[]' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EEixEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='337' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>*' -->
          <parameter type-id='5f7263a5' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- hb_user_data_array_t::hb_user_data_item_t& -->
          <return type-id='426cd8b9'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::pop() -->
        <function-decl name='pop' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE3popEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>*' -->
          <parameter type-id='5f7263a5' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::init() -->
        <function-decl name='init' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='335' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>*' -->
          <parameter type-id='5f7263a5' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::find<hb_user_data_key_t*>(hb_user_data_key_t*) -->
        <function-decl name='find&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>*' -->
          <parameter type-id='5f7263a5' is-artificial='yes'/>
          <!-- parameter of type 'hb_user_data_key_t*' -->
          <parameter type-id='49203b03'/>
          <!-- hb_user_data_array_t::hb_user_data_item_t* -->
          <return type-id='4e6ceb9d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::find<hb_user_data_array_t::hb_user_data_item_t>(hb_user_data_array_t::hb_user_data_item_t) -->
        <function-decl name='find&lt;hb_user_data_array_t::hb_user_data_item_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>*' -->
          <parameter type-id='5f7263a5' is-artificial='yes'/>
          <!-- parameter of type 'struct hb_user_data_array_t::hb_user_data_item_t' -->
          <parameter type-id='6697334d'/>
          <!-- hb_user_data_array_t::hb_user_data_item_t* -->
          <return type-id='4e6ceb9d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::push() -->
        <function-decl name='push' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE4pushEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>*' -->
          <parameter type-id='5f7263a5' is-artificial='yes'/>
          <!-- hb_user_data_array_t::hb_user_data_item_t* -->
          <return type-id='4e6ceb9d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t> -->
    <class-decl name='hb_lockable_set_t&lt;hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='449' column='1' id='8806fe52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u> hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::items -->
        <var-decl name='items' type-id='f1a94475' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='450' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- void hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::finish(hb_mutex_t&) -->
        <function-decl name='finish' mangled-name='_ZN17hb_lockable_set_tIN20hb_user_data_array_t19hb_user_data_item_tE10hb_mutex_tE6finishERS2_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='520' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>*' -->
          <parameter type-id='61d87210' is-artificial='yes'/>
          <!-- parameter of type 'hb_mutex_t&' -->
          <parameter type-id='85f010a2'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::init() -->
        <function-decl name='init' mangled-name='_ZN17hb_lockable_set_tIN20hb_user_data_array_t19hb_user_data_item_tE10hb_mutex_tE4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='452' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>*' -->
          <parameter type-id='61d87210' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::find<hb_user_data_key_t*>(hb_user_data_key_t*, hb_user_data_array_t::hb_user_data_item_t*, hb_mutex_t&) -->
        <function-decl name='find&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='496' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>*' -->
          <parameter type-id='61d87210' is-artificial='yes'/>
          <!-- parameter of type 'hb_user_data_key_t*' -->
          <parameter type-id='49203b03'/>
          <!-- parameter of type 'hb_user_data_array_t::hb_user_data_item_t*' -->
          <parameter type-id='4e6ceb9d'/>
          <!-- parameter of type 'hb_mutex_t&' -->
          <parameter type-id='85f010a2'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::remove<hb_user_data_key_t*>(hb_user_data_key_t*, hb_mutex_t&) -->
        <function-decl name='remove&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='480' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>*' -->
          <parameter type-id='61d87210' is-artificial='yes'/>
          <!-- parameter of type 'hb_user_data_key_t*' -->
          <parameter type-id='49203b03'/>
          <!-- parameter of type 'hb_mutex_t&' -->
          <parameter type-id='85f010a2'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::replace_or_insert<hb_user_data_array_t::hb_user_data_item_t>(hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t&, bool) -->
        <function-decl name='replace_or_insert&lt;hb_user_data_array_t::hb_user_data_item_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='455' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>*' -->
          <parameter type-id='61d87210' is-artificial='yes'/>
          <!-- parameter of type 'struct hb_user_data_array_t::hb_user_data_item_t' -->
          <parameter type-id='6697334d'/>
          <!-- parameter of type 'hb_mutex_t&' -->
          <parameter type-id='85f010a2'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='c894953d'/>
          <!-- hb_user_data_array_t::hb_user_data_item_t* -->
          <return type-id='4e6ceb9d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct __pthread_internal_list -->
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='62' column='1' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __pthread_internal_list* __pthread_internal_list::__prev -->
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __pthread_internal_list* __pthread_internal_list::__next -->
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __pthread_internal_list __pthread_list_t -->
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' filepath='/usr/include/bits/pthreadtypes.h' line='65' column='1' id='518fb49c'/>
    <!-- union pthread_mutex_t -->
    <union-decl name='pthread_mutex_t' size-in-bits='320' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1' id='70681f9b'>
      <member-type access='public'>
        <!-- struct pthread_mutex_t::__pthread_mutex_s -->
        <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1' id='6688f464'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__lock -->
            <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <!-- unsigned int pthread_mutex_t::__pthread_mutex_s::__count -->
            <var-decl name='__count' type-id='f0981eeb' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='81' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__owner -->
            <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='82' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <!-- unsigned int pthread_mutex_t::__pthread_mutex_s::__nusers -->
            <var-decl name='__nusers' type-id='f0981eeb' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='84' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__kind -->
            <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='88' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__spins -->
            <var-decl name='__spins' type-id='95e97e5e' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='90' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- __pthread_list_t pthread_mutex_t::__pthread_mutex_s::__list -->
            <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='91' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <!-- pthread_mutex_t::__pthread_mutex_s pthread_mutex_t::__data -->
        <var-decl name='__data' type-id='6688f464' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='101' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- char pthread_mutex_t::__size[40] -->
        <var-decl name='__size' type-id='36c46961' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='102' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- long int pthread_mutex_t::__align -->
        <var-decl name='__align' type-id='bd54fe1a' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='103' column='1'/>
      </data-member>
    </union-decl>
    <!-- __pthread_internal_list* -->
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <!-- char* -->
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <!-- const char -->
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <!-- const char* -->
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <!-- const hb_blob_t -->
    <qualified-type-def type-id='a7cfc628' const='yes' id='23880b93'/>
    <!-- const hb_blob_t* -->
    <pointer-type-def type-id='23880b93' size-in-bits='64' id='a82a743b'/>
    <!-- const hb_object_header_t -->
    <qualified-type-def type-id='825dc3de' const='yes' id='47530e67'/>
    <!-- const hb_object_header_t* -->
    <pointer-type-def type-id='47530e67' size-in-bits='64' id='94bf8337'/>
    <!-- const hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u> -->
    <qualified-type-def type-id='f1a94475' const='yes' id='161590f0'/>
    <!-- const hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>* -->
    <pointer-type-def type-id='161590f0' size-in-bits='64' id='9df3072e'/>
    <!-- const hb_reference_count_t -->
    <qualified-type-def type-id='775272c6' const='yes' id='f1db39eb'/>
    <!-- const hb_reference_count_t* -->
    <pointer-type-def type-id='f1db39eb' size-in-bits='64' id='7d1bead3'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t -->
    <qualified-type-def type-id='6697334d' const='yes' id='916351d2'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t& -->
    <reference-type-def kind='lvalue' type-id='916351d2' size-in-bits='64' id='d35a031c'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t* -->
    <pointer-type-def type-id='916351d2' size-in-bits='64' id='d75a0968'/>
    <!-- hb_blob_t* -->
    <pointer-type-def type-id='a08f20c3' size-in-bits='64' id='9d7b4d1e'/>
    <!-- hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>* -->
    <pointer-type-def type-id='8806fe52' size-in-bits='64' id='61d87210'/>
    <!-- hb_mutex_t& -->
    <reference-type-def kind='lvalue' type-id='64a0d528' size-in-bits='64' id='85f010a2'/>
    <!-- hb_mutex_t* -->
    <pointer-type-def type-id='64a0d528' size-in-bits='64' id='89f016ee'/>
    <!-- hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>* -->
    <pointer-type-def type-id='f1a94475' size-in-bits='64' id='5f7263a5'/>
    <!-- hb_reference_count_t* -->
    <pointer-type-def type-id='775272c6' size-in-bits='64' id='e82fe34c'/>
    <!-- hb_user_data_array_t* -->
    <pointer-type-def type-id='6e658f81' size-in-bits='64' id='1020ec09'/>
    <!-- hb_user_data_array_t::hb_user_data_item_t& -->
    <reference-type-def kind='lvalue' type-id='6697334d' size-in-bits='64' id='426cd8b9'/>
    <!-- hb_user_data_array_t::hb_user_data_item_t* -->
    <pointer-type-def type-id='6697334d' size-in-bits='64' id='4e6ceb9d'/>
    <!-- hb_user_data_key_t* -->
    <pointer-type-def type-id='8f0d6582' size-in-bits='64' id='49203b03'/>
    <!-- unsigned int* -->
    <pointer-type-def type-id='f0981eeb' size-in-bits='64' id='807869d3'/>
    <!-- void (void*)* -->
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <!-- void* -->
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <!-- struct hb_blob_t -->
    <class-decl name='hb_blob_t' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='53' column='1' is-declaration-only='yes' id='a7cfc628'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_blob_t::header -->
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- bool hb_blob_t::immutable -->
        <var-decl name='immutable' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- const char* hb_blob_t::data -->
        <var-decl name='data' type-id='80f4b756' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- unsigned int hb_blob_t::length -->
        <var-decl name='length' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <!-- hb_memory_mode_t hb_blob_t::mode -->
        <var-decl name='mode' type-id='3e97254d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- void* hb_blob_t::user_data -->
        <var-decl name='user_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- hb_destroy_func_t hb_blob_t::destroy -->
        <var-decl name='destroy' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='64' column='1'/>
      </data-member>
    </class-decl>
    <!-- hb_blob_t* hb_blob_create(const char*, unsigned int, hb_memory_mode_t, void*, hb_destroy_func_t) -->
    <function-decl name='hb_blob_create' mangled-name='hb_blob_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='98' column='1'/>
      <!-- parameter of type 'enum hb_memory_mode_t' -->
      <parameter type-id='3e97254d' name='mode' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='99' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='100' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='ed954d2d' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='101' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <!-- hb_blob_t* hb_blob_create_sub_blob(hb_blob_t*, unsigned int, unsigned int) -->
    <function-decl name='hb_blob_create_sub_blob' mangled-name='hb_blob_create_sub_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create_sub_blob'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='parent' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='151' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='152' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <!-- hb_blob_t* hb_blob_get_empty() -->
    <function-decl name='hb_blob_get_empty' mangled-name='hb_blob_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_empty'>
      <!-- hb_blob_t* -->
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <!-- hb_blob_t* hb_blob_reference(hb_blob_t*) -->
    <function-decl name='hb_blob_reference' mangled-name='hb_blob_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_reference'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <!-- void hb_blob_destroy(hb_blob_t*) -->
    <function-decl name='hb_blob_destroy' mangled-name='hb_blob_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_destroy'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_bool_t hb_blob_set_user_data(hb_blob_t*, hb_user_data_key_t*, void*, hb_destroy_func_t, hb_bool_t) -->
    <function-decl name='hb_blob_set_user_data' mangled-name='hb_blob_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_set_user_data'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='254' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='255' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='ed954d2d' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='256' column='1'/>
      <!-- parameter of type 'typedef hb_bool_t' -->
      <parameter type-id='fd106398' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='257' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-decl>
    <!-- void* hb_blob_get_user_data(hb_blob_t*, hb_user_data_key_t*) -->
    <function-decl name='hb_blob_get_user_data' mangled-name='hb_blob_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_user_data'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='275' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void hb_blob_make_immutable(hb_blob_t*) -->
    <function-decl name='hb_blob_make_immutable' mangled-name='hb_blob_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_make_immutable'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_bool_t hb_blob_is_immutable(hb_blob_t*) -->
    <function-decl name='hb_blob_is_immutable' mangled-name='hb_blob_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_is_immutable'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-decl>
    <!-- unsigned int hb_blob_get_length(hb_blob_t*) -->
    <function-decl name='hb_blob_get_length' mangled-name='hb_blob_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_length'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1'/>
      <!-- unsigned int -->
      <return type-id='f0981eeb'/>
    </function-decl>
    <!-- const char* hb_blob_get_data(hb_blob_t*, unsigned int*) -->
    <function-decl name='hb_blob_get_data' mangled-name='hb_blob_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='807869d3' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- char* hb_blob_get_data_writable(hb_blob_t*, unsigned int*) -->
    <function-decl name='hb_blob_get_data_writable' mangled-name='hb_blob_get_data_writable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data_writable'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='807869d3' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <!-- char* -->
      <return type-id='26a90f95'/>
    </function-decl>
    <!-- void (void*) -->
    <function-type size-in-bits='64' id='c5c76c9c'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void -->
    <type-decl name='void' id='48b5725f'/>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer-serialize.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- const char*[8] -->
    <array-type-def dimensions='1' type-id='80f4b756' size-in-bits='512' id='31fa0500'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <!-- hb_codepoint_t[2][5] -->
    <array-type-def dimensions='2' type-id='a959aecb' size-in-bits='320' id='59ba990d'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
      <!-- <anonymous range>[5] -->
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <!-- int16_t[2] -->
    <array-type-def dimensions='1' type-id='23bd8cb5' size-in-bits='32' id='eaa227ea'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- int8_t[4] -->
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='32' id='e09548f1'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <!-- signed char -->
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <!-- uint16_t[2] -->
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='32' id='8141bf33'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- uint8_t[4] -->
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <!-- uint8_t[8] -->
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <!-- unsigned char -->
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <!-- unsigned int[2] -->
    <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='64' id='0d532ec1'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- unsigned short int -->
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <!-- struct hb_buffer_t -->
    <class-decl name='hb_buffer_t' size-in-bits='2752' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='46' column='1' id='57c520e9'>
      <member-type access='public'>
        <!-- typedef long int hb_buffer_t::scratch_buffer_t -->
        <typedef-decl name='scratch_buffer_t' type-id='bd54fe1a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='190' column='1' id='9b0d70c8'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_buffer_t::header -->
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_unicode_funcs_t* hb_buffer_t::unicode -->
        <var-decl name='unicode' type-id='db70339e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_buffer_flags_t hb_buffer_t::flags -->
        <var-decl name='flags' type-id='77054a06' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <!-- hb_codepoint_t hb_buffer_t::replacement -->
        <var-decl name='replacement' type-id='a959aecb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_buffer_content_type_t hb_buffer_t::content_type -->
        <var-decl name='content_type' type-id='e8b55c7f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- hb_segment_properties_t hb_buffer_t::props -->
        <var-decl name='props' type-id='c03d4c5f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- bool hb_buffer_t::in_error -->
        <var-decl name='in_error' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1352'>
        <!-- bool hb_buffer_t::have_output -->
        <var-decl name='have_output' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <!-- bool hb_buffer_t::have_positions -->
        <var-decl name='have_positions' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <!-- unsigned int hb_buffer_t::idx -->
        <var-decl name='idx' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- unsigned int hb_buffer_t::len -->
        <var-decl name='len' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <!-- unsigned int hb_buffer_t::out_len -->
        <var-decl name='out_len' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- unsigned int hb_buffer_t::allocated -->
        <var-decl name='allocated' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- hb_glyph_info_t* hb_buffer_t::info -->
        <var-decl name='info' type-id='4cf9317a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <!-- hb_glyph_info_t* hb_buffer_t::out_info -->
        <var-decl name='out_info' type-id='4cf9317a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <!-- hb_glyph_position_t* hb_buffer_t::pos -->
        <var-decl name='pos' type-id='9493c6e3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <!-- unsigned int hb_buffer_t::serial -->
        <var-decl name='serial' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <!-- uint8_t hb_buffer_t::allocated_var_bytes[8] -->
        <var-decl name='allocated_var_bytes' type-id='13339fda' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <!-- const char* hb_buffer_t::allocated_var_owner[8] -->
        <var-decl name='allocated_var_owner' type-id='31fa0500' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='87' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static const unsigned int hb_buffer_t::CONTEXT_LENGTH -->
        <var-decl name='CONTEXT_LENGTH' type-id='20f5f452' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <!-- hb_codepoint_t hb_buffer_t::context[2][5] -->
        <var-decl name='context' type-id='59ba990d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <!-- unsigned int hb_buffer_t::context_len[2] -->
        <var-decl name='context_len' type-id='0d532ec1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='94' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- void hb_buffer_t::clear_context(unsigned int) -->
        <function-decl name='clear_context' mangled-name='_ZN11hb_buffer_t13clear_contextEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::set_masks(hb_mask_t, hb_mask_t, unsigned int, unsigned int) -->
        <function-decl name='set_masks' mangled-name='_ZN11hb_buffer_t9set_masksEjjjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_mask_t' -->
          <parameter type-id='b7def578'/>
          <!-- parameter of type 'typedef hb_mask_t' -->
          <parameter type-id='b7def578'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::reverse_range(unsigned int, unsigned int) -->
        <function-decl name='reverse_range' mangled-name='_ZN11hb_buffer_t13reverse_rangeEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::allocate_var(unsigned int, unsigned int, const char*) -->
        <function-decl name='allocate_var' mangled-name='_ZN11hb_buffer_t12allocate_varEjjPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_buffer_t::scratch_buffer_t* hb_buffer_t::get_scratch_buffer(unsigned int*) -->
        <function-decl name='get_scratch_buffer' mangled-name='_ZN11hb_buffer_t18get_scratch_bufferEPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int*' -->
          <parameter type-id='807869d3'/>
          <!-- hb_buffer_t::scratch_buffer_t* -->
          <return type-id='62fafbaf'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::merge_out_clusters(unsigned int, unsigned int) -->
        <function-decl name='merge_out_clusters' mangled-name='_ZN11hb_buffer_t18merge_out_clustersEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::merge_clusters(unsigned int, unsigned int) -->
        <function-decl name='merge_clusters' mangled-name='_ZN11hb_buffer_t14merge_clustersEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::reverse() -->
        <function-decl name='reverse' mangled-name='_ZN11hb_buffer_t7reverseEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::reverse_clusters() -->
        <function-decl name='reverse_clusters' mangled-name='_ZN11hb_buffer_t16reverse_clustersEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::swap_buffers() -->
        <function-decl name='swap_buffers' mangled-name='_ZN11hb_buffer_t12swap_buffersEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::clear_output() -->
        <function-decl name='clear_output' mangled-name='_ZN11hb_buffer_t12clear_outputEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::remove_output() -->
        <function-decl name='remove_output' mangled-name='_ZN11hb_buffer_t13remove_outputEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::deallocate_var_all() -->
        <function-decl name='deallocate_var_all' mangled-name='_ZN11hb_buffer_t18deallocate_var_allEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::clear_positions() -->
        <function-decl name='clear_positions' mangled-name='_ZN11hb_buffer_t15clear_positionsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::clear() -->
        <function-decl name='clear' mangled-name='_ZN11hb_buffer_t5clearEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::reset() -->
        <function-decl name='reset' mangled-name='_ZN11hb_buffer_t5resetEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::assert_var(unsigned int, unsigned int, const char*) -->
        <function-decl name='assert_var' mangled-name='_ZN11hb_buffer_t10assert_varEjjPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::deallocate_var(unsigned int, unsigned int, const char*) -->
        <function-decl name='deallocate_var' mangled-name='_ZN11hb_buffer_t14deallocate_varEjjPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::guess_segment_properties() -->
        <function-decl name='guess_segment_properties' mangled-name='_ZN11hb_buffer_t24guess_segment_propertiesEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_buffer_t::enlarge(unsigned int) -->
        <function-decl name='enlarge' mangled-name='_ZN11hb_buffer_t7enlargeEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_buffer_t::ensure(unsigned int) -->
        <function-decl name='ensure' mangled-name='_ZN11hb_buffer_t6ensureEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_buffer_t::make_room_for(unsigned int, unsigned int) -->
        <function-decl name='make_room_for' mangled-name='_ZN11hb_buffer_t13make_room_forEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::replace_glyph(hb_codepoint_t) -->
        <function-decl name='replace_glyph' mangled-name='_ZN11hb_buffer_t13replace_glyphEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::copy_glyph() -->
        <function-decl name='copy_glyph' mangled-name='_ZN11hb_buffer_t10copy_glyphEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::output_info(const hb_glyph_info_t&) -->
        <function-decl name='output_info' mangled-name='_ZN11hb_buffer_t11output_infoERK15hb_glyph_info_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'const hb_glyph_info_t&' -->
          <parameter type-id='74d37223'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::output_glyph(hb_codepoint_t) -->
        <function-decl name='output_glyph' mangled-name='_ZN11hb_buffer_t12output_glyphEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::replace_glyphs(unsigned int, unsigned int, const hb_codepoint_t*) -->
        <function-decl name='replace_glyphs' mangled-name='_ZN11hb_buffer_t14replace_glyphsEjjPKj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'const hb_codepoint_t*' -->
          <parameter type-id='1d980383'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::add_info(const hb_glyph_info_t&) -->
        <function-decl name='add_info' mangled-name='_ZN11hb_buffer_t8add_infoERK15hb_glyph_info_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'const hb_glyph_info_t&' -->
          <parameter type-id='74d37223'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::add(hb_codepoint_t, unsigned int) -->
        <function-decl name='add' mangled-name='_ZN11hb_buffer_t3addEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_buffer_t::shift_forward(unsigned int) -->
        <function-decl name='shift_forward' mangled-name='_ZN11hb_buffer_t13shift_forwardEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_buffer_t::move_to(unsigned int) -->
        <function-decl name='move_to' mangled-name='_ZN11hb_buffer_t7move_toEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_glyph_info_t& hb_buffer_t::cur(unsigned int) -->
        <function-decl name='cur' mangled-name='_ZN11hb_buffer_t3curEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- hb_glyph_info_t& -->
          <return type-id='40f91e96'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- unsigned int hb_buffer_t::next_serial() -->
        <function-decl name='next_serial' mangled-name='_ZN11hb_buffer_t11next_serialEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::skip_glyph() -->
        <function-decl name='skip_glyph' mangled-name='_ZN11hb_buffer_t10skip_glyphEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- unsigned int hb_buffer_t::backtrack_len() -->
        <function-decl name='backtrack_len' mangled-name='_ZNK11hb_buffer_t13backtrack_lenEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_buffer_t*' -->
          <parameter type-id='643a95bc' is-artificial='yes'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- unsigned int hb_buffer_t::lookahead_len() -->
        <function-decl name='lookahead_len' mangled-name='_ZNK11hb_buffer_t13lookahead_lenEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_buffer_t*' -->
          <parameter type-id='643a95bc' is-artificial='yes'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_glyph_position_t& hb_buffer_t::cur_pos(unsigned int) -->
        <function-decl name='cur_pos' mangled-name='_ZN11hb_buffer_t7cur_posEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- hb_glyph_position_t& -->
          <return type-id='a093d9c7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_buffer_t::has_separate_output() -->
        <function-decl name='has_separate_output' mangled-name='_ZNK11hb_buffer_t19has_separate_outputEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_buffer_t*' -->
          <parameter type-id='643a95bc' is-artificial='yes'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::next_glyph() -->
        <function-decl name='next_glyph' mangled-name='_ZN11hb_buffer_t10next_glyphEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_glyph_info_t& hb_buffer_t::prev() -->
        <function-decl name='prev' mangled-name='_ZN11hb_buffer_t4prevEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- hb_glyph_info_t& -->
          <return type-id='40f91e96'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_buffer_t::reset_masks(hb_mask_t) -->
        <function-decl name='reset_masks' mangled-name='_ZN11hb_buffer_t11reset_masksEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_buffer_t*' -->
          <parameter type-id='191f8691' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_mask_t' -->
          <parameter type-id='b7def578'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_glyph_info_t -->
    <class-decl name='hb_glyph_info_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='44' column='1' id='1c727cac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_codepoint_t hb_glyph_info_t::codepoint -->
        <var-decl name='codepoint' type-id='a959aecb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_mask_t hb_glyph_info_t::mask -->
        <var-decl name='mask' type-id='b7def578' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t hb_glyph_info_t::cluster -->
        <var-decl name='cluster' type-id='8f92235e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- hb_var_int_t hb_glyph_info_t::var1 -->
        <var-decl name='var1' type-id='a7df0b99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- hb_var_int_t hb_glyph_info_t::var2 -->
        <var-decl name='var2' type-id='a7df0b99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_glyph_info_t hb_glyph_info_t -->
    <typedef-decl name='hb_glyph_info_t' type-id='1c727cac' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='52' column='1' id='60021ca7'/>
    <!-- struct hb_glyph_position_t -->
    <class-decl name='hb_glyph_position_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='54' column='1' id='a9943313'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_position_t hb_glyph_position_t::x_advance -->
        <var-decl name='x_advance' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_position_t hb_glyph_position_t::y_advance -->
        <var-decl name='y_advance' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_position_t hb_glyph_position_t::x_offset -->
        <var-decl name='x_offset' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- hb_position_t hb_glyph_position_t::y_offset -->
        <var-decl name='y_offset' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- hb_var_int_t hb_glyph_position_t::var -->
        <var-decl name='var' type-id='a7df0b99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_glyph_position_t hb_glyph_position_t -->
    <typedef-decl name='hb_glyph_position_t' type-id='a9943313' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='62' column='1' id='ab180530'/>
    <!-- struct hb_segment_properties_t -->
    <class-decl name='hb_segment_properties_t' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='65' column='1' id='7f15157c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_direction_t hb_segment_properties_t::direction -->
        <var-decl name='direction' type-id='17bc5dc7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_script_t hb_segment_properties_t::script -->
        <var-decl name='script' type-id='e02a2c4f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_language_t hb_segment_properties_t::language -->
        <var-decl name='language' type-id='4817e45a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* hb_segment_properties_t::reserved1 -->
        <var-decl name='reserved1' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* hb_segment_properties_t::reserved2 -->
        <var-decl name='reserved2' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_segment_properties_t hb_segment_properties_t -->
    <typedef-decl name='hb_segment_properties_t' type-id='7f15157c' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='72' column='1' id='c03d4c5f'/>
    <!-- typedef hb_buffer_t hb_buffer_t -->
    <typedef-decl name='hb_buffer_t' type-id='57c520e9' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='93' column='1' id='1ad0166e'/>
    <!-- enum hb_buffer_content_type_t -->
    <enum-decl name='hb_buffer_content_type_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='119' column='1' id='e8b55c7f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_INVALID' value='0'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_UNICODE' value='1'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_GLYPHS' value='2'/>
    </enum-decl>
    <!-- enum hb_buffer_flags_t -->
    <enum-decl name='hb_buffer_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='174' column='1' id='77054a06'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_BUFFER_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_FLAG_BOT' value='1'/>
      <enumerator name='HB_BUFFER_FLAG_EOT' value='2'/>
      <enumerator name='HB_BUFFER_FLAG_PRESERVE_DEFAULT_IGNORABLES' value='4'/>
    </enum-decl>
    <!-- enum hb_buffer_serialize_flags_t -->
    <enum-decl name='hb_buffer_serialize_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='298' column='1' id='9562cc1f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_CLUSTERS' value='1'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_POSITIONS' value='2'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_GLYPH_NAMES' value='4'/>
    </enum-decl>
    <!-- enum hb_buffer_serialize_format_t -->
    <enum-decl name='hb_buffer_serialize_format_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='305' column='1' id='a23c3b31'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_TEXT' value='1413830740'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_JSON' value='1246973774'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_INVALID' value='0'/>
    </enum-decl>
    <!-- typedef uint32_t hb_codepoint_t -->
    <typedef-decl name='hb_codepoint_t' type-id='8f92235e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='75' column='1' id='a959aecb'/>
    <!-- typedef int32_t hb_position_t -->
    <typedef-decl name='hb_position_t' type-id='3ff5601b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='76' column='1' id='fab7f087'/>
    <!-- typedef uint32_t hb_mask_t -->
    <typedef-decl name='hb_mask_t' type-id='8f92235e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='77' column='1' id='b7def578'/>
    <!-- union _hb_var_int_t -->
    <union-decl name='_hb_var_int_t' size-in-bits='32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='79' column='1' id='c574bffc'>
      <data-member access='public'>
        <!-- uint32_t _hb_var_int_t::u32 -->
        <var-decl name='u32' type-id='8f92235e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- int32_t _hb_var_int_t::i32 -->
        <var-decl name='i32' type-id='3ff5601b' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='81' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- uint16_t _hb_var_int_t::u16[2] -->
        <var-decl name='u16' type-id='8141bf33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='82' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- int16_t _hb_var_int_t::i16[2] -->
        <var-decl name='i16' type-id='eaa227ea' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- uint8_t _hb_var_int_t::u8[4] -->
        <var-decl name='u8' type-id='d351502e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='84' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- int8_t _hb_var_int_t::i8[4] -->
        <var-decl name='i8' type-id='e09548f1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <!-- typedef _hb_var_int_t hb_var_int_t -->
    <typedef-decl name='hb_var_int_t' type-id='c574bffc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='86' column='1' id='a7df0b99'/>
    <!-- enum hb_direction_t -->
    <enum-decl name='hb_direction_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='111' column='1' id='17bc5dc7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_DIRECTION_INVALID' value='0'/>
      <enumerator name='HB_DIRECTION_LTR' value='4'/>
      <enumerator name='HB_DIRECTION_RTL' value='5'/>
      <enumerator name='HB_DIRECTION_TTB' value='6'/>
      <enumerator name='HB_DIRECTION_BTT' value='7'/>
    </enum-decl>
    <!-- typedef const hb_language_impl_t* hb_language_t -->
    <typedef-decl name='hb_language_t' type-id='e4dcb57b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='137' column='1' id='4817e45a'/>
    <!-- enum hb_script_t -->
    <enum-decl name='hb_script_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='157' column='1' id='e02a2c4f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_SCRIPT_COMMON' value='1517910393'/>
      <enumerator name='HB_SCRIPT_INHERITED' value='1516858984'/>
      <enumerator name='HB_SCRIPT_UNKNOWN' value='1517976186'/>
      <enumerator name='HB_SCRIPT_ARABIC' value='1098015074'/>
      <enumerator name='HB_SCRIPT_ARMENIAN' value='1098018158'/>
      <enumerator name='HB_SCRIPT_BENGALI' value='1113943655'/>
      <enumerator name='HB_SCRIPT_CYRILLIC' value='1132032620'/>
      <enumerator name='HB_SCRIPT_DEVANAGARI' value='1147500129'/>
      <enumerator name='HB_SCRIPT_GEORGIAN' value='1197830002'/>
      <enumerator name='HB_SCRIPT_GREEK' value='1198679403'/>
      <enumerator name='HB_SCRIPT_GUJARATI' value='1198877298'/>
      <enumerator name='HB_SCRIPT_GURMUKHI' value='1198879349'/>
      <enumerator name='HB_SCRIPT_HANGUL' value='1214344807'/>
      <enumerator name='HB_SCRIPT_HAN' value='1214344809'/>
      <enumerator name='HB_SCRIPT_HEBREW' value='1214603890'/>
      <enumerator name='HB_SCRIPT_HIRAGANA' value='1214870113'/>
      <enumerator name='HB_SCRIPT_KANNADA' value='1265525857'/>
      <enumerator name='HB_SCRIPT_KATAKANA' value='1264676449'/>
      <enumerator name='HB_SCRIPT_LAO' value='1281453935'/>
      <enumerator name='HB_SCRIPT_LATIN' value='1281455214'/>
      <enumerator name='HB_SCRIPT_MALAYALAM' value='1298954605'/>
      <enumerator name='HB_SCRIPT_ORIYA' value='1332902241'/>
      <enumerator name='HB_SCRIPT_TAMIL' value='1415671148'/>
      <enumerator name='HB_SCRIPT_TELUGU' value='1415933045'/>
      <enumerator name='HB_SCRIPT_THAI' value='1416126825'/>
      <enumerator name='HB_SCRIPT_TIBETAN' value='1416192628'/>
      <enumerator name='HB_SCRIPT_BOPOMOFO' value='1114599535'/>
      <enumerator name='HB_SCRIPT_BRAILLE' value='1114792297'/>
      <enumerator name='HB_SCRIPT_CANADIAN_SYLLABICS' value='1130458739'/>
      <enumerator name='HB_SCRIPT_CHEROKEE' value='1130915186'/>
      <enumerator name='HB_SCRIPT_ETHIOPIC' value='1165256809'/>
      <enumerator name='HB_SCRIPT_KHMER' value='1265134962'/>
      <enumerator name='HB_SCRIPT_MONGOLIAN' value='1299148391'/>
      <enumerator name='HB_SCRIPT_MYANMAR' value='1299803506'/>
      <enumerator name='HB_SCRIPT_OGHAM' value='1332175213'/>
      <enumerator name='HB_SCRIPT_RUNIC' value='1383427698'/>
      <enumerator name='HB_SCRIPT_SINHALA' value='1399418472'/>
      <enumerator name='HB_SCRIPT_SYRIAC' value='1400468067'/>
      <enumerator name='HB_SCRIPT_THAANA' value='1416126817'/>
      <enumerator name='HB_SCRIPT_YI' value='1500080489'/>
      <enumerator name='HB_SCRIPT_DESERET' value='1148416628'/>
      <enumerator name='HB_SCRIPT_GOTHIC' value='1198486632'/>
      <enumerator name='HB_SCRIPT_OLD_ITALIC' value='1232363884'/>
      <enumerator name='HB_SCRIPT_BUHID' value='1114990692'/>
      <enumerator name='HB_SCRIPT_HANUNOO' value='1214344815'/>
      <enumerator name='HB_SCRIPT_TAGALOG' value='1416064103'/>
      <enumerator name='HB_SCRIPT_TAGBANWA' value='1415669602'/>
      <enumerator name='HB_SCRIPT_CYPRIOT' value='1131442804'/>
      <enumerator name='HB_SCRIPT_LIMBU' value='1281977698'/>
      <enumerator name='HB_SCRIPT_LINEAR_B' value='1281977954'/>
      <enumerator name='HB_SCRIPT_OSMANYA' value='1332964705'/>
      <enumerator name='HB_SCRIPT_SHAVIAN' value='1399349623'/>
      <enumerator name='HB_SCRIPT_TAI_LE' value='1415670885'/>
      <enumerator name='HB_SCRIPT_UGARITIC' value='1432838514'/>
      <enumerator name='HB_SCRIPT_BUGINESE' value='1114990441'/>
      <enumerator name='HB_SCRIPT_COPTIC' value='1131376756'/>
      <enumerator name='HB_SCRIPT_GLAGOLITIC' value='1198285159'/>
      <enumerator name='HB_SCRIPT_KHAROSHTHI' value='1265131890'/>
      <enumerator name='HB_SCRIPT_NEW_TAI_LUE' value='1415670901'/>
      <enumerator name='HB_SCRIPT_OLD_PERSIAN' value='1483761007'/>
      <enumerator name='HB_SCRIPT_SYLOTI_NAGRI' value='1400466543'/>
      <enumerator name='HB_SCRIPT_TIFINAGH' value='1415999079'/>
      <enumerator name='HB_SCRIPT_BALINESE' value='1113681001'/>
      <enumerator name='HB_SCRIPT_CUNEIFORM' value='1483961720'/>
      <enumerator name='HB_SCRIPT_NKO' value='1315663727'/>
      <enumerator name='HB_SCRIPT_PHAGS_PA' value='1349017959'/>
      <enumerator name='HB_SCRIPT_PHOENICIAN' value='1349021304'/>
      <enumerator name='HB_SCRIPT_CARIAN' value='1130459753'/>
      <enumerator name='HB_SCRIPT_CHAM' value='1130914157'/>
      <enumerator name='HB_SCRIPT_KAYAH_LI' value='1264675945'/>
      <enumerator name='HB_SCRIPT_LEPCHA' value='1281716323'/>
      <enumerator name='HB_SCRIPT_LYCIAN' value='1283023721'/>
      <enumerator name='HB_SCRIPT_LYDIAN' value='1283023977'/>
      <enumerator name='HB_SCRIPT_OL_CHIKI' value='1332503403'/>
      <enumerator name='HB_SCRIPT_REJANG' value='1382706791'/>
      <enumerator name='HB_SCRIPT_SAURASHTRA' value='1398895986'/>
      <enumerator name='HB_SCRIPT_SUNDANESE' value='1400204900'/>
      <enumerator name='HB_SCRIPT_VAI' value='1449224553'/>
      <enumerator name='HB_SCRIPT_AVESTAN' value='1098281844'/>
      <enumerator name='HB_SCRIPT_BAMUM' value='1113681269'/>
      <enumerator name='HB_SCRIPT_EGYPTIAN_HIEROGLYPHS' value='1164409200'/>
      <enumerator name='HB_SCRIPT_IMPERIAL_ARAMAIC' value='1098018153'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PAHLAVI' value='1349020777'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PARTHIAN' value='1349678185'/>
      <enumerator name='HB_SCRIPT_JAVANESE' value='1247901281'/>
      <enumerator name='HB_SCRIPT_KAITHI' value='1265920105'/>
      <enumerator name='HB_SCRIPT_LISU' value='1281979253'/>
      <enumerator name='HB_SCRIPT_MEETEI_MAYEK' value='1299473769'/>
      <enumerator name='HB_SCRIPT_OLD_SOUTH_ARABIAN' value='1398895202'/>
      <enumerator name='HB_SCRIPT_OLD_TURKIC' value='1332898664'/>
      <enumerator name='HB_SCRIPT_SAMARITAN' value='1398893938'/>
      <enumerator name='HB_SCRIPT_TAI_THAM' value='1281453665'/>
      <enumerator name='HB_SCRIPT_TAI_VIET' value='1415673460'/>
      <enumerator name='HB_SCRIPT_BATAK' value='1113683051'/>
      <enumerator name='HB_SCRIPT_BRAHMI' value='1114792296'/>
      <enumerator name='HB_SCRIPT_MANDAIC' value='1298230884'/>
      <enumerator name='HB_SCRIPT_CHAKMA' value='1130457965'/>
      <enumerator name='HB_SCRIPT_MEROITIC_CURSIVE' value='1298494051'/>
      <enumerator name='HB_SCRIPT_MEROITIC_HIEROGLYPHS' value='1298494063'/>
      <enumerator name='HB_SCRIPT_MIAO' value='1349284452'/>
      <enumerator name='HB_SCRIPT_SHARADA' value='1399353956'/>
      <enumerator name='HB_SCRIPT_SORA_SOMPENG' value='1399812705'/>
      <enumerator name='HB_SCRIPT_TAKRI' value='1415670642'/>
      <enumerator name='HB_SCRIPT_BASSA_VAH' value='1113682803'/>
      <enumerator name='HB_SCRIPT_CAUCASIAN_ALBANIAN' value='1097295970'/>
      <enumerator name='HB_SCRIPT_DUPLOYAN' value='1148547180'/>
      <enumerator name='HB_SCRIPT_ELBASAN' value='1164730977'/>
      <enumerator name='HB_SCRIPT_GRANTHA' value='1198678382'/>
      <enumerator name='HB_SCRIPT_KHOJKI' value='1265135466'/>
      <enumerator name='HB_SCRIPT_KHUDAWADI' value='1399418468'/>
      <enumerator name='HB_SCRIPT_LINEAR_A' value='1281977953'/>
      <enumerator name='HB_SCRIPT_MAHAJANI' value='1298229354'/>
      <enumerator name='HB_SCRIPT_MANICHAEAN' value='1298230889'/>
      <enumerator name='HB_SCRIPT_MENDE_KIKAKUI' value='1298493028'/>
      <enumerator name='HB_SCRIPT_MODI' value='1299145833'/>
      <enumerator name='HB_SCRIPT_MRO' value='1299345263'/>
      <enumerator name='HB_SCRIPT_NABATAEAN' value='1315070324'/>
      <enumerator name='HB_SCRIPT_OLD_NORTH_ARABIAN' value='1315009122'/>
      <enumerator name='HB_SCRIPT_OLD_PERMIC' value='1348825709'/>
      <enumerator name='HB_SCRIPT_PAHAWH_HMONG' value='1215131239'/>
      <enumerator name='HB_SCRIPT_PALMYRENE' value='1348562029'/>
      <enumerator name='HB_SCRIPT_PAU_CIN_HAU' value='1348564323'/>
      <enumerator name='HB_SCRIPT_PSALTER_PAHLAVI' value='1349020784'/>
      <enumerator name='HB_SCRIPT_SIDDHAM' value='1399415908'/>
      <enumerator name='HB_SCRIPT_TIRHUTA' value='1416196712'/>
      <enumerator name='HB_SCRIPT_WARANG_CITI' value='1466004065'/>
      <enumerator name='HB_SCRIPT_INVALID' value='0'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE' value='4294967295'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE_SIGNED' value='2147483647'/>
    </enum-decl>
    <!-- struct hb_font_t -->
    <class-decl name='hb_font_t' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='91' column='1' id='4847a5be'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_font_t::header -->
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_font_t::immutable -->
        <var-decl name='immutable' type-id='fd106398' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_font_t* hb_font_t::parent -->
        <var-decl name='parent' type-id='022d8174' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_face_t* hb_font_t::face -->
        <var-decl name='face' type-id='d4e35730' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- int hb_font_t::x_scale -->
        <var-decl name='x_scale' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <!-- int hb_font_t::y_scale -->
        <var-decl name='y_scale' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- unsigned int hb_font_t::x_ppem -->
        <var-decl name='x_ppem' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <!-- unsigned int hb_font_t::y_ppem -->
        <var-decl name='y_ppem' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- hb_font_funcs_t* hb_font_t::klass -->
        <var-decl name='klass' type-id='af4ab3c8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- void* hb_font_t::user_data -->
        <var-decl name='user_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- hb_destroy_func_t hb_font_t::destroy -->
        <var-decl name='destroy' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_shaper_data_t hb_font_t::shaper_data -->
        <var-decl name='shaper_data' type-id='330059bd' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='110' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::get_glyph_h_advance(hb_codepoint_t) -->
        <function-decl name='get_glyph_h_advance' mangled-name='_ZN9hb_font_t19get_glyph_h_advanceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::get_glyph_v_advance(hb_codepoint_t) -->
        <function-decl name='get_glyph_v_advance' mangled-name='_ZN9hb_font_t19get_glyph_v_advanceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::get_glyph_h_origin(hb_codepoint_t, hb_position_t*, hb_position_t*) -->
        <function-decl name='get_glyph_h_origin' mangled-name='_ZN9hb_font_t18get_glyph_h_originEjPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::get_glyph_v_origin(hb_codepoint_t, hb_position_t*, hb_position_t*) -->
        <function-decl name='get_glyph_v_origin' mangled-name='_ZN9hb_font_t18get_glyph_v_originEjPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_font_t::guess_v_origin_minus_h_origin(hb_codepoint_t, hb_position_t*, hb_position_t*) -->
        <function-decl name='guess_v_origin_minus_h_origin' mangled-name='_ZN9hb_font_t29guess_v_origin_minus_h_originEjPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='266' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_font_t::get_glyph_origin_for_direction(hb_codepoint_t, hb_direction_t, hb_position_t*, hb_position_t*) -->
        <function-decl name='get_glyph_origin_for_direction' mangled-name='_ZN9hb_font_t30get_glyph_origin_for_directionEj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='275' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'enum hb_direction_t' -->
          <parameter type-id='17bc5dc7'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::get_glyph(hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*) -->
        <function-decl name='get_glyph' mangled-name='_ZN9hb_font_t9get_glyphEjjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_font_t::get_glyph_advance_for_direction(hb_codepoint_t, hb_direction_t, hb_position_t*, hb_position_t*) -->
        <function-decl name='get_glyph_advance_for_direction' mangled-name='_ZN9hb_font_t31get_glyph_advance_for_directionEj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'enum hb_direction_t' -->
          <parameter type-id='17bc5dc7'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_font_t::subtract_glyph_origin_for_direction(hb_codepoint_t, hb_direction_t, hb_position_t*, hb_position_t*) -->
        <function-decl name='subtract_glyph_origin_for_direction' mangled-name='_ZN9hb_font_t35subtract_glyph_origin_for_directionEj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'enum hb_direction_t' -->
          <parameter type-id='17bc5dc7'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::get_glyph_name(hb_codepoint_t, char*, unsigned int) -->
        <function-decl name='get_glyph_name' mangled-name='_ZN9hb_font_t14get_glyph_nameEjPcj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::get_glyph_h_kerning(hb_codepoint_t, hb_codepoint_t) -->
        <function-decl name='get_glyph_h_kerning' mangled-name='_ZN9hb_font_t19get_glyph_h_kerningEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::get_glyph_v_kerning(hb_codepoint_t, hb_codepoint_t) -->
        <function-decl name='get_glyph_v_kerning' mangled-name='_ZN9hb_font_t19get_glyph_v_kerningEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::get_glyph_contour_point(hb_codepoint_t, unsigned int, hb_position_t*, hb_position_t*) -->
        <function-decl name='get_glyph_contour_point' mangled-name='_ZN9hb_font_t23get_glyph_contour_pointEjjPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::parent_scale_x_position(hb_position_t) -->
        <function-decl name='parent_scale_x_position' mangled-name='_ZN9hb_font_t23parent_scale_x_positionEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_position_t' -->
          <parameter type-id='fab7f087'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::parent_scale_y_position(hb_position_t) -->
        <function-decl name='parent_scale_y_position' mangled-name='_ZN9hb_font_t23parent_scale_y_positionEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_position_t' -->
          <parameter type-id='fab7f087'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::get_glyph_contour_point_for_origin(hb_codepoint_t, unsigned int, hb_direction_t, hb_position_t*, hb_position_t*) -->
        <function-decl name='get_glyph_contour_point_for_origin' mangled-name='_ZN9hb_font_t34get_glyph_contour_point_for_originEjj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- parameter of type 'enum hb_direction_t' -->
          <parameter type-id='17bc5dc7'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_font_t::add_glyph_origin_for_direction(hb_codepoint_t, hb_direction_t, hb_position_t*, hb_position_t*) -->
        <function-decl name='add_glyph_origin_for_direction' mangled-name='_ZN9hb_font_t30add_glyph_origin_for_directionEj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'enum hb_direction_t' -->
          <parameter type-id='17bc5dc7'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_font_t::get_glyph_kerning_for_direction(hb_codepoint_t, hb_codepoint_t, hb_direction_t, hb_position_t*, hb_position_t*) -->
        <function-decl name='get_glyph_kerning_for_direction' mangled-name='_ZN9hb_font_t31get_glyph_kerning_for_directionEjj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='325' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'enum hb_direction_t' -->
          <parameter type-id='17bc5dc7'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_font_t::parent_scale_distance(hb_position_t*, hb_position_t*) -->
        <function-decl name='parent_scale_distance' mangled-name='_ZN9hb_font_t21parent_scale_distanceEPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::get_glyph_extents_for_origin(hb_codepoint_t, hb_direction_t, hb_glyph_extents_t*) -->
        <function-decl name='get_glyph_extents_for_origin' mangled-name='_ZN9hb_font_t28get_glyph_extents_for_originEj14hb_direction_tP18hb_glyph_extents_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'enum hb_direction_t' -->
          <parameter type-id='17bc5dc7'/>
          <!-- parameter of type 'hb_glyph_extents_t*' -->
          <parameter type-id='760d24cb'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::glyph_from_string(const char*, int, hb_codepoint_t*) -->
        <function-decl name='glyph_from_string' mangled-name='_ZN9hb_font_t17glyph_from_stringEPKciPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_font_t::glyph_to_string(hb_codepoint_t, char*, unsigned int) -->
        <function-decl name='glyph_to_string' mangled-name='_ZN9hb_font_t15glyph_to_stringEjPcj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='364' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::get_glyph_from_name(const char*, int, hb_codepoint_t*) -->
        <function-decl name='get_glyph_from_name' mangled-name='_ZN9hb_font_t19get_glyph_from_nameEPKciPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void hb_font_t::parent_scale_position(hb_position_t*, hb_position_t*) -->
        <function-decl name='parent_scale_position' mangled-name='_ZN9hb_font_t21parent_scale_positionEPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- parameter of type 'hb_position_t*' -->
          <parameter type-id='be24ff0e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::parent_scale_x_distance(hb_position_t) -->
        <function-decl name='parent_scale_x_distance' mangled-name='_ZN9hb_font_t23parent_scale_x_distanceEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_position_t' -->
          <parameter type-id='fab7f087'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::parent_scale_y_distance(hb_position_t) -->
        <function-decl name='parent_scale_y_distance' mangled-name='_ZN9hb_font_t23parent_scale_y_distanceEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_position_t' -->
          <parameter type-id='fab7f087'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::get_glyph_extents(hb_codepoint_t, hb_glyph_extents_t*) -->
        <function-decl name='get_glyph_extents' mangled-name='_ZN9hb_font_t17get_glyph_extentsEjP18hb_glyph_extents_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='208' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'hb_glyph_extents_t*' -->
          <parameter type-id='760d24cb'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- hb_position_t hb_font_t::em_scale(int16_t, int) -->
        <function-decl name='em_scale' mangled-name='_ZN9hb_font_t8em_scaleEsi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='405' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef int16_t' -->
          <parameter type-id='23bd8cb5'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::em_scale_y(int16_t) -->
        <function-decl name='em_scale_y' mangled-name='_ZN9hb_font_t10em_scale_yEs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef int16_t' -->
          <parameter type-id='23bd8cb5'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_position_t hb_font_t::em_scale_x(int16_t) -->
        <function-decl name='em_scale_x' mangled-name='_ZN9hb_font_t10em_scale_xEs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef int16_t' -->
          <parameter type-id='23bd8cb5'/>
          <!-- typedef hb_position_t -->
          <return type-id='fab7f087'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_font_t::has_glyph(hb_codepoint_t) -->
        <function-decl name='has_glyph' mangled-name='_ZN9hb_font_t9has_glyphEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_font_t*' -->
          <parameter type-id='022d8174' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- typedef hb_font_t hb_font_t -->
    <typedef-decl name='hb_font_t' type-id='4847a5be' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='40' column='1' id='f5655a8d'/>
    <!-- struct hb_unicode_funcs_t -->
    <class-decl name='hb_unicode_funcs_t' size-in-bits='2560' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='64' column='1' id='6d435e08'>
      <member-type access='public'>
        <!-- struct {hb_unicode_combining_class_func_t combining_class; hb_unicode_eastasian_width_func_t eastasian_width; hb_unicode_general_category_func_t general_category; hb_unicode_mirroring_func_t mirroring; hb_unicode_script_func_t script; hb_unicode_compose_func_t compose; hb_unicode_decompose_func_t decompose; hb_unicode_decompose_compatibility_func_t decompose_compatibility;} -->
        <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='203' column='1' id='e7f43f72'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_unicode_combining_class_func_t combining_class -->
            <var-decl name='combining_class' type-id='6e33b528' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_unicode_eastasian_width_func_t eastasian_width -->
            <var-decl name='eastasian_width' type-id='e5cbe98b' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_unicode_general_category_func_t general_category -->
            <var-decl name='general_category' type-id='83b452b2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_unicode_mirroring_func_t mirroring -->
            <var-decl name='mirroring' type-id='06dd29d8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_unicode_script_func_t script -->
            <var-decl name='script' type-id='e680c8cc' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_unicode_compose_func_t compose -->
            <var-decl name='compose' type-id='0b2f1b2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_unicode_decompose_func_t decompose -->
            <var-decl name='decompose' type-id='6712eb84' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_unicode_decompose_compatibility_func_t decompose_compatibility -->
            <var-decl name='decompose_compatibility' type-id='ae8112a1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {void* combining_class; void* eastasian_width; void* general_category; void* mirroring; void* script; void* compose; void* decompose; void* decompose_compatibility;} -->
        <class-decl name='__anonymous_struct__1' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='209' column='1' id='e7f43f73'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- void* combining_class -->
            <var-decl name='combining_class' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* eastasian_width -->
            <var-decl name='eastasian_width' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- void* general_category -->
            <var-decl name='general_category' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- void* mirroring -->
            <var-decl name='mirroring' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- void* script -->
            <var-decl name='script' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- void* compose -->
            <var-decl name='compose' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- void* decompose -->
            <var-decl name='decompose' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- void* decompose_compatibility -->
            <var-decl name='decompose_compatibility' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {hb_destroy_func_t combining_class; hb_destroy_func_t eastasian_width; hb_destroy_func_t general_category; hb_destroy_func_t mirroring; hb_destroy_func_t script; hb_destroy_func_t compose; hb_destroy_func_t decompose; hb_destroy_func_t decompose_compatibility;} -->
        <class-decl name='__anonymous_struct__2' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='215' column='1' id='e7f43f74'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_destroy_func_t combining_class -->
            <var-decl name='combining_class' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_destroy_func_t eastasian_width -->
            <var-decl name='eastasian_width' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t general_category -->
            <var-decl name='general_category' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_destroy_func_t mirroring -->
            <var-decl name='mirroring' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_destroy_func_t script -->
            <var-decl name='script' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_destroy_func_t compose -->
            <var-decl name='compose' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_destroy_func_t decompose -->
            <var-decl name='decompose' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_destroy_func_t decompose_compatibility -->
            <var-decl name='decompose_compatibility' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_unicode_funcs_t::header -->
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_unicode_funcs_t* hb_unicode_funcs_t::parent -->
        <var-decl name='parent' type-id='db70339e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- bool hb_unicode_funcs_t::immutable -->
        <var-decl name='immutable' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- struct {hb_unicode_combining_class_func_t combining_class; hb_unicode_eastasian_width_func_t eastasian_width; hb_unicode_general_category_func_t general_category; hb_unicode_mirroring_func_t mirroring; hb_unicode_script_func_t script; hb_unicode_compose_func_t compose; hb_unicode_decompose_func_t decompose; hb_unicode_decompose_compatibility_func_t decompose_compatibility;} hb_unicode_funcs_t::func -->
        <var-decl name='func' type-id='e7f43f72' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- struct {void* combining_class; void* eastasian_width; void* general_category; void* mirroring; void* script; void* compose; void* decompose; void* decompose_compatibility;} hb_unicode_funcs_t::user_data -->
        <var-decl name='user_data' type-id='e7f43f73' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- struct {hb_destroy_func_t combining_class; hb_destroy_func_t eastasian_width; hb_destroy_func_t general_category; hb_destroy_func_t mirroring; hb_destroy_func_t script; hb_destroy_func_t compose; hb_destroy_func_t decompose; hb_destroy_func_t decompose_compatibility;} hb_unicode_funcs_t::destroy -->
        <var-decl name='destroy' type-id='e7f43f74' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='219' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- hb_script_t hb_unicode_funcs_t::script(hb_codepoint_t) -->
        <function-decl name='script' mangled-name='_ZN18hb_unicode_funcs_t6scriptEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_unicode_funcs_t*' -->
          <parameter type-id='db70339e' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- enum hb_script_t -->
          <return type-id='e02a2c4f'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <!-- hb_bool_t hb_unicode_funcs_t::is_default_ignorable() -->
        <function-decl name='is_default_ignorable' mangled-name='_ZN18hb_unicode_funcs_t20is_default_ignorableEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_unicode_general_category_t hb_unicode_funcs_t::general_category(hb_codepoint_t) -->
        <function-decl name='general_category' mangled-name='_ZN18hb_unicode_funcs_t16general_categoryEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_unicode_funcs_t*' -->
          <parameter type-id='db70339e' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- enum hb_unicode_general_category_t -->
          <return type-id='076e7829'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_unicode_funcs_t::compose(hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*) -->
        <function-decl name='compose' mangled-name='_ZN18hb_unicode_funcs_t7composeEjjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_unicode_funcs_t*' -->
          <parameter type-id='db70339e' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_bool_t hb_unicode_funcs_t::decompose(hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*) -->
        <function-decl name='decompose' mangled-name='_ZN18hb_unicode_funcs_t9decomposeEjPjS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_unicode_funcs_t*' -->
          <parameter type-id='db70339e' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_unicode_combining_class_t hb_unicode_funcs_t::combining_class(hb_codepoint_t) -->
        <function-decl name='combining_class' mangled-name='_ZN18hb_unicode_funcs_t15combining_classEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_unicode_funcs_t*' -->
          <parameter type-id='db70339e' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- enum hb_unicode_combining_class_t -->
          <return type-id='e6a1ecc3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- unsigned int hb_unicode_funcs_t::modified_combining_class(hb_codepoint_t) -->
        <function-decl name='modified_combining_class' mangled-name='_ZN18hb_unicode_funcs_t24modified_combining_classEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_unicode_funcs_t*' -->
          <parameter type-id='db70339e' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- unsigned int hb_unicode_funcs_t::decompose_compatibility(hb_codepoint_t, hb_codepoint_t*) -->
        <function-decl name='decompose_compatibility' mangled-name='_ZN18hb_unicode_funcs_t23decompose_compatibilityEjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_unicode_funcs_t*' -->
          <parameter type-id='db70339e' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <!-- hb_bool_t hb_unicode_funcs_t::is_variation_selector() -->
        <function-decl name='is_variation_selector' mangled-name='_ZN18hb_unicode_funcs_t21is_variation_selectorEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- typedef hb_bool_t -->
          <return type-id='fd106398'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_codepoint_t hb_unicode_funcs_t::mirroring(hb_codepoint_t) -->
        <function-decl name='mirroring' mangled-name='_ZN18hb_unicode_funcs_t9mirroringEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_unicode_funcs_t*' -->
          <parameter type-id='db70339e' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- typedef hb_codepoint_t -->
          <return type-id='a959aecb'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- unsigned int hb_unicode_funcs_t::eastasian_width(hb_codepoint_t) -->
        <function-decl name='eastasian_width' mangled-name='_ZN18hb_unicode_funcs_t15eastasian_widthEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_unicode_funcs_t*' -->
          <parameter type-id='db70339e' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- enum hb_unicode_general_category_t -->
    <enum-decl name='hb_unicode_general_category_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='46' column='1' id='076e7829'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONTROL' value='0'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FORMAT' value='1'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UNASSIGNED' value='2'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PRIVATE_USE' value='3'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SURROGATE' value='4'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LOWERCASE_LETTER' value='5'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_LETTER' value='6'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_LETTER' value='7'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_TITLECASE_LETTER' value='8'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UPPERCASE_LETTER' value='9'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACING_MARK' value='10'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_ENCLOSING_MARK' value='11'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_NON_SPACING_MARK' value='12'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DECIMAL_NUMBER' value='13'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LETTER_NUMBER' value='14'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_NUMBER' value='15'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONNECT_PUNCTUATION' value='16'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DASH_PUNCTUATION' value='17'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CLOSE_PUNCTUATION' value='18'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FINAL_PUNCTUATION' value='19'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_INITIAL_PUNCTUATION' value='20'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_PUNCTUATION' value='21'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OPEN_PUNCTUATION' value='22'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CURRENCY_SYMBOL' value='23'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_SYMBOL' value='24'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MATH_SYMBOL' value='25'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_SYMBOL' value='26'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LINE_SEPARATOR' value='27'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PARAGRAPH_SEPARATOR' value='28'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACE_SEPARATOR' value='29'/>
    </enum-decl>
    <!-- enum hb_unicode_combining_class_t -->
    <enum-decl name='hb_unicode_combining_class_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='87' column='1' id='e6a1ecc3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NOT_REORDERED' value='0'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_OVERLAY' value='1'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NUKTA' value='7'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_KANA_VOICING' value='8'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_VIRAMA' value='9'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC10' value='10'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC11' value='11'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC12' value='12'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC13' value='13'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC14' value='14'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC15' value='15'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC16' value='16'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC17' value='17'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC18' value='18'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC19' value='19'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC20' value='20'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC21' value='21'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC22' value='22'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC23' value='23'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC24' value='24'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC25' value='25'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC26' value='26'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC27' value='27'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC28' value='28'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC29' value='29'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC30' value='30'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC31' value='31'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC32' value='32'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC33' value='33'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC34' value='34'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC35' value='35'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC36' value='36'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC84' value='84'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC91' value='91'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC103' value='103'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC107' value='107'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC118' value='118'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC122' value='122'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC129' value='129'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC130' value='130'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC133' value='132'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW_LEFT' value='200'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW' value='202'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE' value='214'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE_RIGHT' value='216'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_LEFT' value='218'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW' value='220'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_RIGHT' value='222'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_LEFT' value='224'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_RIGHT' value='226'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_LEFT' value='228'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE' value='230'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_RIGHT' value='232'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_BELOW' value='233'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_ABOVE' value='234'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_IOTA_SUBSCRIPT' value='240'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_INVALID' value='255'/>
    </enum-decl>
    <!-- typedef hb_unicode_funcs_t hb_unicode_funcs_t -->
    <typedef-decl name='hb_unicode_funcs_t' type-id='6d435e08' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='171' column='1' id='07a8a669'/>
    <!-- typedef enum hb_unicode_combining_class_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_combining_class_func_t -->
    <typedef-decl name='hb_unicode_combining_class_func_t' type-id='8b0f8e39' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='224' column='1' id='6e33b528'/>
    <!-- typedef unsigned int (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_eastasian_width_func_t -->
    <typedef-decl name='hb_unicode_eastasian_width_func_t' type-id='ee16bed1' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='227' column='1' id='e5cbe98b'/>
    <!-- typedef enum hb_unicode_general_category_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_general_category_func_t -->
    <typedef-decl name='hb_unicode_general_category_func_t' type-id='576d41bf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='230' column='1' id='83b452b2'/>
    <!-- typedef typedef hb_codepoint_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_mirroring_func_t -->
    <typedef-decl name='hb_unicode_mirroring_func_t' type-id='cfa3aa71' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='233' column='1' id='06dd29d8'/>
    <!-- typedef enum hb_script_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* hb_unicode_script_func_t -->
    <typedef-decl name='hb_unicode_script_func_t' type-id='0fa4443d' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='236' column='1' id='e680c8cc'/>
    <!-- typedef typedef hb_bool_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, typedef hb_codepoint_t, hb_codepoint_t*, void*)* hb_unicode_compose_func_t -->
    <typedef-decl name='hb_unicode_compose_func_t' type-id='f184e0c7' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='242' column='1' id='0b2f1b2f'/>
    <!-- typedef typedef hb_bool_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*, void*)* hb_unicode_decompose_func_t -->
    <typedef-decl name='hb_unicode_decompose_func_t' type-id='d543f608' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='247' column='1' id='6712eb84'/>
    <!-- typedef unsigned int (hb_unicode_funcs_t*, typedef hb_codepoint_t, hb_codepoint_t*, void*)* hb_unicode_decompose_compatibility_func_t -->
    <typedef-decl name='hb_unicode_decompose_compatibility_func_t' type-id='518e9f3c' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='270' column='1' id='ae8112a1'/>
    <!-- typedef signed char int8_t -->
    <typedef-decl name='int8_t' type-id='28577a57' filepath='/usr/include/stdint.h' line='37' column='1' id='ee31ee44'/>
    <!-- typedef short int int16_t -->
    <typedef-decl name='int16_t' type-id='a2185560' filepath='/usr/include/stdint.h' line='38' column='1' id='23bd8cb5'/>
    <!-- typedef int int32_t -->
    <typedef-decl name='int32_t' type-id='95e97e5e' filepath='/usr/include/stdint.h' line='39' column='1' id='3ff5601b'/>
    <!-- typedef unsigned char uint8_t -->
    <typedef-decl name='uint8_t' type-id='002ac4a6' filepath='/usr/include/stdint.h' line='49' column='1' id='b96825af'/>
    <!-- typedef unsigned short int uint16_t -->
    <typedef-decl name='uint16_t' type-id='8efea9e5' filepath='/usr/include/stdint.h' line='50' column='1' id='149c6638'/>
    <!-- typedef unsigned int uint32_t -->
    <typedef-decl name='uint32_t' type-id='f0981eeb' filepath='/usr/include/stdint.h' line='52' column='1' id='8f92235e'/>
    <!-- const char** -->
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <!-- const hb_buffer_t -->
    <qualified-type-def type-id='57c520e9' const='yes' id='69ce98fe'/>
    <!-- const hb_buffer_t* -->
    <pointer-type-def type-id='69ce98fe' size-in-bits='64' id='643a95bc'/>
    <!-- const hb_codepoint_t -->
    <qualified-type-def type-id='a959aecb' const='yes' id='8eccec7b'/>
    <!-- const hb_codepoint_t* -->
    <pointer-type-def type-id='8eccec7b' size-in-bits='64' id='1d980383'/>
    <!-- const hb_glyph_info_t -->
    <qualified-type-def type-id='60021ca7' const='yes' id='b2ab6717'/>
    <!-- const hb_glyph_info_t& -->
    <reference-type-def kind='lvalue' type-id='b2ab6717' size-in-bits='64' id='74d37223'/>
    <!-- const hb_language_impl_t -->
    <qualified-type-def type-id='73275f42' const='yes' id='3fca8d53'/>
    <!-- const hb_language_impl_t* -->
    <pointer-type-def type-id='3fca8d53' size-in-bits='64' id='e4dcb57b'/>
    <!-- const hb_unicode_funcs_t -->
    <qualified-type-def type-id='6d435e08' const='yes' id='feee6819'/>
    <!-- const hb_unicode_funcs_t* -->
    <pointer-type-def type-id='feee6819' size-in-bits='64' id='844e0849'/>
    <!-- const unsigned int -->
    <qualified-type-def type-id='f0981eeb' const='yes' id='20f5f452'/>
    <!-- enum hb_script_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='de6e89d9' size-in-bits='64' id='0fa4443d'/>
    <!-- enum hb_unicode_combining_class_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='24736795' size-in-bits='64' id='8b0f8e39'/>
    <!-- enum hb_unicode_general_category_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='c7897c8b' size-in-bits='64' id='576d41bf'/>
    <!-- hb_buffer_t* -->
    <pointer-type-def type-id='57c520e9' size-in-bits='64' id='191f8691'/>
    <!-- hb_buffer_t::scratch_buffer_t* -->
    <pointer-type-def type-id='9b0d70c8' size-in-bits='64' id='62fafbaf'/>
    <!-- hb_codepoint_t* -->
    <pointer-type-def type-id='a959aecb' size-in-bits='64' id='2f53c570'/>
    <!-- hb_font_t* -->
    <pointer-type-def type-id='f5655a8d' size-in-bits='64' id='022d8174'/>
    <!-- hb_glyph_info_t& -->
    <reference-type-def kind='lvalue' type-id='60021ca7' size-in-bits='64' id='40f91e96'/>
    <!-- hb_glyph_info_t* -->
    <pointer-type-def type-id='60021ca7' size-in-bits='64' id='4cf9317a'/>
    <!-- hb_glyph_position_t& -->
    <reference-type-def kind='lvalue' type-id='ab180530' size-in-bits='64' id='a093d9c7'/>
    <!-- hb_glyph_position_t* -->
    <pointer-type-def type-id='ab180530' size-in-bits='64' id='9493c6e3'/>
    <!-- hb_unicode_funcs_t* -->
    <pointer-type-def type-id='07a8a669' size-in-bits='64' id='db70339e'/>
    <!-- typedef hb_bool_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='f15a2796' size-in-bits='64' id='d543f608'/>
    <!-- typedef hb_bool_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, typedef hb_codepoint_t, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='634c497b' size-in-bits='64' id='f184e0c7'/>
    <!-- typedef hb_codepoint_t (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='7e5d35b5' size-in-bits='64' id='cfa3aa71'/>
    <!-- unsigned int (hb_unicode_funcs_t*, typedef hb_codepoint_t, hb_codepoint_t*, void*)* -->
    <pointer-type-def type-id='f57cd2ba' size-in-bits='64' id='518e9f3c'/>
    <!-- unsigned int (hb_unicode_funcs_t*, typedef hb_codepoint_t, void*)* -->
    <pointer-type-def type-id='10778475' size-in-bits='64' id='ee16bed1'/>
    <!-- const char** hb_buffer_serialize_list_formats() -->
    <function-decl name='hb_buffer_serialize_list_formats' mangled-name='hb_buffer_serialize_list_formats' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_list_formats'>
      <!-- const char** -->
      <return type-id='7d3cd834'/>
    </function-decl>
    <!-- hb_buffer_serialize_format_t hb_buffer_serialize_format_from_string(const char*, int) -->
    <function-decl name='hb_buffer_serialize_format_from_string' mangled-name='hb_buffer_serialize_format_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <!-- enum hb_buffer_serialize_format_t -->
      <return type-id='a23c3b31'/>
    </function-decl>
    <!-- const char* hb_buffer_serialize_format_to_string(hb_buffer_serialize_format_t) -->
    <function-decl name='hb_buffer_serialize_format_to_string' mangled-name='hb_buffer_serialize_format_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_to_string'>
      <!-- parameter of type 'enum hb_buffer_serialize_format_t' -->
      <parameter type-id='a23c3b31' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- unsigned int hb_buffer_serialize_glyphs(hb_buffer_t*, unsigned int, unsigned int, char*, unsigned int, unsigned int*, hb_font_t*, hb_buffer_serialize_format_t, hb_buffer_serialize_flags_t) -->
    <function-decl name='hb_buffer_serialize_glyphs' mangled-name='hb_buffer_serialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_glyphs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='247' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='end' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='248' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='26a90f95' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='249' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='buf_size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='250' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='807869d3' name='buf_consumed' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='251' column='1'/>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='022d8174' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='252' column='1'/>
      <!-- parameter of type 'enum hb_buffer_serialize_format_t' -->
      <parameter type-id='a23c3b31' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='253' column='1'/>
      <!-- parameter of type 'enum hb_buffer_serialize_flags_t' -->
      <parameter type-id='9562cc1f' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='254' column='1'/>
      <!-- unsigned int -->
      <return type-id='f0981eeb'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_deserialize_glyphs(hb_buffer_t*, const char*, int, const char**, hb_font_t*, hb_buffer_serialize_format_t) -->
    <function-decl name='hb_buffer_deserialize_glyphs' mangled-name='hb_buffer_deserialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_deserialize_glyphs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='354' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='buf_len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='355' column='1'/>
      <!-- parameter of type 'const char**' -->
      <parameter type-id='7d3cd834' name='end_ptr' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='356' column='1'/>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='022d8174' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='357' column='1'/>
      <!-- parameter of type 'enum hb_buffer_serialize_format_t' -->
      <parameter type-id='a23c3b31' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='358' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-decl>
    <!-- struct hb_language_impl_t -->
    <class-decl name='hb_language_impl_t' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='167' column='1' is-declaration-only='yes' id='73275f42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char hb_language_impl_t::s[1] -->
        <var-decl name='s' type-id='048e5bff' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='168' column='1'/>
      </data-member>
    </class-decl>
    <!-- hb_script_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='de6e89d9'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='db70339e'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- enum hb_script_t -->
      <return type-id='e02a2c4f'/>
    </function-type>
    <!-- hb_unicode_combining_class_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='24736795'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='db70339e'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- enum hb_unicode_combining_class_t -->
      <return type-id='e6a1ecc3'/>
    </function-type>
    <!-- hb_unicode_general_category_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='c7897c8b'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='db70339e'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- enum hb_unicode_general_category_t -->
      <return type-id='076e7829'/>
    </function-type>
    <!-- hb_bool_t (hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' id='f15a2796'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='db70339e'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='2f53c570'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='2f53c570'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-type>
    <!-- hb_bool_t (hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' id='634c497b'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='db70339e'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='2f53c570'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-type>
    <!-- hb_codepoint_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='7e5d35b5'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='db70339e'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- typedef hb_codepoint_t -->
      <return type-id='a959aecb'/>
    </function-type>
    <!-- unsigned int (hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' id='f57cd2ba'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='db70339e'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='2f53c570'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- unsigned int -->
      <return type-id='f0981eeb'/>
    </function-type>
    <!-- unsigned int (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' id='10778475'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='db70339e'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- unsigned int -->
      <return type-id='f0981eeb'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- struct hb_utf_t<unsigned int, true> -->
    <class-decl name='hb_utf_t&lt;unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='32' column='1' id='1631866e'>
      <member-function access='public' static='yes'>
        <!-- const uint32_t* hb_utf_t<unsigned int, true>::next(const uint32_t*, hb_codepoint_t*, unsigned int) -->
        <function-decl name='next' mangled-name='_ZN8hb_utf_tIjLb1EE4nextEPKjS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const uint32_t*' -->
          <parameter type-id='a6798dcc'/>
          <!-- parameter of type 'const uint32_t*' -->
          <parameter type-id='a6798dcc'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- const uint32_t* -->
          <return type-id='a6798dcc'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <!-- unsigned int hb_utf_t<unsigned int, true>::strlen() -->
        <function-decl name='strlen' mangled-name='_ZN8hb_utf_tIjLb1EE6strlenEPKj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const uint32_t*' -->
          <parameter type-id='a6798dcc'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <!-- const uint32_t* hb_utf_t<unsigned int, true>::prev(const uint32_t*, hb_codepoint_t*, unsigned int) -->
        <function-decl name='prev' mangled-name='_ZN8hb_utf_tIjLb1EE4prevEPKjS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const uint32_t*' -->
          <parameter type-id='a6798dcc'/>
          <!-- parameter of type 'const uint32_t*' -->
          <parameter type-id='a6798dcc'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- const uint32_t* -->
          <return type-id='a6798dcc'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_utf_t<unsigned char, true> -->
    <class-decl name='hb_utf_t&lt;unsigned char, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='39' column='1' id='675ac8eb'>
      <member-function access='public' static='yes'>
        <!-- unsigned int hb_utf_t<unsigned char, true>::strlen() -->
        <function-decl name='strlen' mangled-name='_ZN8hb_utf_tIhLb1EE6strlenEPKh' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const uint8_t*' -->
          <parameter type-id='9f7200cf'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <!-- const uint8_t* hb_utf_t<unsigned char, true>::prev(const uint8_t*, hb_codepoint_t*, hb_codepoint_t) -->
        <function-decl name='prev' mangled-name='_ZN8hb_utf_tIhLb1EE4prevEPKhS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const uint8_t*' -->
          <parameter type-id='9f7200cf'/>
          <!-- parameter of type 'const uint8_t*' -->
          <parameter type-id='9f7200cf'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- const uint8_t* -->
          <return type-id='9f7200cf'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <!-- const uint8_t* hb_utf_t<unsigned char, true>::next(const uint8_t*, hb_codepoint_t*, hb_codepoint_t) -->
        <function-decl name='next' mangled-name='_ZN8hb_utf_tIhLb1EE4nextEPKhS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const uint8_t*' -->
          <parameter type-id='9f7200cf'/>
          <!-- parameter of type 'const uint8_t*' -->
          <parameter type-id='9f7200cf'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- const uint8_t* -->
          <return type-id='9f7200cf'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_utf_t<short unsigned int, true> -->
    <class-decl name='hb_utf_t&lt;short unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='138' column='1' id='2dff2000'>
      <member-function access='public' static='yes'>
        <!-- unsigned int hb_utf_t<short unsigned int, true>::strlen() -->
        <function-decl name='strlen' mangled-name='_ZN8hb_utf_tItLb1EE6strlenEPKt' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const uint16_t*' -->
          <parameter type-id='1b7d11c6'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <!-- const uint16_t* hb_utf_t<short unsigned int, true>::prev(const uint16_t*, hb_codepoint_t*, hb_codepoint_t) -->
        <function-decl name='prev' mangled-name='_ZN8hb_utf_tItLb1EE4prevEPKtS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const uint16_t*' -->
          <parameter type-id='1b7d11c6'/>
          <!-- parameter of type 'const uint16_t*' -->
          <parameter type-id='1b7d11c6'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- const uint16_t* -->
          <return type-id='1b7d11c6'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <!-- const uint16_t* hb_utf_t<short unsigned int, true>::next(const uint16_t*, hb_codepoint_t*, hb_codepoint_t) -->
        <function-decl name='next' mangled-name='_ZN8hb_utf_tItLb1EE4nextEPKtS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'const uint16_t*' -->
          <parameter type-id='1b7d11c6'/>
          <!-- parameter of type 'const uint16_t*' -->
          <parameter type-id='1b7d11c6'/>
          <!-- parameter of type 'hb_codepoint_t*' -->
          <parameter type-id='2f53c570'/>
          <!-- parameter of type 'typedef hb_codepoint_t' -->
          <parameter type-id='a959aecb'/>
          <!-- const uint16_t* -->
          <return type-id='1b7d11c6'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- const hb_segment_properties_t -->
    <qualified-type-def type-id='c03d4c5f' const='yes' id='77bfebcf'/>
    <!-- const hb_segment_properties_t* -->
    <pointer-type-def type-id='77bfebcf' size-in-bits='64' id='6820597f'/>
    <!-- const uint16_t -->
    <qualified-type-def type-id='149c6638' const='yes' id='b01a5ac8'/>
    <!-- const uint16_t* -->
    <pointer-type-def type-id='b01a5ac8' size-in-bits='64' id='1b7d11c6'/>
    <!-- const uint32_t -->
    <qualified-type-def type-id='8f92235e' const='yes' id='b9930aae'/>
    <!-- const uint32_t* -->
    <pointer-type-def type-id='b9930aae' size-in-bits='64' id='a6798dcc'/>
    <!-- const uint8_t -->
    <qualified-type-def type-id='b96825af' const='yes' id='2b61797f'/>
    <!-- const uint8_t* -->
    <pointer-type-def type-id='2b61797f' size-in-bits='64' id='9f7200cf'/>
    <!-- hb_segment_properties_t* -->
    <pointer-type-def type-id='c03d4c5f' size-in-bits='64' id='041dea0a'/>
    <!-- hb_bool_t hb_segment_properties_equal(const hb_segment_properties_t*, const hb_segment_properties_t*) -->
    <function-decl name='hb_segment_properties_equal' mangled-name='hb_segment_properties_equal' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_equal'>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='6820597f' name='a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1'/>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='6820597f' name='b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='41' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-decl>
    <!-- unsigned int hb_segment_properties_hash(const hb_segment_properties_t*) -->
    <function-decl name='hb_segment_properties_hash' mangled-name='hb_segment_properties_hash' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_hash'>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='6820597f' name='p' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1'/>
      <!-- unsigned int -->
      <return type-id='f0981eeb'/>
    </function-decl>
    <!-- hb_buffer_t* hb_buffer_create() -->
    <function-decl name='hb_buffer_create' mangled-name='hb_buffer_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_create'>
      <!-- hb_buffer_t* -->
      <return type-id='191f8691'/>
    </function-decl>
    <!-- hb_buffer_t* hb_buffer_get_empty() -->
    <function-decl name='hb_buffer_get_empty' mangled-name='hb_buffer_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_empty'>
      <!-- hb_buffer_t* -->
      <return type-id='191f8691'/>
    </function-decl>
    <!-- hb_buffer_t* hb_buffer_reference(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reference' mangled-name='hb_buffer_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reference'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1'/>
      <!-- hb_buffer_t* -->
      <return type-id='191f8691'/>
    </function-decl>
    <!-- void hb_buffer_destroy(hb_buffer_t*) -->
    <function-decl name='hb_buffer_destroy' mangled-name='hb_buffer_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_destroy'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_set_user_data(hb_buffer_t*, hb_user_data_key_t*, void*, hb_destroy_func_t, hb_bool_t) -->
    <function-decl name='hb_buffer_set_user_data' mangled-name='hb_buffer_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_user_data'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='773' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='774' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='ed954d2d' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='775' column='1'/>
      <!-- parameter of type 'typedef hb_bool_t' -->
      <parameter type-id='fd106398' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='776' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-decl>
    <!-- void* hb_buffer_get_user_data(hb_buffer_t*, hb_user_data_key_t*) -->
    <function-decl name='hb_buffer_get_user_data' mangled-name='hb_buffer_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_user_data'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='794' column='1'/>
      <!-- void* -->
      <return type-id='eaa32e2f'/>
    </function-decl>
    <!-- void hb_buffer_set_content_type(hb_buffer_t*, hb_buffer_content_type_t) -->
    <function-decl name='hb_buffer_set_content_type' mangled-name='hb_buffer_set_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_content_type'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1'/>
      <!-- parameter of type 'enum hb_buffer_content_type_t' -->
      <parameter type-id='e8b55c7f' name='content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='811' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_buffer_content_type_t hb_buffer_get_content_type(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_content_type' mangled-name='hb_buffer_get_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_content_type'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1'/>
      <!-- enum hb_buffer_content_type_t -->
      <return type-id='e8b55c7f'/>
    </function-decl>
    <!-- void hb_buffer_set_unicode_funcs(hb_buffer_t*, hb_unicode_funcs_t*) -->
    <function-decl name='hb_buffer_set_unicode_funcs' mangled-name='hb_buffer_set_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_unicode_funcs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1'/>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='db70339e' name='unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='844' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_unicode_funcs_t* hb_buffer_get_unicode_funcs(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_unicode_funcs' mangled-name='hb_buffer_get_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_unicode_funcs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1'/>
      <!-- hb_unicode_funcs_t* -->
      <return type-id='db70339e'/>
    </function-decl>
    <!-- void hb_buffer_set_direction(hb_buffer_t*, hb_direction_t) -->
    <function-decl name='hb_buffer_set_direction' mangled-name='hb_buffer_set_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_direction'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1'/>
      <!-- parameter of type 'enum hb_direction_t' -->
      <parameter type-id='17bc5dc7' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='885' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_direction_t hb_buffer_get_direction(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_direction' mangled-name='hb_buffer_get_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_direction'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1'/>
      <!-- enum hb_direction_t -->
      <return type-id='17bc5dc7'/>
    </function-decl>
    <!-- void hb_buffer_set_script(hb_buffer_t*, hb_script_t) -->
    <function-decl name='hb_buffer_set_script' mangled-name='hb_buffer_set_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_script'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1'/>
      <!-- parameter of type 'enum hb_script_t' -->
      <parameter type-id='e02a2c4f' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='921' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_script_t hb_buffer_get_script(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_script' mangled-name='hb_buffer_get_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_script'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1'/>
      <!-- enum hb_script_t -->
      <return type-id='e02a2c4f'/>
    </function-decl>
    <!-- void hb_buffer_set_language(hb_buffer_t*, hb_language_t) -->
    <function-decl name='hb_buffer_set_language' mangled-name='hb_buffer_set_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_language'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1'/>
      <!-- parameter of type 'typedef hb_language_t' -->
      <parameter type-id='4817e45a' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='956' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_language_t hb_buffer_get_language(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_language' mangled-name='hb_buffer_get_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_language'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1'/>
      <!-- typedef hb_language_t -->
      <return type-id='4817e45a'/>
    </function-decl>
    <!-- void hb_buffer_set_segment_properties(hb_buffer_t*, const hb_segment_properties_t*) -->
    <function-decl name='hb_buffer_set_segment_properties' mangled-name='hb_buffer_set_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_segment_properties'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1'/>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='6820597f' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='991' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_get_segment_properties(hb_buffer_t*, hb_segment_properties_t*) -->
    <function-decl name='hb_buffer_get_segment_properties' mangled-name='hb_buffer_get_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_segment_properties'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1'/>
      <!-- parameter of type 'hb_segment_properties_t*' -->
      <parameter type-id='041dea0a' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1010' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_set_flags(hb_buffer_t*, hb_buffer_flags_t) -->
    <function-decl name='hb_buffer_set_flags' mangled-name='hb_buffer_set_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_flags'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1'/>
      <!-- parameter of type 'enum hb_buffer_flags_t' -->
      <parameter type-id='77054a06' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1027' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_buffer_flags_t hb_buffer_get_flags(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_flags' mangled-name='hb_buffer_get_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_flags'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1'/>
      <!-- enum hb_buffer_flags_t -->
      <return type-id='77054a06'/>
    </function-decl>
    <!-- void hb_buffer_set_replacement_codepoint(hb_buffer_t*, hb_codepoint_t) -->
    <function-decl name='hb_buffer_set_replacement_codepoint' mangled-name='hb_buffer_set_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_replacement_codepoint'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb' name='replacement' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1063' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_codepoint_t hb_buffer_get_replacement_codepoint(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_replacement_codepoint' mangled-name='hb_buffer_get_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_replacement_codepoint'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1'/>
      <!-- typedef hb_codepoint_t -->
      <return type-id='a959aecb'/>
    </function-decl>
    <!-- void hb_buffer_reset(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reset' mangled-name='hb_buffer_reset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reset'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_clear_contents(hb_buffer_t*) -->
    <function-decl name='hb_buffer_clear_contents' mangled-name='hb_buffer_clear_contents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_clear_contents'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_pre_allocate(hb_buffer_t*, unsigned int) -->
    <function-decl name='hb_buffer_pre_allocate' mangled-name='hb_buffer_pre_allocate' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_pre_allocate'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_allocation_successful(hb_buffer_t*) -->
    <function-decl name='hb_buffer_allocation_successful' mangled-name='hb_buffer_allocation_successful' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_allocation_successful'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-decl>
    <!-- void hb_buffer_add(hb_buffer_t*, hb_codepoint_t, unsigned int) -->
    <function-decl name='hb_buffer_add' mangled-name='hb_buffer_add' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='a959aecb' name='codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1161' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='cluster' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1162' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_set_length(hb_buffer_t*, unsigned int) -->
    <function-decl name='hb_buffer_set_length' mangled-name='hb_buffer_set_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_length'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-decl>
    <!-- unsigned int hb_buffer_get_length(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_length' mangled-name='hb_buffer_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_length'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1'/>
      <!-- unsigned int -->
      <return type-id='f0981eeb'/>
    </function-decl>
    <!-- hb_glyph_info_t* hb_buffer_get_glyph_infos(hb_buffer_t*, unsigned int*) -->
    <function-decl name='hb_buffer_get_glyph_infos' mangled-name='hb_buffer_get_glyph_infos' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_infos'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='807869d3' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1238' column='1'/>
      <!-- hb_glyph_info_t* -->
      <return type-id='4cf9317a'/>
    </function-decl>
    <!-- hb_glyph_position_t* hb_buffer_get_glyph_positions(hb_buffer_t*, unsigned int*) -->
    <function-decl name='hb_buffer_get_glyph_positions' mangled-name='hb_buffer_get_glyph_positions' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_positions'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='807869d3' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1260' column='1'/>
      <!-- hb_glyph_position_t* -->
      <return type-id='9493c6e3'/>
    </function-decl>
    <!-- void hb_buffer_reverse(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reverse' mangled-name='hb_buffer_reverse' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_reverse_clusters(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reverse_clusters' mangled-name='hb_buffer_reverse_clusters' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse_clusters'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_guess_segment_properties(hb_buffer_t*) -->
    <function-decl name='hb_buffer_guess_segment_properties' mangled-name='hb_buffer_guess_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_guess_segment_properties'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_add_utf8(hb_buffer_t*, const char*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_utf8' mangled-name='hb_buffer_add_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf8'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1414' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1415' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1416' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1417' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_add_utf16(hb_buffer_t*, const uint16_t*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_utf16' mangled-name='hb_buffer_add_utf16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf16'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1'/>
      <!-- parameter of type 'const uint16_t*' -->
      <parameter type-id='1b7d11c6' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1436' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1437' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1438' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1439' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_add_utf32(hb_buffer_t*, const uint32_t*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_utf32' mangled-name='hb_buffer_add_utf32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf32'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1'/>
      <!-- parameter of type 'const uint32_t*' -->
      <parameter type-id='a6798dcc' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1458' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1459' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1460' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1461' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_add_codepoints(hb_buffer_t*, const hb_codepoint_t*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_codepoints' mangled-name='hb_buffer_add_codepoints' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_codepoints'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1'/>
      <!-- parameter of type 'const hb_codepoint_t*' -->
      <parameter type-id='1d980383' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1480' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1481' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1482' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1483' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void hb_buffer_normalize_glyphs(hb_buffer_t*) -->
    <function-decl name='hb_buffer_normalize_glyphs' mangled-name='hb_buffer_normalize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_normalize_glyphs'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- char[1] -->
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <!-- const char[1] -->
    <array-type-def dimensions='1' type-id='9b45d938' size-in-bits='8' id='048e5bff'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <!-- struct hb_language_item_t -->
    <class-decl name='hb_language_item_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='212' column='1' id='1bb48d4b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_language_item_t* hb_language_item_t::next -->
        <var-decl name='next' type-id='e810096b' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_language_t hb_language_item_t::lang -->
        <var-decl name='lang' type-id='4817e45a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='215' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- void hb_language_item_t::finish() -->
        <function-decl name='finish' mangled-name='_ZN18hb_language_item_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_language_item_t*' -->
          <parameter type-id='e810096b' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_language_item_t::operator==(const char*) -->
        <function-decl name='operator==' mangled-name='_ZNK18hb_language_item_teqEPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_language_item_t*' -->
          <parameter type-id='ac503fd0' is-artificial='yes'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_language_item_t& hb_language_item_t::operator=(const char*) -->
        <function-decl name='operator=' mangled-name='_ZN18hb_language_item_taSEPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_language_item_t*' -->
          <parameter type-id='e810096b' is-artificial='yes'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- hb_language_item_t& -->
          <return type-id='e410031f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- typedef uint32_t hb_tag_t -->
    <typedef-decl name='hb_tag_t' type-id='8f92235e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='91' column='1' id='863e9b4e'/>
    <!-- const hb_language_item_t -->
    <qualified-type-def type-id='1bb48d4b' const='yes' id='9849e2da'/>
    <!-- const hb_language_item_t* -->
    <pointer-type-def type-id='9849e2da' size-in-bits='64' id='ac503fd0'/>
    <!-- hb_language_item_t& -->
    <reference-type-def kind='lvalue' type-id='1bb48d4b' size-in-bits='64' id='e410031f'/>
    <!-- hb_language_item_t* -->
    <pointer-type-def type-id='1bb48d4b' size-in-bits='64' id='e810096b'/>
    <!-- hb_tag_t hb_tag_from_string(const char*, int) -->
    <function-decl name='hb_tag_from_string' mangled-name='hb_tag_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <!-- typedef hb_tag_t -->
      <return type-id='863e9b4e'/>
    </function-decl>
    <!-- void hb_tag_to_string(hb_tag_t, char*) -->
    <function-decl name='hb_tag_to_string' mangled-name='hb_tag_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_to_string'>
      <!-- parameter of type 'typedef hb_tag_t' -->
      <parameter type-id='863e9b4e' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='26a90f95' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- hb_direction_t hb_direction_from_string(const char*, int) -->
    <function-decl name='hb_direction_from_string' mangled-name='hb_direction_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <!-- enum hb_direction_t -->
      <return type-id='17bc5dc7'/>
    </function-decl>
    <!-- const char* hb_direction_to_string(hb_direction_t) -->
    <function-decl name='hb_direction_to_string' mangled-name='hb_direction_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_to_string'>
      <!-- parameter of type 'enum hb_direction_t' -->
      <parameter type-id='17bc5dc7' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- hb_language_t hb_language_from_string(const char*, int) -->
    <function-decl name='hb_language_from_string' mangled-name='hb_language_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <!-- typedef hb_language_t -->
      <return type-id='4817e45a'/>
    </function-decl>
    <!-- const char* hb_language_to_string(hb_language_t) -->
    <function-decl name='hb_language_to_string' mangled-name='hb_language_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_to_string'>
      <!-- parameter of type 'typedef hb_language_t' -->
      <parameter type-id='4817e45a' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1'/>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- hb_language_t hb_language_get_default() -->
    <function-decl name='hb_language_get_default' mangled-name='hb_language_get_default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_get_default'>
      <!-- typedef hb_language_t -->
      <return type-id='4817e45a'/>
    </function-decl>
    <!-- hb_script_t hb_script_from_iso15924_tag(hb_tag_t) -->
    <function-decl name='hb_script_from_iso15924_tag' mangled-name='hb_script_from_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_iso15924_tag'>
      <!-- parameter of type 'typedef hb_tag_t' -->
      <parameter type-id='863e9b4e' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1'/>
      <!-- enum hb_script_t -->
      <return type-id='e02a2c4f'/>
    </function-decl>
    <!-- hb_script_t hb_script_from_string(const char*, int) -->
    <function-decl name='hb_script_from_string' mangled-name='hb_script_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_string'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='80f4b756' name='s' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <!-- enum hb_script_t -->
      <return type-id='e02a2c4f'/>
    </function-decl>
    <!-- hb_tag_t hb_script_to_iso15924_tag(hb_script_t) -->
    <function-decl name='hb_script_to_iso15924_tag' mangled-name='hb_script_to_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_to_iso15924_tag'>
      <!-- parameter of type 'enum hb_script_t' -->
      <parameter type-id='e02a2c4f' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1'/>
      <!-- typedef hb_tag_t -->
      <return type-id='863e9b4e'/>
    </function-decl>
    <!-- hb_direction_t hb_script_get_horizontal_direction(hb_script_t) -->
    <function-decl name='hb_script_get_horizontal_direction' mangled-name='hb_script_get_horizontal_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_get_horizontal_direction'>
      <!-- parameter of type 'enum hb_script_t' -->
      <parameter type-id='e02a2c4f' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1'/>
      <!-- enum hb_direction_t -->
      <return type-id='17bc5dc7'/>
    </function-decl>
    <!-- void hb_version(unsigned int*, unsigned int*, unsigned int*) -->
    <function-decl name='hb_version' mangled-name='hb_version' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version'>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='807869d3' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='807869d3' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='548' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='807869d3' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='549' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- const char* hb_version_string() -->
    <function-decl name='hb_version_string' mangled-name='hb_version_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_string'>
      <!-- const char* -->
      <return type-id='80f4b756'/>
    </function-decl>
    <!-- hb_bool_t hb_version_atleast(unsigned int, unsigned int, unsigned int) -->
    <function-decl name='hb_version_atleast' mangled-name='hb_version_atleast' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_atleast'>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='585' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='f0981eeb' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='586' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='fd106398'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-face.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >[1] -->
    <array-type-def dimensions='1' type-id='94eda2ef' size-in-bits='32' id='08204ba6'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <!-- TableRecord[1] -->
    <array-type-def dimensions='1' type-id='767ae7db' size-in-bits='128' id='b164f8c2'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <!-- uint8_t[2] -->
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' id='0f4b9e74'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- struct hb_face_t -->
    <class-decl name='hb_face_t' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='43' column='1' id='33103862'>
      <member-type access='public'>
        <!-- struct hb_face_t::plan_node_t -->
        <class-decl name='plan_node_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='59' column='1' id='796ce979'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_shape_plan_t* hb_face_t::plan_node_t::shape_plan -->
            <var-decl name='shape_plan' type-id='4b761f1c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='60' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_face_t::plan_node_t* hb_face_t::plan_node_t::next -->
            <var-decl name='next' type-id='76ba0571' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='61' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_face_t::header -->
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_face_t::immutable -->
        <var-decl name='immutable' type-id='fd106398' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_reference_table_func_t hb_face_t::reference_table_func -->
        <var-decl name='reference_table_func' type-id='36cb7639' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- void* hb_face_t::user_data -->
        <var-decl name='user_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- hb_destroy_func_t hb_face_t::destroy -->
        <var-decl name='destroy' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- unsigned int hb_face_t::index -->
        <var-decl name='index' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <!-- unsigned int hb_face_t::upem -->
        <var-decl name='upem' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- unsigned int hb_face_t::num_glyphs -->
        <var-decl name='num_glyphs' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- hb_shaper_data_t hb_face_t::shaper_data -->
        <var-decl name='shaper_data' type-id='330059bd' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_face_t::plan_node_t* hb_face_t::shape_plans -->
        <var-decl name='shape_plans' type-id='76ba0571' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='62' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- unsigned int hb_face_t::get_num_glyphs() -->
        <function-decl name='get_num_glyphs' mangled-name='_ZNK9hb_face_t14get_num_glyphsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_face_t*' -->
          <parameter type-id='5cc9d325' is-artificial='yes'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- unsigned int hb_face_t::get_upem() -->
        <function-decl name='get_upem' mangled-name='_ZNK9hb_face_t8get_upemEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_face_t*' -->
          <parameter type-id='5cc9d325' is-artificial='yes'/>
          <!-- unsigned int -->
          <return type-id='f0981eeb'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- hb_blob_t* hb_face_t::reference_table(hb_tag_t) -->
        <function-decl name='reference_table' mangled-name='_ZNK9hb_face_t15reference_tableEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_face_t*' -->
          <parameter type-id='5cc9d325' is-artificial='yes'/>
          <!-- parameter of type 'typedef hb_tag_t' -->
          <parameter type-id='863e9b4e'/>
          <!-- hb_blob_t* -->
          <return type-id='9d7b4d1e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void hb_face_t::load_num_glyphs() -->
        <function-decl name='load_num_glyphs' mangled-name='_ZNK9hb_face_t15load_num_glyphsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_face_t*' -->
          <parameter type-id='5cc9d325' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void hb_face_t::load_upem() -->
        <function-decl name='load_upem' mangled-name='_ZNK9hb_face_t9load_upemEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'const hb_face_t*' -->
          <parameter type-id='5cc9d325' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- typedef hb_face_t hb_face_t -->
    <typedef-decl name='hb_face_t' type-id='33103862' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='44' column='1' id='e7d6a3bd'/>
    <!-- typedef hb_blob_t* (hb_face_t*, typedef hb_tag_t, void*)* hb_reference_table_func_t -->
    <typedef-decl name='hb_reference_table_func_t' type-id='899129c7' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='50' column='1' id='36cb7639'/>
    <!-- struct hb_font_funcs_t -->
    <class-decl name='hb_font_funcs_t' size-in-bits='3072' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='58' column='1' id='52c7255a'>
      <member-type access='public'>
        <!-- struct {hb_font_get_glyph_func_t glyph; hb_font_get_glyph_h_advance_func_t glyph_h_advance; hb_font_get_glyph_v_advance_func_t glyph_v_advance; hb_font_get_glyph_h_origin_func_t glyph_h_origin; hb_font_get_glyph_v_origin_func_t glyph_v_origin; hb_font_get_glyph_h_kerning_func_t glyph_h_kerning; hb_font_get_glyph_v_kerning_func_t glyph_v_kerning; hb_font_get_glyph_extents_func_t glyph_extents; hb_font_get_glyph_contour_point_func_t glyph_contour_point; hb_font_get_glyph_name_func_t glyph_name; hb_font_get_glyph_from_name_func_t glyph_from_name;} -->
        <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='66' column='1' id='e7f43f75'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_font_get_glyph_func_t glyph -->
            <var-decl name='glyph' type-id='edf20f30' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_font_get_glyph_h_advance_func_t glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='470d6fd2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_font_get_glyph_v_advance_func_t glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='8c28fd84' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_font_get_glyph_h_origin_func_t glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='da57d2e2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_font_get_glyph_v_origin_func_t glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='ef07a49c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_font_get_glyph_h_kerning_func_t glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='6a2b14c4' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_font_get_glyph_v_kerning_func_t glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='32616a16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_font_get_glyph_extents_func_t glyph_extents -->
            <var-decl name='glyph_extents' type-id='0ac172ae' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- hb_font_get_glyph_contour_point_func_t glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='6645a91c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- hb_font_get_glyph_name_func_t glyph_name -->
            <var-decl name='glyph_name' type-id='f25382de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- hb_font_get_glyph_from_name_func_t glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='d1896ec7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {void* glyph; void* glyph_h_advance; void* glyph_v_advance; void* glyph_h_origin; void* glyph_v_origin; void* glyph_h_kerning; void* glyph_v_kerning; void* glyph_extents; void* glyph_contour_point; void* glyph_name; void* glyph_from_name;} -->
        <class-decl name='__anonymous_struct__1' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='72' column='1' id='e7f43f76'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- void* glyph -->
            <var-decl name='glyph' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- void* glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- void* glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- void* glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- void* glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- void* glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- void* glyph_extents -->
            <var-decl name='glyph_extents' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- void* glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- void* glyph_name -->
            <var-decl name='glyph_name' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- void* glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {hb_destroy_func_t glyph; hb_destroy_func_t glyph_h_advance; hb_destroy_func_t glyph_v_advance; hb_destroy_func_t glyph_h_origin; hb_destroy_func_t glyph_v_origin; hb_destroy_func_t glyph_h_kerning; hb_destroy_func_t glyph_v_kerning; hb_destroy_func_t glyph_extents; hb_destroy_func_t glyph_contour_point; hb_destroy_func_t glyph_name; hb_destroy_func_t glyph_from_name;} -->
        <class-decl name='__anonymous_struct__2' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='78' column='1' id='e7f43f77'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_destroy_func_t glyph -->
            <var-decl name='glyph' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_destroy_func_t glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_destroy_func_t glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_destroy_func_t glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_destroy_func_t glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_destroy_func_t glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_destroy_func_t glyph_extents -->
            <var-decl name='glyph_extents' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- hb_destroy_func_t glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- hb_destroy_func_t glyph_name -->
            <var-decl name='glyph_name' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- hb_destroy_func_t glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_font_funcs_t::header -->
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_font_funcs_t::immutable -->
        <var-decl name='immutable' type-id='fd106398' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- struct {hb_font_get_glyph_func_t glyph; hb_font_get_glyph_h_advance_func_t glyph_h_advance; hb_font_get_glyph_v_advance_func_t glyph_v_advance; hb_font_get_glyph_h_origin_func_t glyph_h_origin; hb_font_get_glyph_v_origin_func_t glyph_v_origin; hb_font_get_glyph_h_kerning_func_t glyph_h_kerning; hb_font_get_glyph_v_kerning_func_t glyph_v_kerning; hb_font_get_glyph_extents_func_t glyph_extents; hb_font_get_glyph_contour_point_func_t glyph_contour_point; hb_font_get_glyph_name_func_t glyph_name; hb_font_get_glyph_from_name_func_t glyph_from_name;} hb_font_funcs_t::get -->
        <var-decl name='get' type-id='e7f43f75' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <!-- struct {void* glyph; void* glyph_h_advance; void* glyph_v_advance; void* glyph_h_origin; void* glyph_v_origin; void* glyph_h_kerning; void* glyph_v_kerning; void* glyph_extents; void* glyph_contour_point; void* glyph_name; void* glyph_from_name;} hb_font_funcs_t::user_data -->
        <var-decl name='user_data' type-id='e7f43f76' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <!-- struct {hb_destroy_func_t glyph; hb_destroy_func_t glyph_h_advance; hb_destroy_func_t glyph_v_advance; hb_destroy_func_t glyph_h_origin; hb_destroy_func_t glyph_v_origin; hb_destroy_func_t glyph_h_kerning; hb_destroy_func_t glyph_v_kerning; hb_destroy_func_t glyph_extents; hb_destroy_func_t glyph_contour_point; hb_destroy_func_t glyph_name; hb_destroy_func_t glyph_from_name;} hb_font_funcs_t::destroy -->
        <var-decl name='destroy' type-id='e7f43f77' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='82' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_font_funcs_t hb_font_funcs_t -->
    <typedef-decl name='hb_font_funcs_t' type-id='52c7255a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='47' column='1' id='e0cb82cd'/>
    <!-- struct hb_glyph_extents_t -->
    <class-decl name='hb_glyph_extents_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='84' column='1' id='ed56fa9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_position_t hb_glyph_extents_t::x_bearing -->
        <var-decl name='x_bearing' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_position_t hb_glyph_extents_t::y_bearing -->
        <var-decl name='y_bearing' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_position_t hb_glyph_extents_t::width -->
        <var-decl name='width' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- hb_position_t hb_glyph_extents_t::height -->
        <var-decl name='height' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_glyph_extents_t hb_glyph_extents_t -->
    <typedef-decl name='hb_glyph_extents_t' type-id='ed56fa9b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='89' column='1' id='9931de52'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, hb_codepoint_t*, void*)* hb_font_get_glyph_func_t -->
    <typedef-decl name='hb_font_get_glyph_func_t' type-id='ae899539' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='97' column='1' id='edf20f30'/>
    <!-- typedef typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, void*)* hb_font_get_glyph_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_advance_func_t' type-id='b3d0598b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='102' column='1' id='2e3a3e2f'/>
    <!-- typedef hb_font_get_glyph_advance_func_t hb_font_get_glyph_h_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_advance_func_t' type-id='2e3a3e2f' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='103' column='1' id='470d6fd2'/>
    <!-- typedef hb_font_get_glyph_advance_func_t hb_font_get_glyph_v_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_advance_func_t' type-id='2e3a3e2f' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='104' column='1' id='8c28fd84'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_position_t*, hb_position_t*, void*)* hb_font_get_glyph_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_origin_func_t' type-id='7310f374' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='109' column='1' id='42df68a1'/>
    <!-- typedef hb_font_get_glyph_origin_func_t hb_font_get_glyph_h_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_origin_func_t' type-id='42df68a1' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='110' column='1' id='da57d2e2'/>
    <!-- typedef hb_font_get_glyph_origin_func_t hb_font_get_glyph_v_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_origin_func_t' type-id='42df68a1' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='111' column='1' id='ef07a49c'/>
    <!-- typedef typedef hb_position_t (hb_font_t*, void*, typedef hb_codepoint_t, typedef hb_codepoint_t, void*)* hb_font_get_glyph_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_kerning_func_t' type-id='134be6b5' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='115' column='1' id='5f398a99'/>
    <!-- typedef hb_font_get_glyph_kerning_func_t hb_font_get_glyph_h_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_kerning_func_t' type-id='5f398a99' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='116' column='1' id='6a2b14c4'/>
    <!-- typedef hb_font_get_glyph_kerning_func_t hb_font_get_glyph_v_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_kerning_func_t' type-id='5f398a99' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='117' column='1' id='32616a16'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, hb_glyph_extents_t*, void*)* hb_font_get_glyph_extents_func_t -->
    <typedef-decl name='hb_font_get_glyph_extents_func_t' type-id='9e69dfc6' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='123' column='1' id='0ac172ae'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, unsigned int, hb_position_t*, hb_position_t*, void*)* hb_font_get_glyph_contour_point_func_t -->
    <typedef-decl name='hb_font_get_glyph_contour_point_func_t' type-id='d8c35c42' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='127' column='1' id='6645a91c'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, typedef hb_codepoint_t, char*, unsigned int, void*)* hb_font_get_glyph_name_func_t -->
    <typedef-decl name='hb_font_get_glyph_name_func_t' type-id='5e22d31a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='133' column='1' id='f25382de'/>
    <!-- typedef typedef hb_bool_t (hb_font_t*, void*, const char*, int, hb_codepoint_t*, void*)* hb_font_get_glyph_from_name_func_t -->
    <typedef-decl name='hb_font_get_glyph_from_name_func_t' type-id='a223d247' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='137' column='1' id='d1896ec7'/>
    <!-- struct hb_auto_trace_t<0, bool> -->
    <class-decl name='hb_auto_trace_t&lt;0, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='749' column='1' id='6f2257b0'>
      <member-function access='public'>
        <!-- void hb_auto_trace_t<0, bool>::hb_auto_trace_t(unsigned int*, const char*, void*, const char*, const char*, ...) -->
        <function-decl name='hb_auto_trace_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='797' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_auto_trace_t<0, bool>*' -->
          <parameter type-id='a81985b6' is-artificial='yes'/>
          <!-- parameter of type 'unsigned int*' -->
          <parameter type-id='807869d3'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='eaa32e2f'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <parameter is-variadic='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- bool hb_auto_trace_t<0, bool>::ret(bool, unsigned int) -->
        <function-decl name='ret' mangled-name='_ZN15hb_auto_trace_tILi0EbE3retEbj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='804' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'hb_auto_trace_t<0, bool>*' -->
          <parameter type-id='a81985b6' is-artificial='yes'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='c894953d'/>
          <!-- parameter of type 'unsigned int' -->
          <parameter type-id='f0981eeb'/>
          <!-- bool -->
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct hb_shape_plan_t -->
    <class-decl name='hb_shape_plan_t' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='36' column='1' id='368f2b06'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_shape_plan_t::header -->
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_shape_plan_t::default_shaper_list -->
        <var-decl name='default_shaper_list' type-id='fd106398' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_face_t* hb_shape_plan_t::face_unsafe -->
        <var-decl name='face_unsafe' type-id='d4e35730' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_segment_properties_t hb_shape_plan_t::props -->
        <var-decl name='props' type-id='c03d4c5f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- hb_shape_func_t* hb_shape_plan_t::shaper_func -->
        <var-decl name='shaper_func' type-id='cbe55efb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- const char* hb_shape_plan_t::shaper_name -->
        <var-decl name='shaper_name' type-id='80f4b756' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_feature_t* hb_shape_plan_t::user_features -->
        <var-decl name='user_features' type-id='c1ba349d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- unsigned int hb_shape_plan_t::num_user_features -->
        <var-decl name='num_user_features' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- hb_shaper_data_t hb_shape_plan_t::shaper_data -->
        <var-decl name='shaper_data' type-id='330059bd' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_shape_plan_t hb_shape_plan_t -->
    <typedef-decl name='hb_shape_plan_t' type-id='368f2b06' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan.h' line='39' column='1' id='3e9ec359'/>
    <!-- struct hb_feature_t -->
    <class-decl name='hb_feature_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='43' column='1' id='40daad3d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_tag_t hb_feature_t::tag -->
        <var-decl name='tag' type-id='863e9b4e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t hb_feature_t::value -->
        <var-decl name='value' type-id='8f92235e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int hb_feature_t::start -->
        <var-decl name='start' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int hb_feature_t::end -->
        <var-decl name='end' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_feature_t hb_feature_t -->
    <typedef-decl name='hb_feature_t' type-id='40daad3d' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='48' column='1' id='080f0c70'/>
    <!-- typedef typedef hb_bool_t (hb_shape_plan_t*, hb_font_t*, hb_buffer_t*, const hb_feature_t*, unsigned int) hb_shape_func_t -->
