<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libGLU.so.1'>
  <elf-needed>
    <dependency name='libGL.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- gluBeginCurve -->
    <elf-symbol name='gluBeginCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBeginPolygon -->
    <elf-symbol name='gluBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBeginSurface -->
    <elf-symbol name='gluBeginSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBeginTrim -->
    <elf-symbol name='gluBeginTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild1DMipmapLevels -->
    <elf-symbol name='gluBuild1DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild1DMipmaps -->
    <elf-symbol name='gluBuild1DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild2DMipmapLevels -->
    <elf-symbol name='gluBuild2DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild2DMipmaps -->

    <elf-symbol name='gluNurbsCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsProperty -->
    <elf-symbol name='gluNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsSurface -->
    <elf-symbol name='gluNurbsSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluOrtho2D -->
    <elf-symbol name='gluOrtho2D' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPartialDisk -->
    <elf-symbol name='gluPartialDisk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPerspective -->
    <elf-symbol name='gluPerspective' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPickMatrix -->
    <elf-symbol name='gluPickMatrix' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluProject -->
    <elf-symbol name='gluProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPwlCurve -->
    <elf-symbol name='gluPwlCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricCallback -->
    <elf-symbol name='gluQuadricCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricDrawStyle -->
    <elf-symbol name='gluQuadricDrawStyle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricNormals -->
    <elf-symbol name='gluQuadricNormals' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricOrientation -->
    <elf-symbol name='gluQuadricOrientation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricTexture -->
    <elf-symbol name='gluQuadricTexture' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluScaleImage -->
    <elf-symbol name='gluScaleImage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluSphere -->
    <elf-symbol name='gluSphere' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessBeginContour -->
    <elf-symbol name='gluTessBeginContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessBeginPolygon -->
    <elf-symbol name='gluTessBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessCallback -->
    <elf-symbol name='gluTessCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessEndContour -->
    <elf-symbol name='gluTessEndContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessEndPolygon -->
    <elf-symbol name='gluTessEndPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessNormal -->
    <elf-symbol name='gluTessNormal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessProperty -->
    <elf-symbol name='gluTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessVertex -->
    <elf-symbol name='gluTessVertex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluUnProject -->
    <elf-symbol name='gluUnProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluUnProject4 -->
    <elf-symbol name='gluUnProject4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='libnurbs/interface/glcurveval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- REAL[160] -->
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='5120' id='8ac42fbe'>
      <!-- <anonymous range>[160] -->
      <subrange length='160' type-id='7359adad' id='d20f9a26'/>
    </array-type-def>
    <!-- REAL[40] -->
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='1280' id='2ce43ee1'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <!-- float -->
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <!-- void -->
    <type-decl name='void' id='48b5725f'/>
    <!-- typedef unsigned int GLenum -->
    <typedef-decl name='GLenum' type-id='f0981eeb' filepath='../../../include/GL/gl.h' line='149' column='1' id='055aa60e'/>
    <!-- typedef float GLfloat -->
    <typedef-decl name='GLfloat' type-id='a6c45d85' filepath='../../../include/GL/gl.h' line='160' column='1' id='46496ee3'/>
    <!-- typedef void ()* _GLUfuncptr -->
    <typedef-decl name='_GLUfuncptr' type-id='953b12f8' filepath='../../../include/GL/glu.h' line='287' column='1' id='9fac4a53'/>
    <!-- struct curveEvalMachine -->
    <class-decl name='curveEvalMachine' size-in-bits='6592' is-struct='yes' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='55' column='1' id='39487693'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL curveEvalMachine::uprime -->
        <var-decl name='uprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int curveEvalMachine::k -->
        <var-decl name='k' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL curveEvalMachine::u1 -->
        <var-decl name='u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL curveEvalMachine::u2 -->
        <var-decl name='u2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int curveEvalMachine::ustride -->
        <var-decl name='ustride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int curveEvalMachine::uorder -->
        <var-decl name='uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- REAL curveEvalMachine::ctlpoints[160] -->
        <var-decl name='ctlpoints' type-id='8ac42fbe' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <!-- REAL curveEvalMachine::ucoeff[40] -->
        <var-decl name='ucoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef curveEvalMachine curveEvalMachine -->
    <typedef-decl name='curveEvalMachine' type-id='39487693' filepath='libnurbs/interface/glcurveval.h' line='64' column='1' id='a7431a56'/>
    <!-- class CachingEvaluator -->
    <class-decl name='CachingEvaluator' size-in-bits='64' visibility='default' filepath='libnurbs/internals/cachingeval.h' line='39' column='1' id='98511c0f'>
      <member-type access='private'>
        <!-- enum CachingEvaluator::ServiceMode -->
        <enum-decl name='ServiceMode' filepath='libnurbs/internals/cachingeval.h' line='42' column='1' id='85ef429a'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='play' value='0'/>
          <enumerator name='record' value='1'/>
          <enumerator name='playAndRecord' value='2'/>
        </enum-decl>
      </member-type>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- CachingEvaluator::~CachingEvaluator(int) -->
        <function-decl name='~CachingEvaluator' filepath='libnurbs/internals/cachingeval.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <!-- int CachingEvaluator::canRecord() -->
        <function-decl name='canRecord' mangled-name='_ZN16CachingEvaluator9canRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <!-- int CachingEvaluator::canPlayAndRecord() -->
        <function-decl name='canPlayAndRecord' mangled-name='_ZN16CachingEvaluator16canPlayAndRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <!-- int CachingEvaluator::createHandle(int) -->
        <function-decl name='createHandle' mangled-name='_ZN16CachingEvaluator12createHandleEi' filepath='libnurbs/internals/cachingeval.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <!-- void CachingEvaluator::beginOutput(CachingEvaluator::ServiceMode, int) -->
        <function-decl name='beginOutput' mangled-name='_ZN16CachingEvaluator11beginOutputENS_11ServiceModeEi' filepath='libnurbs/internals/cachingeval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <!-- parameter of type 'enum CachingEvaluator::ServiceMode' -->
          <parameter type-id='85ef429a'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <!-- void CachingEvaluator::endOutput() -->
        <function-decl name='endOutput' mangled-name='_ZN16CachingEvaluator9endOutputEv' filepath='libnurbs/internals/cachingeval.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='7'>
        <!-- void CachingEvaluator::discardRecording(int) -->
        <function-decl name='discardRecording' mangled-name='_ZN16CachingEvaluator16discardRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='8'>
        <!-- void CachingEvaluator::playRecording(int) -->
        <function-decl name='playRecording' mangled-name='_ZN16CachingEvaluator13playRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- typedef float REAL -->
    <typedef-decl name='REAL' type-id='a6c45d85' filepath='libnurbs/internals/types.h' line='41' column='1' id='234bc418'/>
    <!-- BasicCurveEvaluator* -->
    <pointer-type-def type-id='22b18ed5' size-in-bits='64' id='11a0d165'/>
    <!-- CachingEvaluator* -->
    <pointer-type-def type-id='98511c0f' size-in-bits='64' id='d4b6ed87'/>
    <!-- CurveMap* -->
    <pointer-type-def type-id='6abc0132' size-in-bits='64' id='a3f18a30'/>
    <!-- OpenGLCurveEvaluator* -->
    <pointer-type-def type-id='8d4b0ae2' size-in-bits='64' id='83a254c0'/>
    <!-- OpenGLCurveEvaluator* const -->
    <qualified-type-def type-id='83a254c0' const='yes' id='6f423093'/>
    <!-- REAL* -->
    <pointer-type-def type-id='234bc418' size-in-bits='64' id='c0eda015'/>
    <!-- const GLfloat -->
    <qualified-type-def type-id='46496ee3' const='yes' id='9d5e4f33'/>
    <!-- const GLfloat* -->
    <pointer-type-def type-id='9d5e4f33' size-in-bits='64' id='d476845b'/>
    <!-- curveEvalMachine* -->
    <pointer-type-def type-id='a7431a56' size-in-bits='64' id='8278cb23'/>
    <!-- void ()* -->
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <!-- void (const GLfloat*)* -->
    <pointer-type-def type-id='6485bd28' size-in-bits='64' id='318ea842'/>
    <!-- void (const GLfloat*, void*)* -->
    <pointer-type-def type-id='f267cc92' size-in-bits='64' id='5a82918c'/>
    <!-- void (typedef GLenum)* -->
    <pointer-type-def type-id='4ba07ef3' size-in-bits='64' id='30135957'/>
    <!-- void (typedef GLenum, void*)* -->
    <pointer-type-def type-id='2b48a6c7' size-in-bits='64' id='5f8a287b'/>
    <!-- void (void*)* -->
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <!-- void* -->
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <!-- struct CurveMap -->
    <class-decl name='CurveMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='6abc0132'/>
    <!-- class OpenGLCurveEvaluator -->
    <class-decl name='OpenGLCurveEvaluator' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='66' column='1' is-declaration-only='yes' id='8d4b0ae2'>
      <!-- struct BasicCurveEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='22b18ed5'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_vertex -->
        <var-decl name='em_vertex' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='102' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6656'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_normal -->
        <var-decl name='em_normal' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='103' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13248'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_color -->
        <var-decl name='em_color' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='104' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19840'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_texcoord -->
        <var-decl name='em_texcoord' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26432'>
        <!-- int OpenGLCurveEvaluator::vertex_flag -->
        <var-decl name='vertex_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26464'>
        <!-- int OpenGLCurveEvaluator::normal_flag -->
        <var-decl name='normal_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26496'>
        <!-- int OpenGLCurveEvaluator::color_flag -->
        <var-decl name='color_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26528'>
        <!-- int OpenGLCurveEvaluator::texcoord_flag -->
        <var-decl name='texcoord_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26560'>
        <!-- REAL OpenGLCurveEvaluator::global_grid_u0 -->
        <var-decl name='global_grid_u0' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26592'>
        <!-- REAL OpenGLCurveEvaluator::global_grid_u1 -->
        <var-decl name='global_grid_u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <!-- int OpenGLCurveEvaluator::global_grid_nu -->
        <var-decl name='global_grid_nu' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26688'>
        <!-- void (typedef GLenum)* OpenGLCurveEvaluator::beginCallBackN -->
        <var-decl name='beginCallBackN' type-id='30135957' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26752'>
        <!-- void ()* OpenGLCurveEvaluator::endCallBackN -->
        <var-decl name='endCallBackN' type-id='953b12f8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26816'>
        <!-- void (const GLfloat*)* OpenGLCurveEvaluator::vertexCallBackN -->
        <var-decl name='vertexCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26880'>
        <!-- void (const GLfloat*)* OpenGLCurveEvaluator::normalCallBackN -->
        <var-decl name='normalCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26944'>
        <!-- void (const GLfloat*)* OpenGLCurveEvaluator::colorCallBackN -->
        <var-decl name='colorCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27008'>
        <!-- void (const GLfloat*)* OpenGLCurveEvaluator::texcoordCallBackN -->
        <var-decl name='texcoordCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27072'>
        <!-- void (typedef GLenum, void*)* OpenGLCurveEvaluator::beginCallBackData -->
        <var-decl name='beginCallBackData' type-id='5f8a287b' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27136'>
        <!-- void (void*)* OpenGLCurveEvaluator::endCallBackData -->
        <var-decl name='endCallBackData' type-id='b7f9d8e6' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27200'>
        <!-- void (const GLfloat*, void*)* OpenGLCurveEvaluator::vertexCallBackData -->
        <var-decl name='vertexCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27264'>
        <!-- void (const GLfloat*, void*)* OpenGLCurveEvaluator::normalCallBackData -->
        <var-decl name='normalCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27328'>
        <!-- void (const GLfloat*, void*)* OpenGLCurveEvaluator::colorCallBackData -->
        <var-decl name='colorCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <!-- void (const GLfloat*, void*)* OpenGLCurveEvaluator::texcoordCallBackData -->
        <var-decl name='texcoordCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <!-- void* OpenGLCurveEvaluator::userData -->
        <var-decl name='userData' type-id='eaa32e2f' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <!-- int OpenGLCurveEvaluator::output_triangles -->
        <var-decl name='output_triangles' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='154' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- OpenGLCurveEvaluator::OpenGLCurveEvaluator() -->
        <function-decl name='OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- OpenGLCurveEvaluator::~OpenGLCurveEvaluator(int) -->
        <function-decl name='~OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <!-- void OpenGLCurveEvaluator::domain1f(REAL, REAL) -->
        <function-decl name='domain1f' mangled-name='_ZN20OpenGLCurveEvaluator8domain1fEff' filepath='libnurbs/interface/glcurveval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <!-- void OpenGLCurveEvaluator::range1f(long int, REAL*, REAL*) -->
        <function-decl name='range1f' mangled-name='_ZN20OpenGLCurveEvaluator7range1fElPfS0_' filepath='libnurbs/interface/glcurveval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <!-- void OpenGLCurveEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN20OpenGLCurveEvaluator6enableEl' filepath='libnurbs/interface/glcurveval.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <!-- void OpenGLCurveEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN20OpenGLCurveEvaluator7disableEl' filepath='libnurbs/interface/glcurveval.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <!-- void OpenGLCurveEvaluator::bgnmap1f(long int) -->
        <function-decl name='bgnmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8bgnmap1fEl' filepath='libnurbs/interface/glcurveval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <!-- void OpenGLCurveEvaluator::map1f(long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map1f' mangled-name='_ZN20OpenGLCurveEvaluator5map1fElffllPf' filepath='libnurbs/interface/glcurveval.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <!-- void OpenGLCurveEvaluator::mapgrid1f(long int, REAL, REAL) -->
        <function-decl name='mapgrid1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapgrid1fElff' filepath='libnurbs/interface/glcurveval.cc' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <!-- void OpenGLCurveEvaluator::mapmesh1f(long int, long int, long int) -->
        <function-decl name='mapmesh1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapmesh1fElll' filepath='libnurbs/interface/glcurveval.cc' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <!-- void OpenGLCurveEvaluator::evalcoord1f(long int, REAL) -->
        <function-decl name='evalcoord1f' mangled-name='_ZN20OpenGLCurveEvaluator11evalcoord1fElf' filepath='libnurbs/interface/glcurveval.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <!-- void OpenGLCurveEvaluator::endmap1f() -->
        <function-decl name='endmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8endmap1fEv' filepath='libnurbs/interface/glcurveval.cc' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <!-- void OpenGLCurveEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN20OpenGLCurveEvaluator7bgnlineEv' filepath='libnurbs/interface/glcurveval.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <!-- void OpenGLCurveEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN20OpenGLCurveEvaluator7endlineEv' filepath='libnurbs/interface/glcurveval.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct BasicCurveEvaluator -->
    <class-decl name='BasicCurveEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/internals/basiccrveval.h' line='43' column='1' is-declaration-only='yes' id='22b18ed5'>
      <!-- class CachingEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='98511c0f'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <!-- BasicCurveEvaluator::~BasicCurveEvaluator(int) -->
        <function-decl name='~BasicCurveEvaluator' filepath='libnurbs/internals/basiccrveval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <!-- void BasicCurveEvaluator::domain1f(REAL, REAL) -->
        <function-decl name='domain1f' mangled-name='_ZN19BasicCurveEvaluator8domain1fEff' filepath='libnurbs/internals/basiccrveval.cc' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <!-- void BasicCurveEvaluator::range1f(long int, REAL*, REAL*) -->
        <function-decl name='range1f' mangled-name='_ZN19BasicCurveEvaluator7range1fElPfS0_' filepath='libnurbs/internals/basiccrveval.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <!-- void BasicCurveEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN19BasicCurveEvaluator6enableEl' filepath='libnurbs/internals/basiccrveval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <!-- void BasicCurveEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN19BasicCurveEvaluator7disableEl' filepath='libnurbs/internals/basiccrveval.cc' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <!-- void BasicCurveEvaluator::bgnmap1f(long int) -->
        <function-decl name='bgnmap1f' mangled-name='_ZN19BasicCurveEvaluator8bgnmap1fEl' filepath='libnurbs/internals/basiccrveval.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <!-- void BasicCurveEvaluator::map1f(long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map1f' mangled-name='_ZN19BasicCurveEvaluator5map1fElffllPf' filepath='libnurbs/internals/basiccrveval.cc' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <!-- void BasicCurveEvaluator::mapgrid1f(long int, REAL, REAL) -->
        <function-decl name='mapgrid1f' mangled-name='_ZN19BasicCurveEvaluator9mapgrid1fElff' filepath='libnurbs/internals/basiccrveval.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <!-- void BasicCurveEvaluator::mapmesh1f(long int, long int, long int) -->
        <function-decl name='mapmesh1f' mangled-name='_ZN19BasicCurveEvaluator9mapmesh1fElll' filepath='libnurbs/internals/basiccrveval.cc' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <!-- void BasicCurveEvaluator::evalcoord1f(long int, REAL) -->
        <function-decl name='evalcoord1f' mangled-name='_ZN19BasicCurveEvaluator11evalcoord1fElf' filepath='libnurbs/internals/basiccrveval.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <!-- void BasicCurveEvaluator::endmap1f() -->
        <function-decl name='endmap1f' mangled-name='_ZN19BasicCurveEvaluator8endmap1fEv' filepath='libnurbs/internals/basiccrveval.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <!-- void BasicCurveEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN19BasicCurveEvaluator7bgnlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <!-- void BasicCurveEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN19BasicCurveEvaluator7endlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- void () -->
    <function-type size-in-bits='64' id='ee076206'>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (const GLfloat*) -->
    <function-type size-in-bits='64' id='6485bd28'>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='d476845b'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (const GLfloat*, void*) -->
    <function-type size-in-bits='64' id='f267cc92'>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='d476845b'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (GLenum) -->
    <function-type size-in-bits='64' id='4ba07ef3'>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='055aa60e'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (GLenum, void*) -->
    <function-type size-in-bits='64' id='2b48a6c7'>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='055aa60e'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
    <!-- void (void*) -->
    <function-type size-in-bits='64' id='c5c76c9c'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glinterface.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- unsigned char -->
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <!-- typedef unsigned char GLboolean -->
    <typedef-decl name='GLboolean' type-id='002ac4a6' filepath='../../../include/GL/gl.h' line='150' column='1' id='e482d915'/>
    <!-- typedef int GLint -->
    <typedef-decl name='GLint' type-id='95e97e5e' filepath='../../../include/GL/gl.h' line='155' column='1' id='82e13008'/>
    <!-- struct GLUnurbs -->
    <class-decl name='GLUnurbs' size-in-bits='1149440' is-struct='yes' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='49' column='1' id='e83497bd'>
      <!-- class NurbsTessellator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='5c7cffcb'/>
      <data-member access='public' layout-offset-in-bits='47616'>
        <!-- errorCallbackType GLUnurbs::errorCallback -->
        <var-decl name='errorCallback' type-id='c68de275' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='71' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47680'>
        <!-- GLboolean GLUnurbs::autoloadmode -->
        <var-decl name='autoloadmode' type-id='e482d915' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47744'>
        <!-- OpenGLSurfaceEvaluator GLUnurbs::surfaceEvaluator -->
        <var-decl name='surfaceEvaluator' type-id='98206f26' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1121792'>
        <!-- OpenGLCurveEvaluator GLUnurbs::curveEvaluator -->
        <var-decl name='curveEvaluator' type-id='8d4b0ae2' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1149376'>
        <!-- int GLUnurbs::callbackFlag -->
        <var-decl name='callbackFlag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='143' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- GLUnurbs::GLUnurbs() -->
        <function-decl name='GLUnurbs' filepath='libnurbs/interface/glrenderer.cc' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <!-- void GLUnurbs::bgnrender() -->
        <function-decl name='bgnrender' mangled-name='_ZN8GLUnurbs9bgnrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <!-- void GLUnurbs::endrender() -->
        <function-decl name='endrender' mangled-name='_ZN8GLUnurbs9endrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <!-- void GLUnurbs::errorHandler(int) -->
        <function-decl name='errorHandler' mangled-name='_ZN8GLUnurbs12errorHandlerEi' filepath='libnurbs/interface/glrenderer.cc' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- GLUnurbs* -->
    <pointer-type-def type-id='e83497bd' size-in-bits='64' id='129fea6d'/>
    <!-- GLUnurbs* const -->
    <qualified-type-def type-id='129fea6d' const='yes' id='cdfd88c2'/>
    <!-- GLfloat* -->
    <pointer-type-def type-id='46496ee3' size-in-bits='64' id='5d68ba5a'/>
    <!-- OpenGLSurfaceEvaluator* -->
    <pointer-type-def type-id='98206f26' size-in-bits='64' id='a8b7100c'/>
    <!-- OpenGLSurfaceEvaluator* const -->
    <qualified-type-def type-id='a8b7100c' const='yes' id='39c23eb7'/>
    <!-- const GLint -->
    <qualified-type-def type-id='82e13008' const='yes' id='9173a858'/>
    <!-- const GLint* -->
    <pointer-type-def type-id='9173a858' size-in-bits='64' id='6b122b76'/>
    <!-- float* -->
    <pointer-type-def type-id='a6c45d85' size-in-bits='64' id='361f7a7d'/>
    <!-- GLUnurbs* gluNewNurbsRenderer() -->
    <function-decl name='gluNewNurbsRenderer' mangled-name='gluNewNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNewNurbsRenderer'>
      <!-- GLUnurbs* -->
      <return type-id='129fea6d'/>
    </function-decl>
    <!-- void gluDeleteNurbsRenderer(GLUnurbs*) -->
    <function-decl name='gluDeleteNurbsRenderer' mangled-name='gluDeleteNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluDeleteNurbsRenderer'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluBeginSurface(GLUnurbs*) -->
    <function-decl name='gluBeginSurface' mangled-name='gluBeginSurface' filepath='libnurbs/interface/glinterface.cc' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginSurface'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluBeginCurve(GLUnurbs*) -->
    <function-decl name='gluBeginCurve' mangled-name='gluBeginCurve' filepath='libnurbs/interface/glinterface.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginCurve'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluEndCurve(GLUnurbs*) -->
    <function-decl name='gluEndCurve' mangled-name='gluEndCurve' filepath='libnurbs/interface/glinterface.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndCurve'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluEndSurface(GLUnurbs*) -->
    <function-decl name='gluEndSurface' mangled-name='gluEndSurface' filepath='libnurbs/interface/glinterface.cc' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndSurface'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluBeginTrim(GLUnurbs*) -->
    <function-decl name='gluBeginTrim' mangled-name='gluBeginTrim' filepath='libnurbs/interface/glinterface.cc' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginTrim'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluEndTrim(GLUnurbs*) -->
    <function-decl name='gluEndTrim' mangled-name='gluEndTrim' filepath='libnurbs/interface/glinterface.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndTrim'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluPwlCurve(GLUnurbs*, GLint, float*, GLint, GLenum) -->
    <function-decl name='gluPwlCurve' mangled-name='gluPwlCurve' filepath='libnurbs/interface/glinterface.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluPwlCurve'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='count' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <!-- parameter of type 'float*' -->
      <parameter type-id='361f7a7d' name='array' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='stride' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='055aa60e' name='type' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluNurbsCurve(GLUnurbs*, GLint, float*, GLint, float*, GLint, GLenum) -->
    <function-decl name='gluNurbsCurve' mangled-name='gluNurbsCurve' filepath='libnurbs/interface/glinterface.cc' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCurve'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='nknots' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'float*' -->
      <parameter type-id='361f7a7d' name='knot' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='stride' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'float*' -->
      <parameter type-id='361f7a7d' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='order' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='055aa60e' name='type' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluNurbsSurface(GLUnurbs*, GLint, GLfloat*, GLint, GLfloat*, GLint, GLint, GLfloat*, GLint, GLint, GLenum) -->
    <function-decl name='gluNurbsSurface' mangled-name='gluNurbsSurface' filepath='libnurbs/interface/glinterface.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsSurface'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='sknot_count' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='5d68ba5a' name='sknot' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='tknot_count' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='5d68ba5a' name='tknot' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='s_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='t_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='5d68ba5a' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='sorder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='82e13008' name='torder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='055aa60e' name='type' filepath='libnurbs/interface/glinterface.cc' line='203' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluLoadSamplingMatrices(GLUnurbs*, const GLfloat*, const GLfloat*, const GLint*) -->
    <function-decl name='gluLoadSamplingMatrices' mangled-name='gluLoadSamplingMatrices' filepath='libnurbs/interface/glinterface.cc' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluLoadSamplingMatrices'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='d476845b' name='modelMatrix' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='d476845b' name='projMatrix' filepath='libnurbs/interface/glinterface.cc' line='236' column='1'/>
      <!-- parameter of type 'const GLint*' -->
      <parameter type-id='6b122b76' name='viewport' filepath='libnurbs/interface/glinterface.cc' line='237' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluNurbsProperty(GLUnurbs*, GLenum, GLfloat) -->
    <function-decl name='gluNurbsProperty' mangled-name='gluNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsProperty'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='055aa60e' name='property' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <!-- parameter of type 'typedef GLfloat' -->
      <parameter type-id='46496ee3' name='value' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluGetNurbsProperty(GLUnurbs*, GLenum, GLfloat*) -->
    <function-decl name='gluGetNurbsProperty' mangled-name='gluGetNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluGetNurbsProperty'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='055aa60e' name='property' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='5d68ba5a' name='value' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluNurbsCallback(GLUnurbs*, GLenum, _GLUfuncptr) -->
    <function-decl name='gluNurbsCallback' mangled-name='gluNurbsCallback' filepath='libnurbs/interface/glinterface.cc' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallback'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='055aa60e' name='which' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <!-- parameter of type 'typedef _GLUfuncptr' -->
      <parameter type-id='9fac4a53' name='fn' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluNurbsCallbackDataEXT(GLUnurbs*, void*) -->
    <function-decl name='gluNurbsCallbackDataEXT' mangled-name='gluNurbsCallbackDataEXT' filepath='libnurbs/interface/glinterface.cc' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackDataEXT'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='userData' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- void gluNurbsCallbackData(GLUnurbs*, void*) -->
    <function-decl name='gluNurbsCallbackData' mangled-name='gluNurbsCallbackData' filepath='libnurbs/interface/glinterface.cc' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackData'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f' name='userData' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-decl>
    <!-- struct OpenGLSurfaceEvaluator -->
    <class-decl name='OpenGLSurfaceEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='100' column='1' is-declaration-only='yes' id='98206f26'>
      <!-- struct BasicSurfaceEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='f37336ad'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- StoredVertex* OpenGLSurfaceEvaluator::vertexCache[3] -->
        <var-decl name='vertexCache' type-id='25b51a5f' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='180' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- int OpenGLSurfaceEvaluator::tmeshing -->
        <var-decl name='tmeshing' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='181' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <!-- int OpenGLSurfaceEvaluator::which -->
        <var-decl name='which' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='182' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- int OpenGLSurfaceEvaluator::vcount -->
        <var-decl name='vcount' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='183' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <!-- GLint OpenGLSurfaceEvaluator::gl_polygon_mode[2] -->
        <var-decl name='gl_polygon_mode' type-id='89ff3d35' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='185' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <!-- bezierPatchMesh* OpenGLSurfaceEvaluator::global_bpm -->
        <var-decl name='global_bpm' type-id='8b4ddf21' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <!-- int OpenGLSurfaceEvaluator::output_triangles -->
        <var-decl name='output_triangles' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- void (typedef GLenum)* OpenGLSurfaceEvaluator::beginCallBackN -->
        <var-decl name='beginCallBackN' type-id='30135957' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <!-- void ()* OpenGLSurfaceEvaluator::endCallBackN -->
        <var-decl name='endCallBackN' type-id='953b12f8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <!-- void (const GLfloat*)* OpenGLSurfaceEvaluator::vertexCallBackN -->
        <var-decl name='vertexCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <!-- void (const GLfloat*)* OpenGLSurfaceEvaluator::normalCallBackN -->
        <var-decl name='normalCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <!-- void (const GLfloat*)* OpenGLSurfaceEvaluator::colorCallBackN -->
        <var-decl name='colorCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <!-- void (const GLfloat*)* OpenGLSurfaceEvaluator::texcoordCallBackN -->
        <var-decl name='texcoordCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <!-- void (typedef GLenum, void*)* OpenGLSurfaceEvaluator::beginCallBackData -->
        <var-decl name='beginCallBackData' type-id='5f8a287b' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='200' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1024'>
        <!-- void (void*)* OpenGLSurfaceEvaluator::endCallBackData -->
        <var-decl name='endCallBackData' type-id='b7f9d8e6' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='201' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <!-- void (const GLfloat*, void*)* OpenGLSurfaceEvaluator::vertexCallBackData -->
        <var-decl name='vertexCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <!-- void (const GLfloat*, void*)* OpenGLSurfaceEvaluator::normalCallBackData -->
        <var-decl name='normalCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <!-- void (const GLfloat*, void*)* OpenGLSurfaceEvaluator::colorCallBackData -->
        <var-decl name='colorCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='204' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <!-- void (const GLfloat*, void*)* OpenGLSurfaceEvaluator::texcoordCallBackData -->
        <var-decl name='texcoordCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='205' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <!-- void* OpenGLSurfaceEvaluator::userData -->
        <var-decl name='userData' type-id='eaa32e2f' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <!-- int OpenGLSurfaceEvaluator::LOD_eval_level -->
        <var-decl name='LOD_eval_level' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1440'>
        <!-- int OpenGLSurfaceEvaluator::global_uorder -->
        <var-decl name='global_uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='231' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <!-- int OpenGLSurfaceEvaluator::global_vorder -->
        <var-decl name='global_vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1504'>
        <!-- REAL OpenGLSurfaceEvaluator::global_uprime -->
        <var-decl name='global_uprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='233' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vprime -->
        <var-decl name='global_vprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='234' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1568'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vprime_BV -->
        <var-decl name='global_vprime_BV' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='235' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <!-- REAL OpenGLSurfaceEvaluator::global_uprime_BU -->
        <var-decl name='global_uprime_BU' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1632'>
        <!-- int OpenGLSurfaceEvaluator::global_uorder_BV -->
        <var-decl name='global_uorder_BV' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <!-- int OpenGLSurfaceEvaluator::global_vorder_BV -->
        <var-decl name='global_vorder_BV' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='238' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1696'>
        <!-- int OpenGLSurfaceEvaluator::global_uorder_BU -->
        <var-decl name='global_uorder_BU' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='239' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <!-- int OpenGLSurfaceEvaluator::global_vorder_BU -->
        <var-decl name='global_vorder_BU' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='240' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1760'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ucoeff[40] -->
        <var-decl name='global_ucoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3040'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vcoeff[40] -->
        <var-decl name='global_vcoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='243' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4320'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ucoeffDeriv[40] -->
        <var-decl name='global_ucoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='244' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5600'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vcoeffDeriv[40] -->
        <var-decl name='global_vcoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6880'>
        <!-- REAL OpenGLSurfaceEvaluator::global_BV[40][4] -->
        <var-decl name='global_BV' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='247' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='12000'>
        <!-- REAL OpenGLSurfaceEvaluator::global_PBV[40][4] -->
        <var-decl name='global_PBV' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='248' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='17120'>
        <!-- REAL OpenGLSurfaceEvaluator::global_BU[40][4] -->
        <var-decl name='global_BU' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='249' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='22240'>
        <!-- REAL OpenGLSurfaceEvaluator::global_PBU[40][4] -->
        <var-decl name='global_PBU' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='250' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <!-- REAL* OpenGLSurfaceEvaluator::global_baseData -->
        <var-decl name='global_baseData' type-id='c0eda015' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_k -->
        <var-decl name='global_ev_k' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='253' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27488'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_u1 -->
        <var-decl name='global_ev_u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='254' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_u2 -->
        <var-decl name='global_ev_u2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='255' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27552'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_ustride -->
        <var-decl name='global_ev_ustride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='256' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27584'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_uorder -->
        <var-decl name='global_ev_uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='257' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27616'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_v1 -->
        <var-decl name='global_ev_v1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='258' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27648'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_v2 -->
        <var-decl name='global_ev_v2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='259' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27680'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_vstride -->
        <var-decl name='global_ev_vstride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='260' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27712'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_vorder -->
        <var-decl name='global_ev_vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='261' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27744'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_ctlPoints[6400] -->
        <var-decl name='global_ev_ctlPoints' type-id='65bb74af' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='262' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232544'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_u0 -->
        <var-decl name='global_grid_u0' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='264' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232576'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_u1 -->
        <var-decl name='global_grid_u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='265' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232608'>
        <!-- int OpenGLSurfaceEvaluator::global_grid_nu -->
        <var-decl name='global_grid_nu' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='266' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232640'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_v0 -->
        <var-decl name='global_grid_v0' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='267' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232672'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_v1 -->
        <var-decl name='global_grid_v1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='268' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232704'>
        <!-- int OpenGLSurfaceEvaluator::global_grid_nv -->
        <var-decl name='global_grid_nv' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='269' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232736'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_vertex -->
        <var-decl name='em_vertex' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='349' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='443008'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_normal -->
        <var-decl name='em_normal' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='350' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='653280'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_color -->
        <var-decl name='em_color' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='351' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='863552'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_texcoord -->
        <var-decl name='em_texcoord' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073824'>
        <!-- int OpenGLSurfaceEvaluator::auto_normal_flag -->
        <var-decl name='auto_normal_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='354' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073856'>
        <!-- int OpenGLSurfaceEvaluator::callback_auto_normal -->
        <var-decl name='callback_auto_normal' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='356' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073888'>
        <!-- int OpenGLSurfaceEvaluator::vertex_flag -->
        <var-decl name='vertex_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073920'>
        <!-- int OpenGLSurfaceEvaluator::normal_flag -->
        <var-decl name='normal_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073952'>
        <!-- int OpenGLSurfaceEvaluator::color_flag -->
        <var-decl name='color_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073984'>
        <!-- int OpenGLSurfaceEvaluator::texcoord_flag -->
        <var-decl name='texcoord_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='360' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- OpenGLSurfaceEvaluator::OpenGLSurfaceEvaluator() -->
        <function-decl name='OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <!-- OpenGLSurfaceEvaluator::~OpenGLSurfaceEvaluator(int) -->
        <function-decl name='~OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <!-- void OpenGLSurfaceEvaluator::range2f(long int, REAL*, REAL*) -->
        <function-decl name='range2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/interface/glsurfeval.cc' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <!-- void OpenGLSurfaceEvaluator::domain2f(REAL, REAL, REAL, REAL) -->
        <function-decl name='domain2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8domain2fEffff' filepath='libnurbs/interface/glsurfeval.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <!-- void OpenGLSurfaceEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN22OpenGLSurfaceEvaluator6enableEl' filepath='libnurbs/interface/glsurfeval.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <!-- void OpenGLSurfaceEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN22OpenGLSurfaceEvaluator7disableEl' filepath='libnurbs/interface/glsurfeval.cc' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <!-- void OpenGLSurfaceEvaluator::bgnmap2f(long int) -->
        <function-decl name='bgnmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/interface/glsurfeval.cc' line='739' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <!-- void OpenGLSurfaceEvaluator::map2f(long int, REAL, REAL, long int, long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map2f' mangled-name='_ZN22OpenGLSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/interface/glsurfeval.cc' line='872' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <!-- void OpenGLSurfaceEvaluator::mapgrid2f(long int, REAL, REAL, long int, REAL, REAL) -->
        <function-decl name='mapgrid2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/interface/glsurfeval.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <!-- void OpenGLSurfaceEvaluator::mapmesh2f(long int, long int, long int, long int, long int) -->
        <function-decl name='mapmesh2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/interface/glsurfeval.cc' line='946' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <!-- void OpenGLSurfaceEvaluator::evalcoord2f(long int, REAL, REAL) -->
        <function-decl name='evalcoord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/interface/glsurfeval.cc' line='1042' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <!-- void OpenGLSurfaceEvaluator::evalpoint2i(long int, long int) -->
        <function-decl name='evalpoint2i' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/interface/glsurfeval.cc' line='1059' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <!-- void OpenGLSurfaceEvaluator::endmap2f() -->
        <function-decl name='endmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8endmap2fEv' filepath='libnurbs/interface/glsurfeval.cc' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <!-- void OpenGLSurfaceEvaluator::polymode(long int) -->
        <function-decl name='polymode' mangled-name='_ZN22OpenGLSurfaceEvaluator8polymodeEl' filepath='libnurbs/interface/glsurfeval.cc' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <!-- void OpenGLSurfaceEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgnlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <!-- void OpenGLSurfaceEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN22OpenGLSurfaceEvaluator7endlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <!-- void OpenGLSurfaceEvaluator::bgnclosedline() -->
        <function-decl name='bgnclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <!-- void OpenGLSurfaceEvaluator::endclosedline() -->
        <function-decl name='endclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <!-- void OpenGLSurfaceEvaluator::bgntmesh() -->
        <function-decl name='bgntmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <!-- void OpenGLSurfaceEvaluator::swaptmesh() -->
        <function-decl name='swaptmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <!-- void OpenGLSurfaceEvaluator::endtmesh() -->
        <function-decl name='endtmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8endtmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <!-- void OpenGLSurfaceEvaluator::bgnqstrip() -->
        <function-decl name='bgnqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='712' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <!-- void OpenGLSurfaceEvaluator::endqstrip() -->
        <function-decl name='endqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9endqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='725' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <!-- void OpenGLSurfaceEvaluator::bgntfan() -->
        <function-decl name='bgntfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgntfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <!-- void OpenGLSurfaceEvaluator::endtfan() -->
        <function-decl name='endtfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7endtfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <!-- void OpenGLSurfaceEvaluator::evalUStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalUStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <!-- void OpenGLSurfaceEvaluator::evalVStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalVStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='530' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2NOGE(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN22OpenGLSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2NOGE_BU(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2NOGE_BV(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluateBV_intfac(REAL) -->
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluateBU_intfac(REAL) -->
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='321' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glrenderer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- GLfloat[4] -->
    <array-type-def dimensions='1' type-id='46496ee3' size-in-bits='128' id='d68dc862'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <!-- typedef void (typedef GLenum)* errorCallbackType -->
    <typedef-decl name='errorCallbackType' type-id='30135957' filepath='libnurbs/interface/glrenderer.h' line='46' column='1' id='c68de275'/>
    <!-- GLfloat[4]* -->
    <pointer-type-def type-id='d68dc862' size-in-bits='64' id='09324958'/>
    <!-- class NurbsTessellator -->
    <class-decl name='NurbsTessellator' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='53' column='1' is-declaration-only='yes' id='5c7cffcb'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <!-- Renderhints NurbsTessellator::renderhints -->
        <var-decl name='renderhints' type-id='14066291' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='104' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <!-- Maplist NurbsTessellator::maplist -->
        <var-decl name='maplist' type-id='90b97905' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='105' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3008'>
        <!-- Backend NurbsTessellator::backend -->
        <var-decl name='backend' type-id='8abb1ec7' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3648'>
        <!-- Subdivider NurbsTessellator::subdivider -->
        <var-decl name='subdivider' type-id='62291dde' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24064'>
        <!-- JumpBuffer* NurbsTessellator::jumpbuffer -->
        <var-decl name='jumpbuffer' type-id='0e86d3eb' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24128'>
        <!-- Pool NurbsTessellator::o_pwlcurvePool -->
        <var-decl name='o_pwlcurvePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <!-- Pool NurbsTessellator::o_nurbscurvePool -->
        <var-decl name='o_nurbscurvePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='29120'>
        <!-- Pool NurbsTessellator::o_curvePool -->
        <var-decl name='o_curvePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='31616'>
        <!-- Pool NurbsTessellator::o_trimPool -->
        <var-decl name='o_trimPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='34112'>
        <!-- Pool NurbsTessellator::o_surfacePool -->
        <var-decl name='o_surfacePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='36608'>
        <!-- Pool NurbsTessellator::o_nurbssurfacePool -->
        <var-decl name='o_nurbssurfacePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='39104'>
        <!-- Pool NurbsTessellator::propertyPool -->
        <var-decl name='propertyPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='41600'>
        <!-- Pool NurbsTessellator::quiltPool -->
        <var-decl name='quiltPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='44096'>
        <!-- TrimVertexPool NurbsTessellator::extTrimVertexPool -->
        <var-decl name='extTrimVertexPool' type-id='95c1e8c1' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46720'>
        <!-- int NurbsTessellator::inSurface -->
        <var-decl name='inSurface' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='148' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46752'>
        <!-- int NurbsTessellator::inCurve -->
        <var-decl name='inCurve' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='149' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46784'>
        <!-- int NurbsTessellator::inTrim -->
        <var-decl name='inTrim' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46816'>
        <!-- int NurbsTessellator::isCurveModified -->
        <var-decl name='isCurveModified' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='151' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46848'>
        <!-- int NurbsTessellator::isTrimModified -->
        <var-decl name='isTrimModified' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='152' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46880'>
        <!-- int NurbsTessellator::isSurfaceModified -->
        <var-decl name='isSurfaceModified' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46912'>
        <!-- int NurbsTessellator::isDataValid -->
        <var-decl name='isDataValid' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46944'>
        <!-- int NurbsTessellator::numTrims -->
        <var-decl name='numTrims' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='155' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46976'>
        <!-- int NurbsTessellator::playBack -->
        <var-decl name='playBack' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='156' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47040'>
        <!-- O_trim** NurbsTessellator::nextTrim -->
        <var-decl name='nextTrim' type-id='9b0953ab' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='158' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47104'>
        <!-- O_curve** NurbsTessellator::nextCurve -->
        <var-decl name='nextCurve' type-id='051d3536' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47168'>
        <!-- O_nurbscurve** NurbsTessellator::nextNurbscurve -->
        <var-decl name='nextNurbscurve' type-id='8cd6e64e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47232'>
        <!-- O_pwlcurve** NurbsTessellator::nextPwlcurve -->
        <var-decl name='nextPwlcurve' type-id='5877a025' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='161' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47296'>
        <!-- O_nurbssurface** NurbsTessellator::nextNurbssurface -->
        <var-decl name='nextNurbssurface' type-id='6597deda' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47360'>
        <!-- O_surface* NurbsTessellator::currentSurface -->
        <var-decl name='currentSurface' type-id='1d8fd45c' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='164' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47424'>
        <!-- O_trim* NurbsTessellator::currentTrim -->
        <var-decl name='currentTrim' type-id='bc1314a3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='165' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47488'>
        <!-- O_curve* NurbsTessellator::currentCurve -->
        <var-decl name='currentCurve' type-id='75b98f98' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='166' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47552'>
        <!-- DisplayList* NurbsTessellator::dl -->
        <var-decl name='dl' type-id='7f27e761' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='168' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- NurbsTessellator::NurbsTessellator(BasicCurveEvaluator&, BasicSurfaceEvaluator&) -->
        <function-decl name='NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <!-- parameter of type 'BasicCurveEvaluator&' -->
          <parameter type-id='15a0d7b1'/>
          <!-- parameter of type 'BasicSurfaceEvaluator&' -->
          <parameter type-id='e2ef5a99'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- NurbsTessellator::~NurbsTessellator(int) -->
        <function-decl name='~NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <!-- void NurbsTessellator::bgnrender() -->
        <function-decl name='bgnrender' mangled-name='_ZN16NurbsTessellator9bgnrenderEv' filepath='libnurbs/internals/nurbstess.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <!-- void NurbsTessellator::endrender() -->
        <function-decl name='endrender' mangled-name='_ZN16NurbsTessellator9endrenderEv' filepath='libnurbs/internals/nurbstess.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <!-- void NurbsTessellator::makeobj(int) -->
        <function-decl name='makeobj' mangled-name='_ZN16NurbsTessellator7makeobjEi' filepath='libnurbs/internals/nurbstess.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <!-- void NurbsTessellator::closeobj() -->
        <function-decl name='closeobj' mangled-name='_ZN16NurbsTessellator8closeobjEv' filepath='libnurbs/internals/nurbstess.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <!-- void NurbsTessellator::errorHandler(int) -->
        <function-decl name='errorHandler' mangled-name='_ZN16NurbsTessellator12errorHandlerEi' filepath='libnurbs/internals/nurbstess.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glsurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- GLint[2] -->
    <array-type-def dimensions='1' type-id='82e13008' size-in-bits='64' id='89ff3d35'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- REAL[2] -->
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='64' id='5df3d5e7'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- REAL[3] -->
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='96' id='61f61aca'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <!-- REAL[40][4] -->
    <array-type-def dimensions='2' type-id='234bc418' size-in-bits='5120' id='f343e529'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <!-- REAL[6400] -->
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='204800' id='65bb74af'>
      <!-- <anonymous range>[6400] -->
      <subrange length='6400' type-id='7359adad' id='9685bc87'/>
    </array-type-def>
    <!-- StoredVertex*[3] -->
    <array-type-def dimensions='1' type-id='861154a2' size-in-bits='192' id='25b51a5f'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <!-- long int[2] -->
    <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='128' id='6136feaa'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- struct bezierPatch -->
    <class-decl name='bezierPatch' size-in-bits='384' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='36' column='1' id='d9a4bc34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- float bezierPatch::umin -->
        <var-decl name='umin' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- float bezierPatch::vmin -->
        <var-decl name='vmin' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- float bezierPatch::umax -->
        <var-decl name='umax' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- float bezierPatch::vmax -->
        <var-decl name='vmax' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int bezierPatch::uorder -->
        <var-decl name='uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int bezierPatch::vorder -->
        <var-decl name='vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int bezierPatch::dimension -->
        <var-decl name='dimension' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- float* bezierPatch::ctlpoints -->
        <var-decl name='ctlpoints' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- bezierPatch* bezierPatch::next -->
        <var-decl name='next' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef bezierPatch bezierPatch -->
    <typedef-decl name='bezierPatch' type-id='d9a4bc34' filepath='libnurbs/interface/bezierPatch.h' line='65' column='1' id='56988107'/>
    <!-- struct bezierPatchMesh -->
    <class-decl name='bezierPatchMesh' size-in-bits='960' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='39' column='1' id='2b73b139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- bezierPatch* bezierPatchMesh::bpatch -->
        <var-decl name='bpatch' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- bezierPatch* bezierPatchMesh::bpatch_normal -->
        <var-decl name='bpatch_normal' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- bezierPatch* bezierPatchMesh::bpatch_texcoord -->
        <var-decl name='bpatch_texcoord' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- bezierPatch* bezierPatchMesh::bpatch_color -->
        <var-decl name='bpatch_color' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- float* bezierPatchMesh::UVarray -->
        <var-decl name='UVarray' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int* bezierPatchMesh::length_array -->
        <var-decl name='length_array' type-id='7292109c' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- GLenum* bezierPatchMesh::type_array -->
        <var-decl name='type_array' type-id='157c88ff' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int bezierPatchMesh::size_UVarray -->
        <var-decl name='size_UVarray' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- int bezierPatchMesh::index_UVarray -->
        <var-decl name='index_UVarray' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int bezierPatchMesh::size_length_array -->
        <var-decl name='size_length_array' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- int bezierPatchMesh::index_length_array -->
        <var-decl name='index_length_array' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- int bezierPatchMesh::counter -->
        <var-decl name='counter' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- GLenum bezierPatchMesh::type -->
        <var-decl name='type' type-id='055aa60e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- float* bezierPatchMesh::vertex_array -->
        <var-decl name='vertex_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- float* bezierPatchMesh::normal_array -->
        <var-decl name='normal_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- float* bezierPatchMesh::color_array -->
        <var-decl name='color_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- float* bezierPatchMesh::texcoord_array -->
        <var-decl name='texcoord_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- bezierPatchMesh* bezierPatchMesh::next -->
        <var-decl name='next' type-id='8b4ddf21' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef bezierPatchMesh bezierPatchMesh -->
    <typedef-decl name='bezierPatchMesh' type-id='2b73b139' filepath='libnurbs/interface/bezierPatchMesh.h' line='66' column='1' id='bc89f3ba'/>
    <!-- struct surfEvalMachine -->
    <class-decl name='surfEvalMachine' size-in-bits='210272' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='63' column='1' id='30d622a0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL surfEvalMachine::uprime -->
        <var-decl name='uprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- REAL surfEvalMachine::vprime -->
        <var-decl name='vprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int surfEvalMachine::k -->
        <var-decl name='k' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL surfEvalMachine::u1 -->
        <var-decl name='u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- REAL surfEvalMachine::u2 -->
        <var-decl name='u2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int surfEvalMachine::ustride -->
        <var-decl name='ustride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int surfEvalMachine::uorder -->
        <var-decl name='uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- REAL surfEvalMachine::v1 -->
        <var-decl name='v1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- REAL surfEvalMachine::v2 -->
        <var-decl name='v2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- int surfEvalMachine::vstride -->
        <var-decl name='vstride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int surfEvalMachine::vorder -->
        <var-decl name='vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- REAL surfEvalMachine::ctlPoints[6400] -->
        <var-decl name='ctlPoints' type-id='65bb74af' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='205152'>
        <!-- REAL surfEvalMachine::ucoeff[40] -->
        <var-decl name='ucoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='206432'>
        <!-- REAL surfEvalMachine::vcoeff[40] -->
        <var-decl name='vcoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='207712'>
        <!-- REAL surfEvalMachine::ucoeffDeriv[40] -->
        <var-decl name='ucoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208992'>
        <!-- REAL surfEvalMachine::vcoeffDeriv[40] -->
        <var-decl name='vcoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef surfEvalMachine surfEvalMachine -->
    <typedef-decl name='surfEvalMachine' type-id='30d622a0' filepath='libnurbs/interface/glsurfeval.h' line='80' column='1' id='a83411a7'/>
    <!-- class StoredVertex -->
    <class-decl name='StoredVertex' size-in-bits='256' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='84' column='1' id='5c601ee4'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- int StoredVertex::type -->
        <var-decl name='type' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <!-- REAL StoredVertex::coord[2] -->
        <var-decl name='coord' type-id='5df3d5e7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='96' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- long int StoredVertex::point[2] -->
        <var-decl name='point' type-id='6136feaa' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='97' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- StoredVertex::StoredVertex() -->
        <function-decl name='StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'StoredVertex*' -->
          <parameter type-id='861154a2' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- StoredVertex::~StoredVertex(int) -->
        <function-decl name='~StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'StoredVertex*' -->
          <parameter type-id='861154a2' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- BasicSurfaceEvaluator* -->
    <pointer-type-def type-id='f37336ad' size-in-bits='64' id='eeef6d7d'/>
    <!-- GLenum* -->
    <pointer-type-def type-id='055aa60e' size-in-bits='64' id='157c88ff'/>
    <!-- REAL[3]* -->
    <pointer-type-def type-id='61f61aca' size-in-bits='64' id='166c4ea0'/>
    <!-- StoredVertex* -->
    <pointer-type-def type-id='5c601ee4' size-in-bits='64' id='861154a2'/>
    <!-- StoredVertex* const -->
    <qualified-type-def type-id='861154a2' const='yes' id='555b5dad'/>
    <!-- SurfaceMap* -->
    <pointer-type-def type-id='c260421a' size-in-bits='64' id='643ec8f8'/>
    <!-- bezierPatch* -->
    <pointer-type-def type-id='d9a4bc34' size-in-bits='64' id='4dcc1bd2'/>
    <!-- bezierPatchMesh* -->
    <pointer-type-def type-id='2b73b139' size-in-bits='64' id='8b4ddf21'/>
    <!-- int* -->
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <!-- surfEvalMachine* -->
    <pointer-type-def type-id='a83411a7' size-in-bits='64' id='6a947bf6'/>
    <!-- struct SurfaceMap -->
    <class-decl name='SurfaceMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='c260421a'/>
    <!-- struct BasicSurfaceEvaluator -->
    <class-decl name='BasicSurfaceEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/internals/basicsurfeval.h' line='43' column='1' is-declaration-only='yes' id='f37336ad'>
      <!-- class CachingEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='98511c0f'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <!-- BasicSurfaceEvaluator::~BasicSurfaceEvaluator(int) -->
        <function-decl name='~BasicSurfaceEvaluator' filepath='libnurbs/internals/basicsurfeval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <!-- void BasicSurfaceEvaluator::range2f(long int, REAL*, REAL*) -->
        <function-decl name='range2f' mangled-name='_ZN21BasicSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/internals/basicsurfeval.cc' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <!-- void BasicSurfaceEvaluator::domain2f(REAL, REAL, REAL, REAL) -->
        <function-decl name='domain2f' mangled-name='_ZN21BasicSurfaceEvaluator8domain2fEffff' filepath='libnurbs/internals/basicsurfeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <!-- void BasicSurfaceEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN21BasicSurfaceEvaluator6enableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <!-- void BasicSurfaceEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN21BasicSurfaceEvaluator7disableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <!-- void BasicSurfaceEvaluator::bgnmap2f(long int) -->
        <function-decl name='bgnmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/internals/basicsurfeval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <!-- void BasicSurfaceEvaluator::map2f(long int, REAL, REAL, long int, long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map2f' mangled-name='_ZN21BasicSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/internals/basicsurfeval.cc' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <!-- void BasicSurfaceEvaluator::mapgrid2f(long int, REAL, REAL, long int, REAL, REAL) -->
        <function-decl name='mapgrid2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/internals/basicsurfeval.cc' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <!-- void BasicSurfaceEvaluator::mapmesh2f(long int, long int, long int, long int, long int) -->
        <function-decl name='mapmesh2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/internals/basicsurfeval.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <!-- void BasicSurfaceEvaluator::evalcoord2f(long int, REAL, REAL) -->
        <function-decl name='evalcoord2f' mangled-name='_ZN21BasicSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/internals/basicsurfeval.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <!-- void BasicSurfaceEvaluator::evalpoint2i(long int, long int) -->
        <function-decl name='evalpoint2i' mangled-name='_ZN21BasicSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/internals/basicsurfeval.cc' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <!-- void BasicSurfaceEvaluator::endmap2f() -->
        <function-decl name='endmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8endmap2fEv' filepath='libnurbs/internals/basicsurfeval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <!-- void BasicSurfaceEvaluator::polymode(long int) -->
        <function-decl name='polymode' mangled-name='_ZN21BasicSurfaceEvaluator8polymodeEl' filepath='libnurbs/internals/basicsurfeval.cc' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <!-- void BasicSurfaceEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN21BasicSurfaceEvaluator7bgnlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <!-- void BasicSurfaceEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN21BasicSurfaceEvaluator7endlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <!-- void BasicSurfaceEvaluator::bgnclosedline() -->
        <function-decl name='bgnclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <!-- void BasicSurfaceEvaluator::endclosedline() -->
        <function-decl name='endclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <!-- void BasicSurfaceEvaluator::bgntmesh() -->
        <function-decl name='bgntmesh' mangled-name='_ZN21BasicSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <!-- void BasicSurfaceEvaluator::swaptmesh() -->
        <function-decl name='swaptmesh' mangled-name='_ZN21BasicSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <!-- void BasicSurfaceEvaluator::endtmesh() -->
        <function-decl name='endtmesh' mangled-name='_ZN21BasicSurfaceEvaluator8endtmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <!-- void BasicSurfaceEvaluator::bgnqstrip() -->
        <function-decl name='bgnqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <!-- void BasicSurfaceEvaluator::endqstrip() -->
        <function-decl name='endqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9endqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <!-- void BasicSurfaceEvaluator::bgntfan() -->
        <function-decl name='bgntfan' mangled-name='_ZN21BasicSurfaceEvaluator7bgntfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <!-- void BasicSurfaceEvaluator::endtfan() -->
        <function-decl name='endtfan' mangled-name='_ZN21BasicSurfaceEvaluator7endtfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <!-- void BasicSurfaceEvaluator::evalUStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalUStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <!-- void BasicSurfaceEvaluator::evalVStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalVStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='34'>
        <!-- void BasicSurfaceEvaluator::inDoEvalCoord2NOGE(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN21BasicSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='35'>
        <!-- void BasicSurfaceEvaluator::inDoEvalCoord2NOGE_BU(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='36'>
        <!-- void BasicSurfaceEvaluator::inDoEvalCoord2NOGE_BV(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='37'>
        <!-- void BasicSurfaceEvaluator::inPreEvaluateBV_intfac(REAL) -->
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='38'>
        <!-- void BasicSurfaceEvaluator::inPreEvaluateBU_intfac(REAL) -->
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/insurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <!-- char*[32] -->
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='2048' id='2e646d82'>
      <!-- <anonymous range>[32] -->
      <subrange length='32' type-id='7359adad' id='ae5bde82'/>
    </array-type-def>
    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='7359adad' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='b59d7dce'/>
    <!-- typedef Arc* Arc_ptr -->
    <typedef-decl name='Arc_ptr' type-id='70a74e83' filepath='libnurbs/internals/arc.h' line='50' column='1' id='c118b035'/>
    <!-- enum arc_side -->
    <enum-decl name='arc_side' filepath='libnurbs/internals/arc.h' line='52' column='1' id='45273cc6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='arc_none' value='0'/>
      <enumerator name='arc_right' value='1'/>
      <enumerator name='arc_top' value='2'/>
      <enumerator name='arc_left' value='3'/>
      <enumerator name='arc_bottom' value='4'/>
    </enum-decl>
    <!-- struct Arc -->
    <class-decl name='Arc' size-in-bits='448' is-struct='yes' visibility='default' filepath='libnurbs/internals/arc.h' line='55' column='1' id='e4a01a13'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' static='yes'>
        <!-- static const int Arc::bezier_tag -->
        <var-decl name='bezier_tag' type-id='2448a865' mangled-name='_ZN3Arc10bezier_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static const int Arc::arc_tag -->
        <var-decl name='arc_tag' type-id='2448a865' mangled-name='_ZN3Arc7arc_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static const int Arc::tail_tag -->
        <var-decl name='tail_tag' type-id='2448a865' mangled-name='_ZN3Arc8tail_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Arc_ptr Arc::prev -->
        <var-decl name='prev' type-id='c118b035' visibility='default' filepath='libnurbs/internals/arc.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Arc_ptr Arc::next -->
        <var-decl name='next' type-id='c118b035' visibility='default' filepath='libnurbs/internals/arc.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Arc_ptr Arc::link -->
        <var-decl name='link' type-id='c118b035' visibility='default' filepath='libnurbs/internals/arc.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- BezierArc* Arc::bezierArc -->
        <var-decl name='bezierArc' type-id='26518268' visibility='default' filepath='libnurbs/internals/arc.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- PwlArc* Arc::pwlArc -->
        <var-decl name='pwlArc' type-id='561d7e7a' visibility='default' filepath='libnurbs/internals/arc.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- long int Arc::type -->
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/arc.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- long int Arc::nuid -->
        <var-decl name='nuid' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/arc.h' line='67' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Arc::Arc(Arc*, PwlArc*) -->
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <!-- parameter of type 'Arc*' -->
          <parameter type-id='70a74e83'/>
          <!-- parameter of type 'PwlArc*' -->
          <parameter type-id='561d7e7a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <!-- Arc::Arc(arc_side, long int) -->
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <!-- parameter of type 'enum arc_side' -->
          <parameter type-id='45273cc6'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Buffer -->
    <class-decl name='Buffer' size-in-bits='64' visibility='default' filepath='libnurbs/internals/bufpool.h' line='45' column='1' id='036c0a83'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Buffer* Buffer::next -->
        <var-decl name='next' type-id='2c9a42a3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Pool -->
    <class-decl name='Pool' size-in-bits='2496' visibility='default' filepath='libnurbs/internals/bufpool.h' line='50' column='1' id='1329513b'>
      <member-type access='protected'>
        <!-- enum Pool::Magic -->
        <enum-decl name='Magic' filepath='libnurbs/internals/bufpool.h' line='70' column='1' id='ca454859'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='is_allocated' value='62369'/>
          <enumerator name='is_free' value='61858'/>
        </enum-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <!-- Buffer* Pool::freelist -->
        <var-decl name='freelist' type-id='2c9a42a3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='62' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <!-- char* Pool::blocklist[32] -->
        <var-decl name='blocklist' type-id='2e646d82' visibility='default' filepath='libnurbs/internals/bufpool.h' line='63' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2112'>
        <!-- int Pool::nextblock -->
        <var-decl name='nextblock' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='64' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2176'>
        <!-- char* Pool::curblock -->
        <var-decl name='curblock' type-id='26a90f95' visibility='default' filepath='libnurbs/internals/bufpool.h' line='65' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2240'>
        <!-- int Pool::buffersize -->
        <var-decl name='buffersize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='66' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2272'>
        <!-- int Pool::nextsize -->
        <var-decl name='nextsize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='67' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2304'>
        <!-- int Pool::nextfree -->
        <var-decl name='nextfree' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='68' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2336'>
        <!-- int Pool::initsize -->
        <var-decl name='initsize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='69' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2368'>
        <!-- const char* Pool::name -->
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='libnurbs/internals/bufpool.h' line='71' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2432'>
        <!-- Pool::Magic Pool::magic -->
        <var-decl name='magic' type-id='ca454859' visibility='default' filepath='libnurbs/internals/bufpool.h' line='72' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Pool::Pool(int, int, const char*) -->
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Pool*' -->
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='80f4b756'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- Pool::~Pool(int) -->
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Pool*' -->
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class PooledObj -->
    <class-decl name='PooledObj' size-in-bits='8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='118' column='1' id='1feb48e7'/>
    <!-- class PwlArc -->
    <class-decl name='PwlArc' size-in-bits='192' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='44' column='1' id='c60dfbac'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- TrimVertex* PwlArc::pts -->
        <var-decl name='pts' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- int PwlArc::npts -->
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- long int PwlArc::type -->
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='48' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- PwlArc::PwlArc() -->
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'PwlArc*' -->
          <parameter type-id='561d7e7a' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- PwlArc::PwlArc(int, TrimVertex*) -->
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'PwlArc*' -->
          <parameter type-id='561d7e7a' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'TrimVertex*' -->
          <parameter type-id='86e0e963'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- PwlArc::PwlArc(int, TrimVertex*, long int) -->
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'PwlArc*' -->
          <parameter type-id='561d7e7a' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'TrimVertex*' -->
          <parameter type-id='86e0e963'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct TrimVertex -->
    <class-decl name='TrimVertex' size-in-bits='128' is-struct='yes' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='43' column='1' id='a514a513'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL TrimVertex::param[2] -->
        <var-decl name='param' type-id='5df3d5e7' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- long int TrimVertex::nuid -->
        <var-decl name='nuid' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- Arc* -->
    <pointer-type-def type-id='e4a01a13' size-in-bits='64' id='70a74e83'/>
    <!-- Arc* const -->
    <qualified-type-def type-id='70a74e83' const='yes' id='de7f6898'/>
    <!-- Arc_ptr* -->
    <pointer-type-def type-id='c118b035' size-in-bits='64' id='7d392e34'/>
    <!-- BezierArc* -->
    <pointer-type-def type-id='26d417ca' size-in-bits='64' id='26518268'/>
    <!-- Buffer* -->
    <pointer-type-def type-id='036c0a83' size-in-bits='64' id='2c9a42a3'/>
    <!-- Pool& -->
    <reference-type-def kind='lvalue' type-id='1329513b' size-in-bits='64' id='16a1015f'/>
    <!-- Pool* -->
    <pointer-type-def type-id='1329513b' size-in-bits='64' id='1aa107ab'/>
    <!-- PooledObj* -->
    <pointer-type-def type-id='1feb48e7' size-in-bits='64' id='298506af'/>
    <!-- PwlArc* -->
    <pointer-type-def type-id='c60dfbac' size-in-bits='64' id='561d7e7a'/>
    <!-- TrimVertex* -->
    <pointer-type-def type-id='a514a513' size-in-bits='64' id='86e0e963'/>
    <!-- char* -->
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <!-- const char -->
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <!-- const char* -->
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <!-- const int -->
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <!-- struct BezierArc -->
    <class-decl name='BezierArc' is-struct='yes' visibility='default' is-declaration-only='yes' id='26d417ca'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arcsorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- REAL[4] -->
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='128' id='a201b87d'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <!-- REAL[][24][24] -->
    <array-type-def dimensions='3' type-id='234bc418' size-in-bits='infinite' id='1e6e1d59'>
      <!-- <anonymous range>[] -->
      <subrange length='infinite' id='031f2035'/>
      <!-- <anonymous range>[24] -->
      <subrange length='24' type-id='7359adad' id='fdd3342b'/>
      <!-- <anonymous range>[24] -->
      <subrange length='24' type-id='7359adad' id='fdd3342b'/>
    </array-type-def>
    <!-- __jmp_buf_tag[1] -->
    <array-type-def dimensions='1' type-id='95989dcf' size-in-bits='1600' id='092da536'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <!-- long int[8] -->
    <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='512' id='5d4efd44'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <!-- unsigned long int[16] -->
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='1024' id='d2baa450'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <!-- typedef long int[8] __jmp_buf -->
    <typedef-decl name='__jmp_buf' type-id='5d4efd44' filepath='/usr/include/bits/setjmp.h' line='32' column='1' id='379a1ab7'/>
    <!-- struct __sigset_t -->
    <class-decl name='__sigset_t' size-in-bits='1024' is-struct='yes' visibility='default' filepath='/usr/include/bits/sigset.h' line='30' column='1' id='2616147f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int __sigset_t::__val[16] -->
        <var-decl name='__val' type-id='d2baa450' visibility='default' filepath='/usr/include/bits/sigset.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct __jmp_buf_tag -->
    <class-decl name='__jmp_buf_tag' size-in-bits='1600' is-struct='yes' visibility='default' filepath='/usr/include/setjmp.h' line='36' column='1' id='95989dcf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __jmp_buf __jmp_buf_tag::__jmpbuf -->
        <var-decl name='__jmpbuf' type-id='379a1ab7' visibility='default' filepath='/usr/include/setjmp.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int __jmp_buf_tag::__mask_was_saved -->
        <var-decl name='__mask_was_saved' type-id='95e97e5e' visibility='default' filepath='/usr/include/setjmp.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- __sigset_t __jmp_buf_tag::__saved_mask -->
        <var-decl name='__saved_mask' type-id='2616147f' visibility='default' filepath='/usr/include/setjmp.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __jmp_buf_tag[1] jmp_buf -->
    <typedef-decl name='jmp_buf' type-id='092da536' filepath='/usr/include/setjmp.h' line='49' column='1' id='a3997015'/>
    <!-- class ArcTessellator -->
    <class-decl name='ArcTessellator' size-in-bits='128' visibility='default' filepath='libnurbs/internals/arctess.h' line='47' column='1' id='96a897b1'>
      <data-member access='private' static='yes'>
        <!-- static REAL ArcTessellator::gl_Bernstein[][24][24] -->
        <var-decl name='gl_Bernstein' type-id='1e6e1d59' mangled-name='_ZN14ArcTessellator12gl_BernsteinE' visibility='default' filepath='libnurbs/internals/arctess.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Pool& ArcTessellator::pwlarcpool -->
        <var-decl name='pwlarcpool' type-id='16a10160' visibility='default' filepath='libnurbs/internals/arctess.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- TrimVertexPool& ArcTessellator::trimvertexpool -->
        <var-decl name='trimvertexpool' type-id='7ba6b98d' visibility='default' filepath='libnurbs/internals/arctess.h' line='62' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- ArcTessellator::ArcTessellator(TrimVertexPool&, Pool&) -->
        <function-decl name='ArcTessellator' filepath='libnurbs/internals/arctess.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcTessellator*' -->
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <!-- parameter of type 'TrimVertexPool&' -->
          <parameter type-id='7ba6b98e'/>
          <!-- parameter of type 'Pool&' -->
          <parameter type-id='16a1015f'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- ArcTessellator::~ArcTessellator(int) -->
        <function-decl name='~ArcTessellator' filepath='libnurbs/internals/arctess.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcTessellator*' -->
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Bin -->
    <class-decl name='Bin' size-in-bits='128' visibility='default' filepath='libnurbs/internals/bin.h' line='44' column='1' id='55730736'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Arc_ptr Bin::head -->
        <var-decl name='head' type-id='c118b035' visibility='default' filepath='libnurbs/internals/bin.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- Arc_ptr Bin::current -->
        <var-decl name='current' type-id='c118b035' visibility='default' filepath='libnurbs/internals/bin.h' line='47' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Bin::Bin() -->
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Bin*' -->
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- Bin::~Bin(int) -->
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Bin*' -->
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct Curvelist -->
    <class-decl name='Curvelist' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/curvelist.h' line='47' column='1' id='5d0beef4'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Curve* Curvelist::curve -->
        <var-decl name='curve' type-id='e5fec7ba' visibility='default' filepath='libnurbs/internals/curvelist.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- float Curvelist::range[3] -->
        <var-decl name='range' type-id='c723f882' visibility='default' filepath='libnurbs/internals/curvelist.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <!-- int Curvelist::needsSubdivision -->
        <var-decl name='needsSubdivision' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curvelist.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- float Curvelist::stepsize -->
        <var-decl name='stepsize' type-id='a6c45d85' visibility='default' filepath='libnurbs/internals/curvelist.h' line='60' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Curvelist::Curvelist(Quilt*, REAL, REAL) -->
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Curvelist*' -->
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <!-- parameter of type 'Quilt*' -->
          <parameter type-id='ad0c8abc'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <!-- Curvelist::Curvelist(Curvelist&, REAL) -->
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Curvelist*' -->
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <!-- parameter of type 'Curvelist&' -->
          <parameter type-id='d5ebc58e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <!-- Curvelist::~Curvelist(int) -->
        <function-decl name='~Curvelist' filepath='libnurbs/internals/curvelist.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Curvelist*' -->
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Flist -->
    <class-decl name='Flist' size-in-bits='320' visibility='default' filepath='libnurbs/internals/flist.h' line='42' column='1' id='79b62e7d'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- REAL* Flist::pts -->
        <var-decl name='pts' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/flist.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- int Flist::npts -->
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/flist.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <!-- int Flist::start -->
        <var-decl name='start' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/flist.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- int Flist::end -->
        <var-decl name='end' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/flist.h' line='47' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <!-- FlistSorter Flist::sorter -->
        <var-decl name='sorter' type-id='3b7cb332' visibility='default' filepath='libnurbs/internals/flist.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Flist::Flist() -->
        <function-decl name='Flist' filepath='libnurbs/internals/flist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Flist*' -->
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- Flist::~Flist(int) -->
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Flist*' -->
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class FlistSorter -->
    <class-decl name='FlistSorter' size-in-bits='128' visibility='default' filepath='libnurbs/internals/flistsorter.h' line='42' column='1' id='3b7cb332'>
      <!-- class Sorter -->
      <base-class access='public' layout-offset-in-bits='0' type-id='930e1102'/>
      <member-function access='private' constructor='yes'>
        <!-- FlistSorter::FlistSorter() -->
        <function-decl name='FlistSorter' filepath='libnurbs/internals/flistsorter.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'FlistSorter*' -->
          <parameter type-id='0456e320' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- FlistSorter::~FlistSorter(int) -->
        <function-decl name='~FlistSorter' filepath='libnurbs/internals/flistsorter.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'FlistSorter*' -->
          <parameter type-id='0456e320' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <!-- int FlistSorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN11FlistSorter5qscmpEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'FlistSorter*' -->
          <parameter type-id='0456e320' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <!-- void FlistSorter::qsexc(char*, char*) -->
        <function-decl name='qsexc' mangled-name='_ZN11FlistSorter5qsexcEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'FlistSorter*' -->
          <parameter type-id='0456e320' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <!-- void FlistSorter::qstexc(char*, char*, char*) -->
        <function-decl name='qstexc' mangled-name='_ZN11FlistSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/flistsorter.cc' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'FlistSorter*' -->
          <parameter type-id='0456e320' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct JumpBuffer -->
    <class-decl name='JumpBuffer' size-in-bits='1600' is-struct='yes' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='56' column='1' id='46658fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- jmp_buf JumpBuffer::buf -->
        <var-decl name='buf' type-id='a3997015' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Patchlist -->
    <class-decl name='Patchlist' size-in-bits='640' is-struct='yes' visibility='default' filepath='libnurbs/internals/patchlist.h' line='45' column='1' id='48a81e9d'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Patch* Patchlist::patch -->
        <var-decl name='patch' type-id='049c92d9' visibility='default' filepath='libnurbs/internals/patchlist.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- int Patchlist::notInBbox -->
        <var-decl name='notInBbox' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patchlist.h' line='64' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <!-- int Patchlist::needsSampling -->
        <var-decl name='needsSampling' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patchlist.h' line='65' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- Pspec Patchlist::pspec[2] -->
        <var-decl name='pspec' type-id='e0a39484' visibility='default' filepath='libnurbs/internals/patchlist.h' line='66' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Patchlist::Patchlist(Quilt*, REAL*, REAL*) -->
        <function-decl name='Patchlist' filepath='libnurbs/internals/patchlist.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Patchlist*' -->
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <!-- parameter of type 'Quilt*' -->
          <parameter type-id='ad0c8abc'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='c0eda015'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <!-- Patchlist::Patchlist(Patchlist&, int, REAL) -->
        <function-decl name='Patchlist' filepath='libnurbs/internals/patchlist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Patchlist*' -->
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <!-- parameter of type 'Patchlist&' -->
          <parameter type-id='6a2f2849'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <!-- Patchlist::~Patchlist(int) -->
        <function-decl name='~Patchlist' filepath='libnurbs/internals/patchlist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Patchlist*' -->
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct Quilt -->
    <class-decl name='Quilt' size-in-bits='896' is-struct='yes' visibility='default' filepath='libnurbs/internals/quilt.h' line='64' column='1' id='fb679596'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Mapdesc* Quilt::mapdesc -->
        <var-decl name='mapdesc' type-id='4674ed22' visibility='default' filepath='libnurbs/internals/quilt.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL* Quilt::cpts -->
        <var-decl name='cpts' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/quilt.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Quiltspec Quilt::qspec[2] -->
        <var-decl name='qspec' type-id='cebeb113' visibility='default' filepath='libnurbs/internals/quilt.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- Quiltspec_ptr Quilt::eqspec -->
        <var-decl name='eqspec' type-id='cbe067ff' visibility='default' filepath='libnurbs/internals/quilt.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- Quilt* Quilt::next -->
        <var-decl name='next' type-id='ad0c8abc' visibility='default' filepath='libnurbs/internals/quilt.h' line='71' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Quilt::Quilt(Mapdesc*) -->
        <function-decl name='Quilt' filepath='libnurbs/internals/quilt.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Quilt*' -->
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <!-- parameter of type 'Mapdesc*' -->
          <parameter type-id='4674ed22'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct Renderhints -->
    <class-decl name='Renderhints' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/renderhints.h' line='41' column='1' id='14066291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL Renderhints::display_method -->
        <var-decl name='display_method' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- REAL Renderhints::errorchecking -->
        <var-decl name='errorchecking' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL Renderhints::subdivisions -->
        <var-decl name='subdivisions' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL Renderhints::tmp1 -->
        <var-decl name='tmp1' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int Renderhints::displaydomain -->
        <var-decl name='displaydomain' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int Renderhints::maxsubdivisions -->
        <var-decl name='maxsubdivisions' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int Renderhints::wiretris -->
        <var-decl name='wiretris' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- int Renderhints::wirequads -->
        <var-decl name='wirequads' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='57' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Renderhints::Renderhints() -->
        <function-decl name='Renderhints' filepath='libnurbs/internals/renderhints.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Renderhints*' -->
          <parameter type-id='c204f909' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Subdivider -->
    <class-decl name='Subdivider' size-in-bits='20416' visibility='default' filepath='libnurbs/internals/subdivider.h' line='55' column='1' id='62291dde'>
      <member-type access='private'>
        <!-- enum Subdivider::dir -->
        <enum-decl name='dir' filepath='libnurbs/internals/subdivider.h' line='105' column='1' id='97aebf86'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='down' value='0'/>
          <enumerator name='same' value='1'/>
          <enumerator name='up' value='2'/>
          <enumerator name='none' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Slicer Subdivider::slicer -->
        <var-decl name='slicer' type-id='588a6d01' visibility='default' filepath='libnurbs/internals/subdivider.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8064'>
        <!-- ArcTessellator Subdivider::arctessellator -->
        <var-decl name='arctessellator' type-id='96a897b1' visibility='default' filepath='libnurbs/internals/subdivider.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8192'>
        <!-- Pool Subdivider::arcpool -->
        <var-decl name='arcpool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='114' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='10688'>
        <!-- Pool Subdivider::bezierarcpool -->
        <var-decl name='bezierarcpool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13184'>
        <!-- Pool Subdivider::pwlarcpool -->
        <var-decl name='pwlarcpool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='15680'>
        <!-- TrimVertexPool Subdivider::trimvertexpool -->
        <var-decl name='trimvertexpool' type-id='95c1e8c1' visibility='default' filepath='libnurbs/internals/subdivider.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18304'>
        <!-- JumpBuffer* Subdivider::jumpbuffer -->
        <var-decl name='jumpbuffer' type-id='0e86d3eb' visibility='default' filepath='libnurbs/internals/subdivider.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18368'>
        <!-- Renderhints& Subdivider::renderhints -->
        <var-decl name='renderhints' type-id='ce050bed' visibility='default' filepath='libnurbs/internals/subdivider.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18432'>
        <!-- Backend& Subdivider::backend -->
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18496'>
        <!-- Bin Subdivider::initialbin -->
        <var-decl name='initialbin' type-id='55730736' visibility='default' filepath='libnurbs/internals/subdivider.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18624'>
        <!-- Arc_ptr Subdivider::pjarc -->
        <var-decl name='pjarc' type-id='c118b035' visibility='default' filepath='libnurbs/internals/subdivider.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18688'>
        <!-- int Subdivider::s_index -->
        <var-decl name='s_index' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18720'>
        <!-- int Subdivider::t_index -->
        <var-decl name='t_index' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18752'>
        <!-- Quilt* Subdivider::qlist -->
        <var-decl name='qlist' type-id='ad0c8abc' visibility='default' filepath='libnurbs/internals/subdivider.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18816'>
        <!-- Flist Subdivider::spbrkpts -->
        <var-decl name='spbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19136'>
        <!-- Flist Subdivider::tpbrkpts -->
        <var-decl name='tpbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19456'>
        <!-- Flist Subdivider::smbrkpts -->
        <var-decl name='smbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19776'>
        <!-- Flist Subdivider::tmbrkpts -->
        <var-decl name='tmbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20096'>
        <!-- REAL Subdivider::stepsizes[4] -->
        <var-decl name='stepsizes' type-id='a201b87d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20224'>
        <!-- int Subdivider::showDegenerate -->
        <var-decl name='showDegenerate' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20256'>
        <!-- int Subdivider::isArcTypeBezier -->
        <var-decl name='isArcTypeBezier' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20288'>
        <!-- REAL Subdivider::domain_distance_u_rate -->
        <var-decl name='domain_distance_u_rate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/subdivider.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20320'>
        <!-- REAL Subdivider::domain_distance_v_rate -->
        <var-decl name='domain_distance_v_rate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/subdivider.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20352'>
        <!-- int Subdivider::is_domain_distance_sampling -->
        <var-decl name='is_domain_distance_sampling' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='190' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Subdivider::Subdivider(Renderhints&, Backend&) -->
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Subdivider*' -->
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <!-- parameter of type 'Renderhints&' -->
          <parameter type-id='ce050bee'/>
          <!-- parameter of type 'Backend&' -->
          <parameter type-id='6edb776c'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- Subdivider::~Subdivider(int) -->
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Subdivider*' -->
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct TrimVertexPool -->
    <class-decl name='TrimVertexPool' size-in-bits='2624' is-struct='yes' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='45' column='1' id='95c1e8c1'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Pool TrimVertexPool::pool -->
        <var-decl name='pool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <!-- TrimVertex** TrimVertexPool::vlist -->
        <var-decl name='vlist' type-id='9d0f3deb' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <!-- int TrimVertexPool::nextvlistslot -->
        <var-decl name='nextvlistslot' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2592'>
        <!-- int TrimVertexPool::vlistsize -->
        <var-decl name='vlistsize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='55' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- TrimVertexPool::TrimVertexPool() -->
        <function-decl name='TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'TrimVertexPool*' -->
          <parameter type-id='6fa6a6a9' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <!-- TrimVertexPool::~TrimVertexPool(int) -->
        <function-decl name='~TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'TrimVertexPool*' -->
          <parameter type-id='6fa6a6a9' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- Arc** -->
    <pointer-type-def type-id='70a74e83' size-in-bits='64' id='0060d40b'/>
    <!-- ArcSdirSorter* -->
    <pointer-type-def type-id='4263e7b4' size-in-bits='64' id='33212902'/>
    <!-- ArcSorter* -->
    <pointer-type-def type-id='78634648' size-in-bits='64' id='92b77e5e'/>
    <!-- ArcSorter* const -->
    <qualified-type-def type-id='92b77e5e' const='yes' id='2eb3fb51'/>
    <!-- ArcTdirSorter* -->
    <pointer-type-def type-id='fc3a0aa7' size-in-bits='64' id='80f20a7f'/>
    <!-- ArcTessellator* -->
    <pointer-type-def type-id='96a897b1' size-in-bits='64' id='4a9e4f29'/>
    <!-- Backend& -->
    <qualified-type-def type-id='6edb776c' id='6edb776b'/>
    <!-- Backend& -->
    <reference-type-def kind='lvalue' type-id='8abb1ec7' size-in-bits='64' id='6edb776c'/>
    <!-- Bin& -->
    <reference-type-def kind='lvalue' type-id='55730736' size-in-bits='64' id='6eadc0e8'/>
    <!-- Bin* -->
    <pointer-type-def type-id='55730736' size-in-bits='64' id='6aadba9c'/>
    <!-- Curvelist& -->
    <reference-type-def kind='lvalue' type-id='5d0beef4' size-in-bits='64' id='d5ebc58e'/>
    <!-- Flist* -->
    <pointer-type-def type-id='79b62e7d' size-in-bits='64' id='6b4fa57d'/>
    <!-- JumpBuffer* -->
    <pointer-type-def type-id='46658fab' size-in-bits='64' id='0e86d3eb'/>
    <!-- Patchlist& -->
    <reference-type-def kind='lvalue' type-id='48a81e9d' size-in-bits='64' id='6a2f2849'/>
    <!-- Pool& -->
    <qualified-type-def type-id='16a1015f' id='16a10160'/>
    <!-- Quilt* -->
    <pointer-type-def type-id='fb679596' size-in-bits='64' id='ad0c8abc'/>
    <!-- Renderhints& -->
    <qualified-type-def type-id='ce050bee' id='ce050bed'/>
    <!-- Renderhints& -->
    <reference-type-def kind='lvalue' type-id='14066291' size-in-bits='64' id='ce050bee'/>
    <!-- Sorter* -->
    <pointer-type-def type-id='930e1102' size-in-bits='64' id='9e581de0'/>
    <!-- Subdivider& -->
    <qualified-type-def type-id='33c85970' id='33c85971'/>
    <!-- Subdivider& -->
    <reference-type-def kind='lvalue' type-id='62291dde' size-in-bits='64' id='33c85970'/>
    <!-- Subdivider* -->
    <pointer-type-def type-id='62291dde' size-in-bits='64' id='3fc86c54'/>
    <!-- TrimVertex** -->
    <pointer-type-def type-id='86e0e963' size-in-bits='64' id='9d0f3deb'/>
    <!-- TrimVertexPool& -->
    <qualified-type-def type-id='7ba6b98e' id='7ba6b98d'/>
    <!-- TrimVertexPool& -->
    <reference-type-def kind='lvalue' type-id='95c1e8c1' size-in-bits='64' id='7ba6b98e'/>
    <!-- TrimVertexPool* -->
    <pointer-type-def type-id='95c1e8c1' size-in-bits='64' id='6fa6a6a9'/>
    <!-- const REAL -->
    <qualified-type-def type-id='234bc418' const='yes' id='08485948'/>
    <!-- const REAL* -->
    <pointer-type-def type-id='08485948' size-in-bits='64' id='6be4b546'/>
    <!-- class ArcSorter -->
    <class-decl name='ArcSorter' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='44' column='1' is-declaration-only='yes' id='78634648'>
      <!-- class Sorter -->
      <base-class access='private' layout-offset-in-bits='0' type-id='930e1102'/>
      <data-member access='protected' layout-offset-in-bits='128'>
        <!-- Subdivider& ArcSorter::subdivider -->
        <var-decl name='subdivider' type-id='33c85971' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='50' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- ArcSorter::ArcSorter(Subdivider&) -->
        <function-decl name='ArcSorter' filepath='libnurbs/internals/arcsorter.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcSorter*' -->
          <parameter type-id='92b77e5e' is-artificial='yes'/>
          <!-- parameter of type 'Subdivider&' -->
          <parameter type-id='33c85970'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <!-- int ArcSorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN9ArcSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcSorter*' -->
          <parameter type-id='92b77e5e' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <!-- void ArcSorter::qsexc(char*, char*) -->
        <function-decl name='qsexc' mangled-name='_ZN9ArcSorter5qsexcEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcSorter*' -->
          <parameter type-id='92b77e5e' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <!-- void ArcSorter::qstexc(char*, char*, char*) -->
        <function-decl name='qstexc' mangled-name='_ZN9ArcSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/arcsorter.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcSorter*' -->
          <parameter type-id='92b77e5e' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class ArcSdirSorter -->
    <class-decl name='ArcSdirSorter' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='57' column='1' is-declaration-only='yes' id='4263e7b4'>
      <!-- class ArcSorter -->
      <base-class access='public' layout-offset-in-bits='0' type-id='78634648'/>
      <member-function access='private' constructor='yes'>
        <!-- ArcSdirSorter::ArcSdirSorter(Subdivider&) -->
        <function-decl name='ArcSdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcSdirSorter*' -->
          <parameter type-id='33212902' is-artificial='yes'/>
          <!-- parameter of type 'Subdivider&' -->
          <parameter type-id='33c85970'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <!-- int ArcSdirSorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN13ArcSdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcSdirSorter*' -->
          <parameter type-id='33212902' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class ArcTdirSorter -->
    <class-decl name='ArcTdirSorter' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='65' column='1' is-declaration-only='yes' id='fc3a0aa7'>
      <!-- class ArcSorter -->
      <base-class access='public' layout-offset-in-bits='0' type-id='78634648'/>
      <member-function access='private' constructor='yes'>
        <!-- ArcTdirSorter::ArcTdirSorter(Subdivider&) -->
        <function-decl name='ArcTdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcTdirSorter*' -->
          <parameter type-id='80f20a7f' is-artificial='yes'/>
          <!-- parameter of type 'Subdivider&' -->
          <parameter type-id='33c85970'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <!-- int ArcTdirSorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN13ArcTdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'ArcTdirSorter*' -->
          <parameter type-id='80f20a7f' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct Backend -->
    <class-decl name='Backend' is-struct='yes' visibility='default' filepath='libnurbs/internals/backend.h' line='46' column='1' is-declaration-only='yes' id='8abb1ec7'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- BasicCurveEvaluator& Backend::curveEvaluator -->
        <var-decl name='curveEvaluator' type-id='15a0d7b2' visibility='default' filepath='libnurbs/internals/backend.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- BasicSurfaceEvaluator& Backend::surfaceEvaluator -->
        <var-decl name='surfaceEvaluator' type-id='e2ef5a9a' visibility='default' filepath='libnurbs/internals/backend.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- int Backend::wireframetris -->
        <var-decl name='wireframetris' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <!-- int Backend::wireframequads -->
        <var-decl name='wireframequads' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- int Backend::npts -->
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <!-- REAL Backend::mesh[3][4] -->
        <var-decl name='mesh' type-id='2f738f98' visibility='default' filepath='libnurbs/internals/backend.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <!-- int Backend::meshindex -->
        <var-decl name='meshindex' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='109' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Backend::Backend(BasicCurveEvaluator&, BasicSurfaceEvaluator&) -->
        <function-decl name='Backend' filepath='libnurbs/internals/backend.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Backend*' -->
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <!-- parameter of type 'BasicCurveEvaluator&' -->
          <parameter type-id='15a0d7b1'/>
          <!-- parameter of type 'BasicSurfaceEvaluator&' -->
          <parameter type-id='e2ef5a99'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Slicer -->
    <class-decl name='Slicer' visibility='default' filepath='libnurbs/internals/slicer.h' line='49' column='1' is-declaration-only='yes' id='588a6d01'>
      <!-- class CoveAndTiler -->
      <base-class access='public' layout-offset-in-bits='0' type-id='732b9357'/>
      <!-- class Mesher -->
      <base-class access='public' layout-offset-in-bits='128' type-id='43336373'/>
      <data-member access='private' layout-offset-in-bits='5248'>
        <!-- Backend& Slicer::backend -->
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/slicer.h' line='72' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5312'>
        <!-- REAL Slicer::oneOverDu -->
        <var-decl name='oneOverDu' type-id='234bc418' visibility='default' filepath='libnurbs/internals/slicer.h' line='73' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5344'>
        <!-- REAL Slicer::du -->
        <var-decl name='du' type-id='234bc418' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5376'>
        <!-- REAL Slicer::dv -->
        <var-decl name='dv' type-id='234bc418' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5408'>
        <!-- int Slicer::isolines -->
        <var-decl name='isolines' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/slicer.h' line='75' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5440'>
        <!-- int Slicer::ulinear -->
        <var-decl name='ulinear' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/slicer.h' line='81' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5472'>
        <!-- int Slicer::vlinear -->
        <var-decl name='vlinear' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/slicer.h' line='82' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Slicer::Slicer(int, void**, Backend&) -->
        <function-decl name='Slicer' filepath='libnurbs/internals/slicer.cc' line='1181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Slicer*' -->
          <parameter type-id='054b4ce9' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- artificial parameter of type 'void**' -->
          <parameter type-id='63e171df' is-artificial='yes'/>
          <!-- parameter of type 'Backend&' -->
          <parameter type-id='6edb776c'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- Slicer::~Slicer(int, void**) -->
        <function-decl name='~Slicer' filepath='libnurbs/internals/slicer.cc' line='1192' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Slicer*' -->
          <parameter type-id='054b4ce9' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- artificial parameter of type 'void**' -->
          <parameter type-id='63e171df' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Sorter -->
    <class-decl name='Sorter' visibility='default' filepath='libnurbs/internals/sorter.h' line='36' column='1' is-declaration-only='yes' id='930e1102'>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- int Sorter::es -->
        <var-decl name='es' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/sorter.h' line='49' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Sorter::Sorter(int) -->
        <function-decl name='Sorter' filepath='libnurbs/internals/sorter.cc' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Sorter*' -->
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- Sorter::~Sorter(int) -->
        <function-decl name='~Sorter' filepath='libnurbs/internals/sorter.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Sorter*' -->
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <!-- int Sorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN6Sorter5qscmpEPcS0_' filepath='libnurbs/internals/sorter.cc' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Sorter*' -->
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- int -->
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <!-- void Sorter::qsexc(char*, char*) -->
        <function-decl name='qsexc' mangled-name='_ZN6Sorter5qsexcEPcS0_' filepath='libnurbs/internals/sorter.cc' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Sorter*' -->
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <!-- void Sorter::qstexc(char*, char*, char*) -->
        <function-decl name='qstexc' mangled-name='_ZN6Sorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/sorter.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Sorter*' -->
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='26a90f95'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arctess.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- ArcTessellator* const -->
    <qualified-type-def type-id='4a9e4f29' const='yes' id='b9dde446'/>
    <!-- Pool* const -->
    <qualified-type-def type-id='1aa107ab' const='yes' id='99639ce0'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/backend.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- REAL[3][4] -->
    <array-type-def dimensions='2' type-id='234bc418' size-in-bits='384' id='2f738f98'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <!-- class GridTrimVertex -->
    <class-decl name='GridTrimVertex' size-in-bits='384' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='45' column='1' id='4f08619f'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- TrimVertex GridTrimVertex::dummyt -->
        <var-decl name='dummyt' type-id='a514a513' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- GridVertex GridTrimVertex::dummyg -->
        <var-decl name='dummyg' type-id='3f2e4b5b' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- TrimVertex* GridTrimVertex::t -->
        <var-decl name='t' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- GridVertex* GridTrimVertex::g -->
        <var-decl name='g' type-id='d96ed0fb' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='52' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- GridTrimVertex::GridTrimVertex() -->
        <function-decl name='GridTrimVertex' filepath='libnurbs/internals/gridtrimvertex.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GridTrimVertex*' -->
          <parameter type-id='6ae24567' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct GridVertex -->
    <class-decl name='GridVertex' size-in-bits='128' is-struct='yes' visibility='default' filepath='libnurbs/internals/gridvertex.h' line='39' column='1' id='3f2e4b5b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long int GridVertex::gparam[2] -->
        <var-decl name='gparam' type-id='6136feaa' visibility='default' filepath='libnurbs/internals/gridvertex.h' line='40' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- GridVertex::GridVertex() -->
        <function-decl name='GridVertex' filepath='libnurbs/internals/gridvertex.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GridVertex*' -->
          <parameter type-id='d96ed0fb' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <!-- GridVertex::GridVertex(long int, long int) -->
        <function-decl name='GridVertex' filepath='libnurbs/internals/gridvertex.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GridVertex*' -->
          <parameter type-id='d96ed0fb' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- Backend* -->
    <pointer-type-def type-id='8abb1ec7' size-in-bits='64' id='6adb711f'/>
    <!-- Backend* const -->
    <qualified-type-def type-id='6adb711f' const='yes' id='3c1186ac'/>
    <!-- BasicCurveEvaluator& -->
    <qualified-type-def type-id='15a0d7b1' id='15a0d7b2'/>
    <!-- BasicCurveEvaluator& -->
    <reference-type-def kind='lvalue' type-id='22b18ed5' size-in-bits='64' id='15a0d7b1'/>
    <!-- BasicSurfaceEvaluator& -->
    <qualified-type-def type-id='e2ef5a99' id='e2ef5a9a'/>
    <!-- BasicSurfaceEvaluator& -->
    <reference-type-def kind='lvalue' type-id='f37336ad' size-in-bits='64' id='e2ef5a99'/>
    <!-- GridTrimVertex* -->
    <pointer-type-def type-id='4f08619f' size-in-bits='64' id='6ae24567'/>
    <!-- GridTrimVertex* const -->
    <qualified-type-def type-id='6ae24567' const='yes' id='7fbee4d4'/>
    <!-- GridVertex* -->
    <pointer-type-def type-id='3f2e4b5b' size-in-bits='64' id='d96ed0fb'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/bin.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Bin* const -->
    <qualified-type-def type-id='6aadba9c' const='yes' id='d04a6187'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/cachingeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/ccw.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Subdivider* const -->
    <qualified-type-def type-id='3fc86c54' const='yes' id='2d80381f'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/coveandtiler.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- class CoveAndTiler -->
    <class-decl name='CoveAndTiler' size-in-bits='2688' visibility='default' filepath='libnurbs/internals/coveandtiler.h' line='46' column='1' id='732b9357'>
      <!-- class TrimRegion -->
      <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='48e5d3e9'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- Backend& CoveAndTiler::backend -->
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/coveandtiler.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <!-- static const int CoveAndTiler::MAXSTRIPSIZE -->
        <var-decl name='MAXSTRIPSIZE' type-id='2448a865' mangled-name='_ZN12CoveAndTiler12MAXSTRIPSIZEE' visibility='default' filepath='libnurbs/internals/coveandtiler.cc' line='50' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- CoveAndTiler::CoveAndTiler(int, void**, Backend&) -->
        <function-decl name='CoveAndTiler' filepath='libnurbs/internals/coveandtiler.cc' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CoveAndTiler*' -->
          <parameter type-id='de06809f' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- artificial parameter of type 'void**' -->
          <parameter type-id='63e171df' is-artificial='yes'/>
          <!-- parameter of type 'Backend&' -->
          <parameter type-id='6edb776c'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- CoveAndTiler::~CoveAndTiler(int, void**) -->
        <function-decl name='~CoveAndTiler' filepath='libnurbs/internals/coveandtiler.cc' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CoveAndTiler*' -->
          <parameter type-id='de06809f' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- artificial parameter of type 'void**' -->
          <parameter type-id='63e171df' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct Gridline -->
    <class-decl name='Gridline' size-in-bits='320' is-struct='yes' visibility='default' filepath='libnurbs/internals/gridline.h' line='39' column='1' id='77f16233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long int Gridline::v -->
        <var-decl name='v' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/gridline.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL Gridline::vval -->
        <var-decl name='vval' type-id='234bc418' visibility='default' filepath='libnurbs/internals/gridline.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- long int Gridline::vindex -->
        <var-decl name='vindex' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/gridline.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- long int Gridline::ustart -->
        <var-decl name='ustart' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/gridline.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- long int Gridline::uend -->
        <var-decl name='uend' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/gridline.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Jarcloc -->
    <class-decl name='Jarcloc' size-in-bits='192' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='41' column='1' id='e19a2b97'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Arc_ptr Jarcloc::arc -->
        <var-decl name='arc' type-id='c118b035' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='43' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- TrimVertex* Jarcloc::p -->
        <var-decl name='p' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- TrimVertex* Jarcloc::plast -->
        <var-decl name='plast' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Trimline -->
    <class-decl name='Trimline' size-in-bits='832' visibility='default' filepath='libnurbs/internals/trimline.h' line='46' column='1' id='0aec50eb'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- TrimVertex** Trimline::pts -->
        <var-decl name='pts' type-id='9d0f3deb' visibility='default' filepath='libnurbs/internals/trimline.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- long int Trimline::numverts -->
        <var-decl name='numverts' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/trimline.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- long int Trimline::i -->
        <var-decl name='i' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/trimline.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- long int Trimline::size -->
        <var-decl name='size' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/trimline.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- Jarcloc Trimline::jarcl -->
        <var-decl name='jarcl' type-id='e19a2b97' visibility='default' filepath='libnurbs/internals/trimline.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <!-- TrimVertex Trimline::t -->
        <var-decl name='t' type-id='a514a513' visibility='default' filepath='libnurbs/internals/trimline.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- TrimVertex Trimline::b -->
        <var-decl name='b' type-id='a514a513' visibility='default' filepath='libnurbs/internals/trimline.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <!-- TrimVertex* Trimline::tinterp -->
        <var-decl name='tinterp' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/trimline.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <!-- TrimVertex* Trimline::binterp -->
        <var-decl name='binterp' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/trimline.h' line='54' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Trimline::Trimline() -->
        <function-decl name='Trimline' filepath='libnurbs/internals/trimline.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Trimline*' -->
          <parameter type-id='46568fdb' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- Trimline::~Trimline(int) -->
        <function-decl name='~Trimline' filepath='libnurbs/internals/trimline.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Trimline*' -->
          <parameter type-id='46568fdb' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class TrimRegion -->
    <class-decl name='TrimRegion' size-in-bits='2560' visibility='default' filepath='libnurbs/internals/trimregion.h' line='46' column='1' id='48e5d3e9'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Trimline TrimRegion::left -->
        <var-decl name='left' type-id='0aec50eb' visibility='default' filepath='libnurbs/internals/trimregion.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <!-- Trimline TrimRegion::right -->
        <var-decl name='right' type-id='0aec50eb' visibility='default' filepath='libnurbs/internals/trimregion.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <!-- Gridline TrimRegion::top -->
        <var-decl name='top' type-id='77f16233' visibility='default' filepath='libnurbs/internals/trimregion.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1984'>
        <!-- Gridline TrimRegion::bot -->
        <var-decl name='bot' type-id='77f16233' visibility='default' filepath='libnurbs/internals/trimregion.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <!-- Uarray TrimRegion::uarray -->
        <var-decl name='uarray' type-id='9147a9c5' visibility='default' filepath='libnurbs/internals/trimregion.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <!-- REAL TrimRegion::oneOverDu -->
        <var-decl name='oneOverDu' type-id='234bc418' visibility='default' filepath='libnurbs/internals/trimregion.h' line='65' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- TrimRegion::TrimRegion() -->
        <function-decl name='TrimRegion' filepath='libnurbs/internals/trimregion.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'TrimRegion*' -->
          <parameter type-id='c79084e1' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Uarray -->
    <class-decl name='Uarray' size-in-bits='192' visibility='default' filepath='libnurbs/internals/uarray.h' line='44' column='1' id='9147a9c5'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- long int Uarray::size -->
        <var-decl name='size' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/uarray.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- long int Uarray::ulines -->
        <var-decl name='ulines' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/uarray.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- REAL* Uarray::uarray -->
        <var-decl name='uarray' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/uarray.h' line='52' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Uarray::Uarray() -->
        <function-decl name='Uarray' filepath='libnurbs/internals/uarray.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Uarray*' -->
          <parameter type-id='5ab658c5' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- Uarray::~Uarray(int) -->
        <function-decl name='~Uarray' filepath='libnurbs/internals/uarray.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Uarray*' -->
          <parameter type-id='5ab658c5' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- CoveAndTiler* -->
    <pointer-type-def type-id='732b9357' size-in-bits='64' id='de06809f'/>
    <!-- CoveAndTiler* const -->
    <qualified-type-def type-id='de06809f' const='yes' id='f2681a2c'/>
    <!-- GridTrimVertex& -->
    <qualified-type-def type-id='5ee23283' id='5ee23284'/>
    <!-- GridTrimVertex& -->
    <reference-type-def kind='lvalue' type-id='4f08619f' size-in-bits='64' id='5ee23283'/>
    <!-- GridVertex& -->
    <qualified-type-def type-id='d56ecaaf' id='d56ecab0'/>
    <!-- GridVertex& -->
    <reference-type-def kind='lvalue' type-id='3f2e4b5b' size-in-bits='64' id='d56ecaaf'/>
    <!-- GridVertex* const -->
    <qualified-type-def type-id='d96ed0fb' const='yes' id='8bc00470'/>
    <!-- Jarcloc* -->
    <pointer-type-def type-id='e19a2b97' size-in-bits='64' id='8dd47cdf'/>
    <!-- TrimRegion* -->
    <pointer-type-def type-id='48e5d3e9' size-in-bits='64' id='c79084e1'/>
    <!-- Trimline* -->
    <pointer-type-def type-id='0aec50eb' size-in-bits='64' id='46568fdb'/>
    <!-- Trimline* const -->
    <qualified-type-def type-id='46568fdb' const='yes' id='0b1f4050'/>
    <!-- Uarray* -->
    <pointer-type-def type-id='9147a9c5' size-in-bits='64' id='5ab658c5'/>
    <!-- void** -->
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curve.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Quiltspec[2] -->
    <array-type-def dimensions='1' type-id='2412cf51' size-in-bits='640' id='cebeb113'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- REAL[120] -->
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='3840' id='172a38aa'>
      <!-- <anonymous range>[120] -->
      <subrange length='120' type-id='7359adad' id='1ec4f032'/>
    </array-type-def>
    <!-- REAL[5] -->
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='160' id='5e051f08'>
      <!-- <anonymous range>[5] -->
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <!-- REAL[5][5] -->
    <array-type-def dimensions='2' type-id='234bc418' size-in-bits='800' id='a5d9526b'>
      <!-- <anonymous range>[5] -->
      <subrange length='5' type-id='7359adad' id='53010e10'/>
      <!-- <anonymous range>[5] -->
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <!-- float[4] -->
    <array-type-def dimensions='1' type-id='a6c45d85' size-in-bits='128' id='87305fb5'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <!-- int[2] -->
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='64' id='e4266c7e'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <!-- class Curve -->
    <class-decl name='Curve' size-in-bits='8128' visibility='default' filepath='libnurbs/internals/curve.h' line='46' column='1' id='218b0c8c'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Curve* Curve::next -->
        <var-decl name='next' type-id='e5fec7ba' visibility='default' filepath='libnurbs/internals/curve.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- Mapdesc* Curve::mapdesc -->
        <var-decl name='mapdesc' type-id='4674ed22' visibility='default' filepath='libnurbs/internals/curve.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- int Curve::stride -->
        <var-decl name='stride' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curve.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <!-- int Curve::order -->
        <var-decl name='order' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curve.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- int Curve::cullval -->
        <var-decl name='cullval' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curve.h' line='56' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <!-- int Curve::needsSampling -->
        <var-decl name='needsSampling' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curve.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- REAL Curve::cpts[120] -->
        <var-decl name='cpts' type-id='172a38aa' visibility='default' filepath='libnurbs/internals/curve.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4096'>
        <!-- REAL Curve::spts[120] -->
        <var-decl name='spts' type-id='172a38aa' visibility='default' filepath='libnurbs/internals/curve.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7936'>
        <!-- REAL Curve::stepsize -->
        <var-decl name='stepsize' type-id='234bc418' visibility='default' filepath='libnurbs/internals/curve.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7968'>
        <!-- REAL Curve::minstepsize -->
        <var-decl name='minstepsize' type-id='234bc418' visibility='default' filepath='libnurbs/internals/curve.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8000'>
        <!-- REAL Curve::range[3] -->
        <var-decl name='range' type-id='61f61aca' visibility='default' filepath='libnurbs/internals/curve.h' line='62' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Curve::Curve(Quilt*, REAL, REAL, Curve*) -->
        <function-decl name='Curve' filepath='libnurbs/internals/curve.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Curve*' -->
          <parameter type-id='e5fec7ba' is-artificial='yes'/>
          <!-- parameter of type 'Quilt*' -->
          <parameter type-id='ad0c8abc'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'Curve*' -->
          <parameter type-id='e5fec7ba'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- Curve::Curve(Curve&, REAL, Curve*) -->
        <function-decl name='Curve' filepath='libnurbs/internals/curve.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Curve*' -->
          <parameter type-id='e5fec7ba' is-artificial='yes'/>
          <!-- parameter of type 'Curve&' -->
          <parameter type-id='d9feb4d6'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='234bc418'/>
          <!-- parameter of type 'Curve*' -->
          <parameter type-id='e5fec7ba'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct Knotvector -->
    <class-decl name='Knotvector' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/knotvector.h' line='41' column='1' id='6954a4ec'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long int Knotvector::order -->
        <var-decl name='order' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/knotvector.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- long int Knotvector::knotcount -->
        <var-decl name='knotcount' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/knotvector.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- long int Knotvector::stride -->
        <var-decl name='stride' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/knotvector.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- Knot* Knotvector::knotlist -->
        <var-decl name='knotlist' type-id='25406ea7' visibility='default' filepath='libnurbs/internals/knotvector.h' line='51' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Knotvector::Knotvector() -->
        <function-decl name='Knotvector' filepath='libnurbs/internals/knotvector.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Knotvector*' -->
          <parameter type-id='e61af16a' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <!-- Knotvector::~Knotvector(int) -->
        <function-decl name='~Knotvector' filepath='libnurbs/internals/knotvector.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Knotvector*' -->
          <parameter type-id='e61af16a' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- typedef REAL[5][5] Maxmatrix -->
    <typedef-decl name='Maxmatrix' type-id='a5d9526b' filepath='libnurbs/internals/mapdesc.h' line='45' column='1' id='526a0547'/>
    <!-- struct Mapdesc -->
    <class-decl name='Mapdesc' size-in-bits='3392' is-struct='yes' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='49' column='1' id='ddf7c644'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL Mapdesc::pixel_tolerance -->
        <var-decl name='pixel_tolerance' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- REAL Mapdesc::error_tolerance -->
        <var-decl name='error_tolerance' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL Mapdesc::object_space_error_tolerance -->
        <var-decl name='object_space_error_tolerance' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL Mapdesc::clampfactor -->
        <var-decl name='clampfactor' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- REAL Mapdesc::minsavings -->
        <var-decl name='minsavings' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- REAL Mapdesc::maxrate -->
        <var-decl name='maxrate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- REAL Mapdesc::maxsrate -->
        <var-decl name='maxsrate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- REAL Mapdesc::maxtrate -->
        <var-decl name='maxtrate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- REAL Mapdesc::bboxsize[5] -->
        <var-decl name='bboxsize' type-id='5e051f08' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <!-- long int Mapdesc::type -->
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <!-- int Mapdesc::isrational -->
        <var-decl name='isrational' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='544'>
        <!-- int Mapdesc::ncoords -->
        <var-decl name='ncoords' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- int Mapdesc::hcoords -->
        <var-decl name='hcoords' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='118' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <!-- int Mapdesc::inhcoords -->
        <var-decl name='inhcoords' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <!-- int Mapdesc::mask -->
        <var-decl name='mask' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='672'>
        <!-- Maxmatrix Mapdesc::bmat -->
        <var-decl name='bmat' type-id='526a0547' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <!-- Maxmatrix Mapdesc::cmat -->
        <var-decl name='cmat' type-id='526a0547' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='122' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2272'>
        <!-- Maxmatrix Mapdesc::smat -->
        <var-decl name='smat' type-id='526a0547' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3072'>
        <!-- REAL Mapdesc::s_steps -->
        <var-decl name='s_steps' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3104'>
        <!-- REAL Mapdesc::t_steps -->
        <var-decl name='t_steps' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3136'>
        <!-- REAL Mapdesc::sampling_method -->
        <var-decl name='sampling_method' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3168'>
        <!-- REAL Mapdesc::culling_method -->
        <var-decl name='culling_method' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3200'>
        <!-- REAL Mapdesc::bbox_subdividing -->
        <var-decl name='bbox_subdividing' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3264'>
        <!-- Mapdesc* Mapdesc::next -->
        <var-decl name='next' type-id='4674ed22' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3328'>
        <!-- Backend& Mapdesc::backend -->
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='130' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Mapdesc::Mapdesc(long int, int, int, Backend&) -->
        <function-decl name='Mapdesc' filepath='libnurbs/internals/mapdesc.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Mapdesc*' -->
          <parameter type-id='4674ed22' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='bd54fe1a'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='95e97e5e'/>
          <!-- parameter of type 'Backend&' -->
          <parameter type-id='6edb776c'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct Quiltspec -->
    <class-decl name='Quiltspec' size-in-bits='320' is-struct='yes' visibility='default' filepath='libnurbs/internals/quilt.h' line='51' column='1' id='2412cf51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int Quiltspec::stride -->
        <var-decl name='stride' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int Quiltspec::width -->
        <var-decl name='width' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int Quiltspec::offset -->
        <var-decl name='offset' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int Quiltspec::order -->
        <var-decl name='order' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int Quiltspec::index -->
        <var-decl name='index' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int Quiltspec::bdry[2] -->
        <var-decl name='bdry' type-id='e4266c7e' visibility='default' filepath='libnurbs/internals/quilt.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- REAL Quiltspec::step_size -->
        <var-decl name='step_size' type-id='234bc418' visibility='default' filepath='libnurbs/internals/quilt.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- Knot* Quiltspec::breakpoints -->
        <var-decl name='breakpoints' type-id='25406ea7' visibility='default' filepath='libnurbs/internals/quilt.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef Quiltspec* Quiltspec_ptr -->
    <typedef-decl name='Quiltspec_ptr' type-id='e8e13829' filepath='libnurbs/internals/quilt.h' line='62' column='1' id='cbe067ff'/>
    <!-- typedef REAL Knot -->
    <typedef-decl name='Knot' type-id='234bc418' filepath='libnurbs/internals/types.h' line='45' column='1' id='aee318ca'/>
    <!-- Curve& -->
    <reference-type-def kind='lvalue' type-id='218b0c8c' size-in-bits='64' id='d9feb4d6'/>
    <!-- Curve* -->
    <pointer-type-def type-id='218b0c8c' size-in-bits='64' id='e5fec7ba'/>
    <!-- Curve* const -->
    <qualified-type-def type-id='e5fec7ba' const='yes' id='d29c3a85'/>
    <!-- Flist& -->
    <reference-type-def kind='lvalue' type-id='79b62e7d' size-in-bits='64' id='5f4f9299'/>
    <!-- Knot* -->
    <pointer-type-def type-id='aee318ca' size-in-bits='64' id='25406ea7'/>
    <!-- Knotvector& -->
    <reference-type-def kind='lvalue' type-id='6954a4ec' size-in-bits='64' id='da1ade86'/>
    <!-- Mapdesc* -->
    <pointer-type-def type-id='ddf7c644' size-in-bits='64' id='4674ed22'/>
    <!-- Mapdesc* const -->
    <qualified-type-def type-id='4674ed22' const='yes' id='30de322d'/>
    <!-- Quiltspec* -->
    <pointer-type-def type-id='2412cf51' size-in-bits='64' id='e8e13829'/>
    <!-- REAL[5]* -->
    <pointer-type-def type-id='5e051f08' size-in-bits='64' id='24100286'/>
    <!-- float[4]* -->
    <pointer-type-def type-id='87305fb5' size-in-bits='64' id='7026874d'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curvelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- float[3] -->
    <array-type-def dimensions='1' type-id='a6c45d85' size-in-bits='96' id='c723f882'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <!-- Curvelist* -->
    <pointer-type-def type-id='5d0beef4' size-in-bits='64' id='d1ebbf42'/>
    <!-- Curvelist* const -->
    <qualified-type-def type-id='d1ebbf42' const='yes' id='a71deacd'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curvesub.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Curvelist& -->
    <qualified-type-def type-id='d5ebc58e' id='d5ebc58f'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/displaylist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- struct {void (NurbsTessellator*, void*)* __pfn; long int __delta;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='bcada069' visibility='default' filepath='libnurbs/internals/displaylist.h' line='46' column='1' id='b0785859'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void (NurbsTessellator*, void*)* __pfn -->
        <var-decl name='__pfn' type-id='2c7b94d4' visibility='default' filepath='libnurbs/internals/displaylist.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- long int __delta -->
        <var-decl name='__delta' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/displaylist.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __anonymous_struct__ PFVS -->
    <typedef-decl name='PFVS' type-id='b0785859' filepath='libnurbs/internals/displaylist.h' line='46' column='1' id='bcada069'/>
    <!-- struct Dlnode -->
    <class-decl name='Dlnode' size-in-bits='384' is-struct='yes' visibility='default' filepath='libnurbs/internals/displaylist.h' line='48' column='1' id='842084cd'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- PFVS Dlnode::work -->
        <var-decl name='work' type-id='bcada069' visibility='default' filepath='libnurbs/internals/displaylist.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* Dlnode::arg -->
        <var-decl name='arg' type-id='eaa32e2f' visibility='default' filepath='libnurbs/internals/displaylist.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- PFVS Dlnode::cleanup -->
        <var-decl name='cleanup' type-id='bcada069' visibility='default' filepath='libnurbs/internals/displaylist.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- Dlnode* Dlnode::next -->
        <var-decl name='next' type-id='73b7bfcd' visibility='default' filepath='libnurbs/internals/displaylist.h' line='53' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Dlnode::Dlnode(PFVS, void*, PFVS) -->
        <function-decl name='Dlnode' filepath='libnurbs/internals/displaylist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Dlnode*' -->
          <parameter type-id='73b7bfcd' is-artificial='yes'/>
          <!-- parameter of type 'typedef PFVS' -->
          <parameter type-id='bcada069'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='eaa32e2f'/>
          <!-- parameter of type 'typedef PFVS' -->
          <parameter type-id='bcada069'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class DisplayList -->
    <class-decl name='DisplayList' size-in-bits='2688' visibility='default' filepath='libnurbs/internals/displaylist.h' line='65' column='1' id='ca1d1f59'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Dlnode* DisplayList::nodes -->
        <var-decl name='nodes' type-id='73b7bfcd' visibility='default' filepath='libnurbs/internals/displaylist.h' line='73' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- Pool DisplayList::dlnodePool -->
        <var-decl name='dlnodePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/displaylist.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <!-- Dlnode** DisplayList::lastNode -->
        <var-decl name='lastNode' type-id='114318a5' visibility='default' filepath='libnurbs/internals/displaylist.h' line='75' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2624'>
        <!-- NurbsTessellator* DisplayList::nt -->
        <var-decl name='nt' type-id='5139c56b' visibility='default' filepath='libnurbs/internals/displaylist.h' line='76' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- DisplayList::DisplayList(NurbsTessellator*) -->
        <function-decl name='DisplayList' filepath='libnurbs/internals/displaylist.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'DisplayList*' -->
          <parameter type-id='7f27e761' is-artificial='yes'/>
          <!-- parameter of type 'NurbsTessellator*' -->
          <parameter type-id='5139c56b'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- DisplayList::~DisplayList(int) -->
        <function-decl name='~DisplayList' filepath='libnurbs/internals/displaylist.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'DisplayList*' -->
          <parameter type-id='7f27e761' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- DisplayList* -->
    <pointer-type-def type-id='ca1d1f59' size-in-bits='64' id='7f27e761'/>
    <!-- DisplayList* const -->
    <qualified-type-def type-id='7f27e761' const='yes' id='13785b3e'/>
    <!-- Dlnode* -->
    <pointer-type-def type-id='842084cd' size-in-bits='64' id='73b7bfcd'/>
    <!-- Dlnode** -->
    <pointer-type-def type-id='73b7bfcd' size-in-bits='64' id='114318a5'/>
    <!-- NurbsTessellator* -->
    <pointer-type-def type-id='5c7cffcb' size-in-bits='64' id='5139c56b'/>
    <!-- void (NurbsTessellator*, void*)* -->
    <pointer-type-def type-id='d945ad82' size-in-bits='64' id='2c7b94d4'/>
    <!-- void (NurbsTessellator*, void*) -->
    <function-type size-in-bits='64' id='d945ad82'>
      <!-- implicit parameter of type 'NurbsTessellator*' -->
      <parameter type-id='5139c56b' is-artificial='yes'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='eaa32e2f'/>
      <!-- void -->
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/flist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Flist* const -->
    <qualified-type-def type-id='6b4fa57d' const='yes' id='755fcf52'/>
    <!-- FlistSorter* -->
    <pointer-type-def type-id='3b7cb332' size-in-bits='64' id='0456e320'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/flistsorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- FlistSorter* const -->
    <qualified-type-def type-id='0456e320' const='yes' id='b3ced473'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/hull.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- class Hull -->
    <class-decl name='Hull' size-in-bits='4800' visibility='default' filepath='libnurbs/internals/hull.h' line='47' column='1' id='f0de652e'>
      <!-- class TrimRegion -->
      <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='48e5d3e9'/>
      <member-type access='private'>
        <!-- struct Hull::Side -->
        <class-decl name='Side' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/hull.h' line='55' column='1' id='46bb2581'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- Trimline* Hull::Side::left -->
            <var-decl name='left' type-id='46568fdb' visibility='default' filepath='libnurbs/internals/hull.h' line='56' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- Gridline* Hull::Side::line -->
            <var-decl name='line' type-id='001d2813' visibility='default' filepath='libnurbs/internals/hull.h' line='57' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- Trimline* Hull::Side::right -->
            <var-decl name='right' type-id='46568fdb' visibility='default' filepath='libnurbs/internals/hull.h' line='58' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- long int Hull::Side::index -->
            <var-decl name='index' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/hull.h' line='59' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- Hull::Side Hull::lower -->
        <var-decl name='lower' type-id='46bb2581' visibility='default' filepath='libnurbs/internals/hull.h' line='62' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- Hull::Side Hull::upper -->
        <var-decl name='upper' type-id='46bb2581' visibility='default' filepath='libnurbs/internals/hull.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- Trimline Hull::fakeleft -->
        <var-decl name='fakeleft' type-id='0aec50eb' visibility='default' filepath='libnurbs/internals/hull.h' line='64' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <!-- Trimline Hull::fakeright -->
        <var-decl name='fakeright' type-id='0aec50eb' visibility='default' filepath='libnurbs/internals/hull.h' line='65' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Hull::Hull(int, void**) -->
        <function-decl name='Hull' filepath='libnurbs/internals/hull.cc' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Hull*' -->
          <parameter type-id='eea618b4' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- artificial parameter of type 'void**' -->
          <parameter type-id='63e171df' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- Hull::~Hull(int, void**) -->
        <function-decl name='~Hull' filepath='libnurbs/internals/hull.cc' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Hull*' -->
          <parameter type-id='eea618b4' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <!-- artificial parameter of type 'void**' -->
          <parameter type-id='63e171df' is-artificial='yes'/>
          <!-- void -->
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- Gridline* -->
    <pointer-type-def type-id='77f16233' size-in-bits='64' id='001d2813'/>
    <!-- Hull* -->
    <pointer-type-def type-id='f0de652e' size-in-bits='64' id='eea618b4'/>
    <!-- Hull* const -->
    <qualified-type-def type-id='eea618b4' const='yes' id='52b546ff'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/intersect.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Bin& -->
    <qualified-type-def type-id='6eadc0e8' id='6eadc0e9'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/knotvector.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Knotvector* -->
    <pointer-type-def type-id='6954a4ec' size-in-bits='64' id='e61af16a'/>
    <!-- Knotvector* const -->
    <qualified-type-def type-id='e61af16a' const='yes' id='2955d335'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/mapdesc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/mapdescv.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/maplist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- class Maplist -->
    <class-decl name='Maplist' size-in-bits='2688' visibility='default' filepath='libnurbs/internals/maplist.h' line='46' column='1' id='90b97905'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Pool Maplist::mapdescPool -->
