<abi-corpus version='2.1' path='data/test-read-dwarf/libtest24-drop-fns.so'>
  <elf-needed>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Z3barRKSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z3fooRKSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt11char_traitsIcE6lengthEPKc' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZStplIcSt11char_traitsIcESaIcEESbIT_T0_T1_EPKS3_RKS6_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='test24-drop-fns.cc' comp-dir-path='/home/dodji/git/libabigail.git/suppr/tests/data/test-read-dwarf' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <subrange length='4' type-id='4c87fef4' id='16fe7105'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='ce184e0c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long double' size-in-bits='128' id='e095c704'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='sizetype' size-in-bits='64' id='4c87fef4'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='infinite' id='c99b5ecd'>
      <subrange length='infinite' id='031f2035'/>
    </array-type-def>
    <type-decl name='wchar_t' size-in-bits='32' id='c523b9f1'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='/usr/include/bits/types.h' line='40' column='1' id='33f57a65'/>
    <typedef-decl name='_Atomic_word' type-id='95e97e5e' filepath='/usr/include/c++/5.3.1/x86_64-redhat-linux/bits/atomic_word.h' line='32' column='1' id='e9464a99'/>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='53' column='1' id='58591d3d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='26a90f95' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='a84c031d' visibility='default' filepath='/usr/include/locale.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__FILE' type-id='ec1ed955' filepath='/usr/include/stdio.h' line='64' column='1' id='79311084'/>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='133' column='1' id='dddf6ca2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='bd54fe1a' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='80f4b756' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='55e5b2b5' visibility='default' filepath='/usr/include/wchar.h' line='83' column='1' id='87447a2e'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/wchar.h' line='86' column='1' id='ac5ab595'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='f0981eeb' visibility='default' filepath='/usr/include/wchar.h' line='88' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='8e0573fd' visibility='default' filepath='/usr/include/wchar.h' line='92' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='95e97e5e' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='ac5ab595' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='87447a2e' filepath='/usr/include/wchar.h' line='94' column='1' id='55e5b2b5'/>
    <typedef-decl name='mbstate_t' type-id='55e5b2b5' filepath='/usr/include/wchar.h' line='106' column='1' id='3d7d8cbf'/>
    <typedef-decl name='wctype_t' type-id='7359adad' filepath='/usr/include/wctype.h' line='52' column='1' id='ba50424d'/>
    <typedef-decl name='wctrans_t' type-id='a0de50cd' filepath='/usr/include/wctype.h' line='186' column='1' id='183c72c3'/>
    <typedef-decl name='size_t' type-id='7359adad' filepath='/usr/lib/gcc/x86_64-redhat-linux/5.3.1/include/stddef.h' line='216' column='1' id='b59d7dce'/>
    <typedef-decl name='wint_t' type-id='f0981eeb' filepath='/usr/lib/gcc/x86_64-redhat-linux/5.3.1/include/stddef.h' line='357' column='1' id='6dd37369'/>
    <pointer-type-def type-id='79311084' size-in-bits='64' id='b9c57915'/>
    <pointer-type-def type-id='ae3b5d4b' size-in-bits='64' id='33bb12fb'/>
    <reference-type-def kind='lvalue' type-id='a84c031d' size-in-bits='64' id='2aa915e1'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='ae3b5d4b' const='yes' id='ab34868e'/>
    <reference-type-def kind='lvalue' type-id='ab34868e' size-in-bits='64' id='2baffa78'/>
    <pointer-type-def type-id='ab34868e' size-in-bits='64' id='27aff42c'/>
    <qualified-type-def type-id='33f57a65' const='yes' id='21fd6035'/>
    <pointer-type-def type-id='21fd6035' size-in-bits='64' id='a0de50cd'/>
    <qualified-type-def type-id='c894953d' const='yes' id='4ab96a04'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <reference-type-def kind='lvalue' type-id='9b45d938' size-in-bits='64' id='8cf4ca3a'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <qualified-type-def type-id='bd54fe1a' const='yes' id='9cb2385f'/>
    <qualified-type-def type-id='3d7d8cbf' const='yes' id='7411c98f'/>
    <pointer-type-def type-id='7411c98f' size-in-bits='64' id='5d006ebf'/>
    <qualified-type-def type-id='a2185560' const='yes' id='c818c24b'/>
    <qualified-type-def type-id='c2931f67' const='yes' id='69463a72'/>
    <reference-type-def kind='lvalue' type-id='69463a72' size-in-bits='64' id='0d8dd23c'/>
    <qualified-type-def type-id='34601093' const='yes' id='08a514ce'/>
    <qualified-type-def type-id='4ababdf0' const='yes' id='b5b164a0'/>
    <qualified-type-def type-id='d3b6d5a2' const='yes' id='1c751112'/>
    <qualified-type-def type-id='e967275f' const='yes' id='dda95aaf'/>
    <qualified-type-def type-id='4a30a7f0' const='yes' id='24010e40'/>
    <reference-type-def kind='lvalue' type-id='24010e40' size-in-bits='64' id='13a9aa92'/>
    <qualified-type-def type-id='dddf6ca2' const='yes' id='e824a34f'/>
    <pointer-type-def type-id='e824a34f' size-in-bits='64' id='d6ad37ff'/>
    <qualified-type-def type-id='7359adad' const='yes' id='9cbd1c16'/>
    <qualified-type-def type-id='c523b9f1' const='yes' id='effb3702'/>
    <pointer-type-def type-id='effb3702' size-in-bits='64' id='f077d3f8'/>
    <pointer-type-def type-id='f077d3f8' size-in-bits='64' id='5ea27396'/>
    <pointer-type-def type-id='58591d3d' size-in-bits='64' id='d83ac36d'/>
    <pointer-type-def type-id='3d7d8cbf' size-in-bits='64' id='a68021ce'/>
    <pointer-type-def type-id='a8e08226' size-in-bits='64' id='d5983a0b'/>
    <pointer-type-def type-id='ce184e0c' size-in-bits='64' id='38f76a2a'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='c523b9f1' size-in-bits='64' id='323d93c1'/>
    <pointer-type-def type-id='323d93c1' size-in-bits='64' id='01efdaf1'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='ec1ed955'/>
    <namespace-decl name='std'>
      <class-decl name='allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='92' column='1' id='eb166b35'>
        <base-class access='public' layout-offset-in-bits='0' type-id='ae3b5d4b'/>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='95' column='1' id='ea4606d6'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='2aa915e1' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='99' column='1' id='8fee2199'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='8cf4ca3a' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='100' column='1' id='000926f5'/>
        </member-type>
      </class-decl>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2510' column='1' id='c2931f67'>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='eb166b35' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2518' column='1' id='582e2ec8'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='ea4606d6' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2519' column='1' id='4ababdf0'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='8fee2199' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2521' column='1' id='1f65a6a3'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='000926f5' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2522' column='1' id='856a05f3'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='60a45a77' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2525' column='1' id='5cf73f8c'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='f9b78d2a' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2527' column='1' id='aa23c7bc'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='0404b734' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2528' column='1' id='fca5e6cf'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='20ab28bd' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2529' column='1' id='cfe1a53f'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2546' column='1' id='6c007811'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='4ababdf0' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2548' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='4ababdf0' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2549' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='e9464a99' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2550' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2553' column='1' id='34601093'>
            <base-class access='public' layout-offset-in-bits='0' type-id='6c007811'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='b5b164a0' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.tcc' line='494' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='9b45d938' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.tcc' line='499' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='c99b5ecd' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.tcc' line='510' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2670' column='1' id='bab0e33c'>
            <base-class access='public' layout-offset-in-bits='0' type-id='eb166b35'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='26a90f95' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2675' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='b5b164a0' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2683' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='bab0e33c' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2687' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='char_traits&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='233' column='1' id='6382fa58'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='a84c031d' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='235' column='1' id='d3b6d5a2'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='95e97e5e' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='236' column='1' id='e967275f'/>
        </member-type>
      </class-decl>
      <typedef-decl name='string' type-id='c2931f67' filepath='/usr/include/c++/5.3.1/bits/stringfwd.h' line='74' column='1' id='4a30a7f0'/>
      <typedef-decl name='ostream' type-id='774b367d' filepath='/usr/include/c++/5.3.1/iosfwd' line='141' column='1' id='a8e08226'/>
      <typedef-decl name='size_t' type-id='7359adad' filepath='/usr/include/c++/5.3.1/x86_64-redhat-linux/bits/c++config.h' line='1969' column='1' id='7a51dc7f'/>
      <class-decl name='basic_ostream&lt;char, std::char_traits&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='774b367d'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char const*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='0404b734'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='20ab28bd'/>
      <function-decl name='operator+&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' mangled-name='_ZStplIcSt11char_traitsIcESaIcEESbIT_T0_T1_EPKS3_RKS6_' filepath='/usr/include/c++/5.3.1/bits/basic_string.tcc' line='1151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZStplIcSt11char_traitsIcESaIcEESbIT_T0_T1_EPKS3_RKS6_'>
        <parameter type-id='80f4b756' name='__lhs' filepath='/usr/include/c++/5.3.1/bits/basic_string.tcc' line='1151' column='1'/>
        <parameter type-id='0d8dd23c' name='__rhs' filepath='/usr/include/c++/5.3.1/bits/basic_string.tcc' line='1152' column='1'/>
        <return type-id='c2931f67'/>
      </function-decl>
    </namespace-decl>
    <function-decl name='foo' mangled-name='_Z3fooRKSs' filepath='/home/dodji/git/libabigail.git/suppr/tests/data/test-read-dwarf/test24-drop-fns.cc' line='14' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z3fooRKSs'>
      <parameter type-id='13a9aa92' name='s' filepath='/home/dodji/git/libabigail.git/suppr/tests/data/test-read-dwarf/test24-drop-fns.cc' line='14' column='1'/>
      <return type-id='4a30a7f0'/>
    </function-decl>
    <function-decl name='bar' mangled-name='_Z3barRKSs' filepath='/home/dodji/git/libabigail.git/suppr/tests/data/test-read-dwarf/test24-drop-fns.cc' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z3barRKSs'>
      <parameter type-id='13a9aa92' name='str' filepath='/home/dodji/git/libabigail.git/suppr/tests/data/test-read-dwarf/test24-drop-fns.cc' line='21' column='1'/>
      <return type-id='d5983a0b'/>
    </function-decl>
    <namespace-decl name='__gnu_cxx'>
      <class-decl name='new_allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/5.3.1/ext/new_allocator.h' line='58' column='1' id='ae3b5d4b'>
        <member-type access='public'>
