<abi-corpus path='data/test-read-dwarf/libtest23.so'>
  <elf-needed>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Z4emitRSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z4emitRSsS_' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='test23-first-tu.cc' comp-dir-path='/home/dodji/git/libabigail/PR20369/tests/data/test-read-dwarf' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='ce184e0c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long double' size-in-bits='128' id='e095c704'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <class-decl name='__anonymous_struct__1' is-struct='yes' is-anonymous='yes' visibility='default' id='5c18d754'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='infinite' id='c99b5ecd'>
      <subrange length='infinite' id='031f2035'/>
    </array-type-def>
    <type-decl name='void' id='48b5725f'/>
    <type-decl name='wchar_t' size-in-bits='32' id='c523b9f1'/>
    <typedef-decl name='wint_t' type-id='f0981eeb' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='353' column='1' id='6dd37369'/>
    <typedef-decl name='__FILE' type-id='ec1ed955' filepath='/usr/include/stdio.h' line='64' column='1' id='79311084'/>
    <typedef-decl name='size_t' type-id='7359adad' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='212' column='1' id='b59d7dce'/>
    <typedef-decl name='mbstate_t' type-id='55e5b2b5' filepath='/usr/include/wchar.h' line='106' column='1' id='3d7d8cbf'/>
    <typedef-decl name='__mbstate_t' type-id='4a31ae3a' filepath='/usr/include/wchar.h' line='94' column='1' id='55e5b2b5'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='55e5b2b5' visibility='default' filepath='/usr/include/wchar.h' line='83' column='1' id='4a31ae3a'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' is-anonymous='yes' visibility='default' is-declaration-only='yes' id='2a125a28'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='95e97e5e' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='2a125a28' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='133' column='1' id='dddf6ca2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='95e97e5e' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='bd54fe1a' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='80f4b756' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wctype_t' type-id='7359adad' filepath='/usr/include/wctype.h' line='52' column='1' id='ba50424d'/>
    <typedef-decl name='wctrans_t' type-id='a0de50cd' filepath='/usr/include/wctype.h' line='186' column='1' id='183c72c3'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='/usr/include/bits/types.h' line='40' column='1' id='33f57a65'/>
    <pointer-type-def type-id='79311084' size-in-bits='64' id='b9c57915'/>
    <pointer-type-def type-id='5c18d754' size-in-bits='64' id='8567d8b0'/>
    <reference-type-def kind='lvalue' type-id='a84c031d' size-in-bits='64' id='2aa915e1'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='33f57a65' const='yes' id='21fd6035'/>
    <pointer-type-def type-id='21fd6035' size-in-bits='64' id='a0de50cd'/>
    <qualified-type-def type-id='59a919f8' const='yes' id='45157073'/>
    <reference-type-def kind='lvalue' type-id='45157073' size-in-bits='64' id='15bfd5cf'/>
    <qualified-type-def type-id='c894953d' const='yes' id='4ab96a04'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <reference-type-def kind='lvalue' type-id='9b45d938' size-in-bits='64' id='8cf4ca3a'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <qualified-type-def type-id='bd54fe1a' const='yes' id='9cb2385f'/>
    <qualified-type-def type-id='3d7d8cbf' const='yes' id='7411c98f'/>
    <pointer-type-def type-id='7411c98f' size-in-bits='64' id='5d006ebf'/>
    <qualified-type-def type-id='a2185560' const='yes' id='c818c24b'/>
    <qualified-type-def type-id='c2931f67' const='yes' id='69463a72'/>
    <reference-type-def kind='lvalue' type-id='69463a72' size-in-bits='64' id='0d8dd23c'/>
    <pointer-type-def type-id='69463a72' size-in-bits='64' id='118dd888'/>
    <qualified-type-def type-id='34601093' const='yes' id='08a514ce'/>
    <qualified-type-def type-id='4ababdf0' const='yes' id='b5b164a0'/>
    <qualified-type-def type-id='dddf6ca2' const='yes' id='e824a34f'/>
    <pointer-type-def type-id='e824a34f' size-in-bits='64' id='d6ad37ff'/>
    <qualified-type-def type-id='7359adad' const='yes' id='9cbd1c16'/>
    <qualified-type-def type-id='c523b9f1' const='yes' id='effb3702'/>
    <pointer-type-def type-id='effb3702' size-in-bits='64' id='f077d3f8'/>
    <pointer-type-def type-id='f077d3f8' size-in-bits='64' id='5ea27396'/>
    <pointer-type-def type-id='3d7d8cbf' size-in-bits='64' id='a68021ce'/>
    <reference-type-def kind='lvalue' type-id='c2931f67' size-in-bits='64' id='1a9350bb'/>
    <pointer-type-def type-id='c2931f67' size-in-bits='64' id='16934a6f'/>
    <reference-type-def kind='lvalue' type-id='34601093' size-in-bits='64' id='6f1c93e7'/>
    <pointer-type-def type-id='34601093' size-in-bits='64' id='631c8103'/>
    <qualified-type-def type-id='0f5b8043' id='0f5b8044'/>
    <reference-type-def kind='lvalue' type-id='4a30a7f0' size-in-bits='64' id='0f5b8043'/>
    <pointer-type-def type-id='ce184e0c' size-in-bits='64' id='38f76a2a'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='c523b9f1' size-in-bits='64' id='323d93c1'/>
    <pointer-type-def type-id='323d93c1' size-in-bits='64' id='01efdaf1'/>
    <class-decl name='allocator&lt;char&gt;' visibility='default' is-declaration-only='yes' id='59a919f8'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='95' column='1' id='d153148f'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='difference_type' type-id='d368b855' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='96' column='1' id='424382a1'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='2aa915e1' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='99' column='1' id='4d4057d8'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='8cf4ca3a' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='100' column='1' id='f8e8bbf8'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='26a90f95' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='97' column='1' id='d240d638'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='80f4b756' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='98' column='1' id='6b85af58'/>
      </member-type>
    </class-decl>
    <class-decl name='char_traits&lt;char&gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='571f63b1'>
      <member-type access='public'>
        <typedef-decl name='char_type' type-id='a84c031d' filepath='/usr/include/c++/4.8.2/bits/char_traits.h' line='235' column='1' id='6a69a307'/>
      </member-type>
    </class-decl>
    <class-decl name='rebind&lt;char&gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='6733e07d'>
      <member-type access='public'>
        <typedef-decl name='other' type-id='59a919f8' filepath='/usr/include/c++/4.8.2/bits/allocator.h' line='105' column='1' id='b3795e32'/>
      </member-type>
    </class-decl>
    <namespace-decl name='__gnu_cxx'>
      <class-decl name='__normal_iterator&lt;char*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='60a45a77'/>
      <class-decl name='__normal_iterator&lt;char const*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='f9b78d2a'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <typedef-decl name='string' type-id='c2931f67' filepath='/usr/include/c++/4.8.2/bits/stringfwd.h' line='62' column='1' id='4a30a7f0'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='112' column='1' id='c2931f67'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='d153148f' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='121' column='1' id='4ababdf0'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='_CharT_alloc_type' type-id='b3795e32' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='114' column='1' id='aeefc6a8'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='traits_type' type-id='571f63b1' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='118' column='1' id='19935e14'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='6a69a307' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='119' column='1' id='20401f70'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='59a919f8' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='120' column='1' id='582e2ec8'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='424382a1' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='122' column='1' id='2e8d8eee'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='4d4057d8' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='123' column='1' id='1f65a6a3'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='f8e8bbf8' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='124' column='1' id='856a05f3'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='d240d638' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='125' column='1' id='5e42d43f'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='6b85af58' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='126' column='1' id='cbc46cef'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='60a45a77' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='127' column='1' id='5cf73f8c'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='f9b78d2a' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='129' column='1' id='aa23c7bc'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='0404b734' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='130' column='1' id='fca5e6cf'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='20ab28bd' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='131' column='1' id='cfe1a53f'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' is-struct='yes' visibility='default' is-declaration-only='yes' id='bab0e33c'>
            <member-function access='public' static='yes' constructor='yes'>
              <function-decl name='_Alloc_hider' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' is-struct='yes' visibility='default' is-declaration-only='yes' id='6c007811'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' is-struct='yes' visibility='default' is-declaration-only='yes' id='34601093'>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='b5b164a0' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='50' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='9b45d938' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='55' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='c99b5ecd' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='66' column='1'/>
            </data-member>
            <member-function access='public' static='yes'>
              <function-decl name='_S_empty_rep' mangled-name='_ZNSs4_Rep12_S_empty_repEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='6f1c93e7'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes' const='yes'>
              <function-decl name='_M_is_leaked' mangled-name='_ZNKSs4_Rep12_M_is_leakedEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='c894953d'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes' const='yes'>
              <function-decl name='_M_is_shared' mangled-name='_ZNKSs4_Rep12_M_is_sharedEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='c894953d'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_M_set_leaked' mangled-name='_ZNSs4_Rep13_M_set_leakedEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_M_set_sharable' mangled-name='_ZNSs4_Rep15_M_set_sharableEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_M_set_length_and_sharable' mangled-name='_ZNSs4_Rep26_M_set_length_and_sharableEm' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_M_refdata' mangled-name='_ZNSs4_Rep10_M_refdataEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='26a90f95'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_M_grab' mangled-name='_ZNSs4_Rep7_M_grabERKSaIcES2_' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='26a90f95'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_S_create' mangled-name='_ZNSs4_Rep9_S_createEmmRKSaIcE' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='545' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='631c8103'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_M_dispose' mangled-name='_ZNSs4_Rep10_M_disposeERKSaIcE' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_M_destroy' mangled-name='_ZNSs4_Rep10_M_destroyERKSaIcE' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='444' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_M_refcopy' mangled-name='_ZNSs4_Rep10_M_refcopyEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='26a90f95'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_M_clone' mangled-name='_ZNSs4_Rep8_M_cloneERKSaIcEm' filepath='/usr/include/c++/4.8.2/bits/basic_string.tcc' line='623' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='26a90f95'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='b5b164a0' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='285' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='bab0e33c' visibility='default' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='289' column='1'/>
        </data-member>
        <member-function access='private' const='yes'>
          <function-decl name='_M_data' mangled-name='_ZNKSs7_M_dataEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='118dd888' is-artificial='yes'/>
            <return type-id='26a90f95'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_data' mangled-name='_ZNSs7_M_dataEPc' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='16934a6f' is-artificial='yes'/>
            <parameter type-id='26a90f95'/>
            <return type-id='26a90f95'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='_M_rep' mangled-name='_ZNKSs6_M_repEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='300' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='118dd888' is-artificial='yes'/>
            <return type-id='631c8103'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='_M_ibegin' mangled-name='_ZNKSs9_M_ibeginEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='118dd888' is-artificial='yes'/>
            <return type-id='5cf73f8c'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='_M_iend' mangled-name='_ZNKSs7_M_iendEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='310' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='118dd888' is-artificial='yes'/>
            <return type-id='5cf73f8c'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_leak' mangled-name='_ZNSs7_M_leakEv' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='16934a6f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='_M_check' mangled-name='_ZNKSs8_M_checkEmPKc' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='321' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='118dd888' is-artificial='yes'/>
            <parameter type-id='4ababdf0'/>
            <parameter type-id='80f4b756'/>
            <return type-id='4ababdf0'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='_M_check_length' mangled-name='_ZNKSs15_M_check_lengthEmmPKc' filepath='/usr/include/c++/4.8.2/bits/basic_string.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='118dd888' is-artificial='yes'/>
            <parameter type-id='4ababdf0'/>
            <parameter type-id='4ababdf0'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
