<abi-corpus version='2.1' path='data/test-read-dwarf/PR25007-sdhci.ko'>
  <elf-function-symbols>
    <elf-symbol name='__sdhci_add_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x74ae518'/>
    <elf-symbol name='__sdhci_read_caps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x711f65c'/>
    <elf-symbol name='sdhci_add_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x7bfb1b1a'/>
    <elf-symbol name='sdhci_adma_write_desc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x61fdb22'/>
    <elf-symbol name='sdhci_alloc_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xfeefe08b'/>
    <elf-symbol name='sdhci_calc_clk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xbfcabe7e'/>
    <elf-symbol name='sdhci_cleanup_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x380506bd'/>
    <elf-symbol name='sdhci_cqe_disable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x69b1936e'/>
    <elf-symbol name='sdhci_cqe_enable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5ebbc838'/>

    <elf-symbol name='sdhci_free_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4626d735'/>
    <elf-symbol name='sdhci_remove_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x6be911b2'/>
    <elf-symbol name='sdhci_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x762121fa'/>
    <elf-symbol name='sdhci_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1a38d936'/>
    <elf-symbol name='sdhci_reset_tuning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd0ca49ae'/>
    <elf-symbol name='sdhci_resume_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x2e5157bf'/>
    <elf-symbol name='sdhci_runtime_resume_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x62e5c15d'/>
    <elf-symbol name='sdhci_runtime_suspend_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4526a0d1'/>
    <elf-symbol name='sdhci_send_command' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1512952'/>
    <elf-symbol name='sdhci_send_tuning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x213a51d7'/>
    <elf-symbol name='sdhci_set_bus_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x67f74689'/>
    <elf-symbol name='sdhci_set_clock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5825825c'/>
    <elf-symbol name='sdhci_set_ios' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xddc78000'/>
    <elf-symbol name='sdhci_set_power' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc9e167b5'/>
    <elf-symbol name='sdhci_set_power_noreg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x60affb80'/>
    <elf-symbol name='sdhci_set_uhs_signaling' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4015e747'/>
    <elf-symbol name='sdhci_setup_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc5d73caf'/>
    <elf-symbol name='sdhci_start_signal_voltage_switch' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xcb9c7748'/>
    <elf-symbol name='sdhci_start_tuning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x39f40b95'/>
    <elf-symbol name='sdhci_suspend_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa6de7a42'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.c' comp-dir-path='/ws/android/kernel/aosp/common-mainline/out/android-mainline/common' language='LANG_C89'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <array-type-def dimensions='1' type-id='3f1a6b60' size-in-bits='64' id='839e8989'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3f1a6b60' size-in-bits='96' id='3fa05d14'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='d3130597' size-in-bits='128' id='8a7b7524'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='128' id='9396cabb'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='72' id='060772ed'>
      <subrange length='9' type-id='7ff19f0f' id='12e4273c'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7e2609cc' size-in-bits='4096' id='98f84070'>
      <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='f22a8abb' size-in-bits='256' id='b6b7435e'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <array-type-def dimensions='1' type-id='162c1c01' size-in-bits='256' id='68694f49'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='2048' id='2e646d82'>
      <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='192' id='461c9ed2'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1024' id='e3204322'>
      <subrange length='128' type-id='7ff19f0f' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='128' id='ac1fa8c0'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='16384' id='41bf80f3'>
      <subrange length='2048' type-id='7ff19f0f' id='e5323efb'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='7ff19f0f' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' id='16dc656a'>
      <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='448' id='6093ff7c'>
      <subrange length='56' type-id='7ff19f0f' id='f8137894'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='48' id='4a008bc3'>
      <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' id='8e100159'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='bd561d05' size-in-bits='192' id='59bd9302'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='47841236' size-in-bits='256' id='bb2d0d4e'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e151255a' size-in-bits='256' id='fc3a8480'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='03a4a074' size-in-bits='512' id='3f6e320a'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='1851ab9f' size-in-bits='4096' id='cb01bf4b'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7e666abe' size-in-bits='192' id='e6ff92fb'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='128' id='2020bac4'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a21c4412' size-in-bits='16384' id='02d77f24'>
      <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='094d8048' size-in-bits='infinite' id='da6e2919'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='72f469ec' size-in-bits='384' id='e8ef2bd5'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='f6507b0a' size-in-bits='infinite' id='b969bd7a'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='47479831' id='9c02e2a6'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <array-type-def dimensions='1' type-id='b0690d78' size-in-bits='1728' id='83ae09a1'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='cc256810' size-in-bits='2016' id='67d619b5'>
      <subrange length='7' type-id='7ff19f0f' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='47f117d4' size-in-bits='128' id='c2c0ece0'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ce848ab1' size-in-bits='2688' id='a09ef5a6'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='2bf16f59' size-in-bits='1024' id='18b1b6ec'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b9419dc5' size-in-bits='128' id='c7e7059f'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b94e5398' size-in-bits='256' id='3449295e'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e878d564' size-in-bits='1344' id='55d1e02d'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='2a8a6332' size-in-bits='384' id='d46544fa'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='60dcbf6c' size-in-bits='2048' id='80f344e1'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='c1880945' size-in-bits='448' id='4abea81e'>
      <subrange length='7' type-id='7ff19f0f' id='16fc326e'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='8dee6d89' size-in-bits='192' id='2f7565c6'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='56798c81' size-in-bits='2304' id='01115b96'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <typedef-decl name='__uint128_t' type-id='4f340252' id='7e2609cc'/>
    <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='512' id='02fdec64'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='64' id='1872161b'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='128' id='1c6c0c39'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='512' id='6094c99c'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='24' id='930ea9f9'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='32' id='931565be'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='64' id='d2f7b56a'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned __int128' size-in-bits='128' id='4f340252'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='256' id='fc872715'>
      <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='64' id='f066dd3c'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='128' id='f05e8e77'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='2944' id='d964a553'>
      <subrange length='46' type-id='7ff19f0f' id='8b86bc1b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='256' id='f46d9f4d'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='infinite' id='c99b5ecd'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <array-type-def dimensions='1' type-id='120c01b5' size-in-bits='128' id='9a69aeec'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='2ae08426' size-in-bits='256' id='ae25b7bc'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='256' id='209ef23f'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <class-decl name='dev_archdata' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/device.h' line='8' column='1' id='d3e142f5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iommu' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/device.h' line='10' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='exception_table_entry' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/extable.h' line='18' column='1' id='da1095b6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='insn' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/extable.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fixup' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/extable.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mm_context_t' size-in-bits='192' is-struct='yes' naming-typedef-id='0eb9c3fd' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/mmu.h' line='19' column='1' id='46f77458'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='28ee064c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/mmu.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vdso' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/mmu.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/mmu.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mm_context_t' type-id='46f77458' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/mmu.h' line='23' column='1' id='0eb9c3fd'/>
    <class-decl name='mod_plt_sec' size-in-bits='96' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='13' column='1' id='1615ea0e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='plt_shndx' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='plt_num_entries' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='plt_max_entries' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mod_arch_specific' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='19' column='1' id='ea05c185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='core' type-id='1615ea0e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='init' type-id='1615ea0e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ftrace_trampoline' type-id='72ece9e2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='plt_entry' size-in-bits='96' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='41' column='1' id='2519c394'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='adrp' type-id='2f162548' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='add' type-id='2f162548' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='br' type-id='2f162548' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/module.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pgtable_t' type-id='02f11ed4' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/page.h' line='27' column='1' id='c28b9700'/>
    <typedef-decl name='pteval_t' type-id='91ce1af9' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='14' column='1' id='e044eb0d'/>
    <typedef-decl name='pmdval_t' type-id='91ce1af9' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='15' column='1' id='cb5c7c0f'/>
    <typedef-decl name='pgdval_t' type-id='91ce1af9' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='17' column='1' id='df6d7e75'/>
    <class-decl name='pte_t' size-in-bits='64' is-struct='yes' naming-typedef-id='4b2795fc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='22' column='1' id='c50bf92f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pte' type-id='e044eb0d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pte_t' type-id='c50bf92f' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='22' column='1' id='4b2795fc'/>
    <class-decl name='pmd_t' size-in-bits='64' is-struct='yes' naming-typedef-id='9ecf9226' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='27' column='1' id='b7942455'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pmd' type-id='cb5c7c0f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pmd_t' type-id='b7942455' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='27' column='1' id='9ecf9226'/>
    <class-decl name='pgd_t' size-in-bits='64' is-struct='yes' naming-typedef-id='12aa8ce4' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='38' column='1' id='36d456a7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pgd' type-id='df6d7e75' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pgd_t' type-id='36d456a7' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='38' column='1' id='12aa8ce4'/>
    <class-decl name='pgprot_t' size-in-bits='64' is-struct='yes' naming-typedef-id='2e2dcbd3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='42' column='1' id='5a777ec6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pgprot' type-id='e044eb0d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pgprot_t' type-id='5a777ec6' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pgtable-types.h' line='42' column='1' id='2e2dcbd3'/>
    <class-decl name='ptrauth_key' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pointer_auth.h' line='17' column='1' id='490938eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lo' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pointer_auth.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hi' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pointer_auth.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ptrauth_keys' size-in-bits='640' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pointer_auth.h' line='25' column='1' id='91841748'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='apia' type-id='490938eb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pointer_auth.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='apib' type-id='490938eb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pointer_auth.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='apda' type-id='490938eb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pointer_auth.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='apdb' type-id='490938eb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pointer_auth.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='apga' type-id='490938eb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/pointer_auth.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='debug_info' size-in-bits='2176' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='97' column='1' id='2f821a8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='suspended_step' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bps_disabled' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wps_disabled' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hbp_break' type-id='18b1b6ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='hbp_watch' type-id='18b1b6ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpu_context' size-in-bits='832' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='110' column='1' id='6a577ca5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x19' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x20' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x21' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x22' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x23' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x24' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x25' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='x26' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x27' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='x28' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fp' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='sp' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pc' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='thread_struct' size-in-bits='8448' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='126' column='1' id='0c8a83c7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cpu_context' type-id='6a577ca5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='uw' type-id='e7f43f72' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='fpsimd_cpu' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='sve_state' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='sve_vl' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5408'>
        <var-decl name='sve_vl_onexec' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='fault_address' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='fault_code' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='debug' type-id='2f821a8d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='keys_user' type-id='91841748' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='148' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='4352' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='134' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_value' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp2_value' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fpsimd_state' type-id='3cb82f3a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mm_segment_t' type-id='7359adad' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='23' column='1' id='f079b4db'/>
    <class-decl name='thread_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='28' column='1' id='575a2c7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addr_limit' type-id='f079b4db' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='ac5ab595' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__11' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='34' column='1' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='preempt_count' type-id='91ce1af9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='35' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='preempt' type-id='e7f43f73' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='44' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='36' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='need_resched' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/thread_info.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='arch_uprobe_task' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/uprobes.h' line='21' column='1' id='79aea64f'/>
    <class-decl name='user_fpsimd_state' size-in-bits='4224' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/uapi/asm/ptrace.h' line='81' column='1' id='3cb82f3a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vregs' type-id='98f84070' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/uapi/asm/ptrace.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='fpsr' type-id='3f1a6b60' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/uapi/asm/ptrace.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='fpcr' type-id='3f1a6b60' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/uapi/asm/ptrace.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='__reserved' type-id='839e8989' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/uapi/asm/ptrace.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sdhci_host' size-in-bits='8704' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='371' column='1' id='9d22e201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hw_name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='quirks' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='quirks2' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='irq' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ioaddr' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bounce_buffer' type-id='26a90f95' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bounce_addr' type-id='cf29c9b3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bounce_buffer_size' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ops' type-id='4ba2bd6c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mmc' type-id='dd575c43' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='mmc_host_ops' type-id='f2d6d1c0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='dma_mask' type-id='91ce1af9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='led' type-id='6e0e17b0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='led_name' type-id='16dc656a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5024'>
        <var-decl name='flags' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='version' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5088'>
        <var-decl name='max_clk' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='timeout_clk' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5152'>
        <var-decl name='clk_mul' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='clock' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='pwr' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5224'>
        <var-decl name='runtime_suspended' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5232'>
        <var-decl name='bus_on' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5240'>
        <var-decl name='preset_enabled' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='pending_reset' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5256'>
        <var-decl name='irq_wake_enabled' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5264'>
        <var-decl name='v4_mode' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='mrqs_done' type-id='c2c0ece0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='cmd' type-id='6df3750c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='data_cmd' type-id='6df3750c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='data' type-id='6de64ec1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='data_early' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='sg_miter' type-id='52378ac1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='blocks' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='sg_count' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='adma_table' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='align_buffer' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='adma_table_sz' type-id='b59d7dce' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='align_buffer_sz' type-id='b59d7dce' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='adma_addr' type-id='cf29c9b3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='align_addr' type-id='cf29c9b3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='desc_sz' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='complete_wq' type-id='242e3d19' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='complete_work' type-id='ef9025d0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='timer' type-id='abe41e67' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='data_timer' type-id='abe41e67' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='caps' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7776'>
        <var-decl name='caps1' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='read_caps' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7840'>
        <var-decl name='ocr_avail_sdio' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7872'>
        <var-decl name='ocr_avail_sd' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7904'>
        <var-decl name='ocr_avail_mmc' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='ocr_mask' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7968'>
        <var-decl name='timing' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='thread_isr' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8032'>
        <var-decl name='ier' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='cqe_on' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8096'>
        <var-decl name='cqe_ier' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8128'>
        <var-decl name='cqe_err_ier' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='buf_ready_int' type-id='b5ab048f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='tuning_done' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='586' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8416'>
        <var-decl name='tuning_count' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='tuning_mode' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8480'>
        <var-decl name='tuning_err' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='tuning_delay' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='tuning_loop_count' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='sdma_boundary' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8608'>
        <var-decl name='adma_table_cnt' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='data_timeout' type-id='91ce1af9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='private' type-id='c99b5ecd' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='606' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sdhci_ops' size-in-bits='1280' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='609' column='1' id='63b6be81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='set_clock' type-id='98dbb7da' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='set_power' type-id='71399c6f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='irq' type-id='02663b56' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='enable_dma' type-id='a9d7e307' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_max_clock' type-id='601d7eac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='get_min_clock' type-id='601d7eac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_timeout_clock' type-id='601d7eac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_max_timeout_count' type-id='601d7eac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='set_timeout' type-id='3fec7331' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='set_bus_width' type-id='288e0067' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='platform_send_init_74_clocks' type-id='30c362fc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='get_ro' type-id='601d7eac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='636' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reset' type-id='30c362fc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='platform_execute_tuning' type-id='d846c996' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='set_uhs_signaling' type-id='98dbb7da' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='639' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='hw_reset' type-id='13daec78' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='adma_workaround' type-id='bb4db0f7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='card_event' type-id='13daec78' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='voltage_switch' type-id='13daec78' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='adma_write_desc' type-id='7a3863fd' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.h' line='644' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='atomic_long_t' type-id='28ee064c' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/atomic-long.h' line='12' column='1' id='f22a8abb'/>
    <class-decl name='bug_entry' size-in-bits='96' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='23' column='1' id='93630c4e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bug_addr_disp' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='file_disp' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='8efea9e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='flags' type-id='8efea9e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='s8' type-id='8af57d41' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='16' column='1' id='fdbf7a0f'/>
    <typedef-decl name='u8' type-id='8f048e17' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='17' column='1' id='f9b06939'/>
    <typedef-decl name='u16' type-id='d315442e' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='19' column='1' id='1dc6a898'/>
    <typedef-decl name='s32' type-id='3158a266' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='20' column='1' id='a7832498'/>
    <typedef-decl name='u32' type-id='3f1a6b60' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='21' column='1' id='19c2251e'/>
    <typedef-decl name='s64' type-id='49659421' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='22' column='1' id='9b7c55ef'/>
    <typedef-decl name='u64' type-id='d3130597' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/int-ll64.h' line='23' column='1' id='91ce1af9'/>
    <class-decl name='pud_t' size-in-bits='64' is-struct='yes' naming-typedef-id='ac9f3c7e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/pgtable-nop4d-hack.h' line='15' column='1' id='5f20754d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pgd' type-id='12aa8ce4' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/pgtable-nop4d-hack.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pud_t' type-id='5f20754d' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/pgtable-nop4d-hack.h' line='15' column='1' id='ac9f3c7e'/>
    <class-decl name='qrwlock' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='13' column='1' id='319e0e18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab596' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='wait_lock' type-id='641c41d1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__28' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='14' column='1' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='cnts' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='15' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f74' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='16' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='16' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wlocked' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='__lstate' type-id='930ea9f9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='19' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='arch_rwlock_t' type-id='319e0e18' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qrwlock_types.h' line='27' column='1' id='fed2d8ee'/>
    <class-decl name='qspinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='22' column='1' id='c167abfb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab597' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='23' column='1' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='val' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='24' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f75' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='32' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='36' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='32' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pending' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='36' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked_pending' type-id='1dc6a898' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tail' type-id='1dc6a898' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='arch_spinlock_t' type-id='c167abfb' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/qspinlock_types.h' line='52' column='1' id='641c41d1'/>
    <class-decl name='assoc_array' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/assoc_array.h' line='22' column='1' id='b58d1e12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='815cf0d3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/assoc_array.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nr_leaves_on_tree' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/assoc_array.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernel_cap_struct' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/capability.h' line='24' column='1' id='923128a5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cap' type-id='839e8989' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/capability.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='kernel_cap_t' type-id='923128a5' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/capability.h' line='26' column='1' id='7496b151'/>
    <class-decl name='completion' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/completion.h' line='26' column='1' id='f9fef04f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='done' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/completion.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait' type-id='b5ab048f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/completion.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpumask' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cpumask.h' line='16' column='1' id='1354385d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits' type-id='f066dd3c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cpumask.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cpumask_t' type-id='1354385d' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cpumask.h' line='16' column='1' id='90bc6bed'/>
    <class-decl name='group_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='25' column='1' id='781993c9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='usage' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ngroups' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gid' type-id='da6e2919' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cred' size-in-bits='1344' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='111' column='1' id='6739dd09'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='usage' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uid' type-id='d80b72e6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gid' type-id='094d8048' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='suid' type-id='d80b72e6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sgid' type-id='094d8048' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='euid' type-id='d80b72e6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='egid' type-id='094d8048' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='fsuid' type-id='d80b72e6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fsgid' type-id='094d8048' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='securebits' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cap_inheritable' type-id='7496b151' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cap_permitted' type-id='7496b151' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cap_effective' type-id='7496b151' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cap_bset' type-id='7496b151' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cap_ambient' type-id='7496b151' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='jit_keyring' type-id='002ac4a6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='session_keyring' type-id='204a4632' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='process_keyring' type-id='204a4632' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='thread_keyring' type-id='204a4632' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='request_key_auth' type-id='204a4632' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='security' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='user' type-id='273a7d34' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='user_ns' type-id='c0ced320' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='group_info' type-id='383471a1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='' type-id='ac5ab598' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='149' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__19' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='149' column='1' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='non_rcu' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='150' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='151' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='qstr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='47' column='1' id='02244303'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab599' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='354f7eb9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='48' column='1' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f77' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='49' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hash_len' type-id='91ce1af9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='52' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='49' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='len' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dentry' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='89' column='1' id='d6ebca75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_flags' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='d_seq' type-id='e14c3b11' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_hash' type-id='8db0df1b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_parent' type-id='27675065' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='d_name' type-id='02244303' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='d_inode' type-id='7e666abe' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='d_iname' type-id='fc872715' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='d_lockref' type-id='60efdfd3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='d_op' type-id='1ee57353' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='d_sb' type-id='42c8f564' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='d_time' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='d_fsdata' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='' type-id='ac5ab59a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='d_child' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='d_subdirs' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='d_u' type-id='ac5ab59b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__32' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='107' column='1' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='d_lru' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='108' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='d_wait' type-id='03d48e96' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='109' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__33' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='116' column='1' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='d_alias' type-id='03a4a074' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='117' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='d_in_lookup_hash' type-id='8db0df1b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='118' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='d_rcu' type-id='e3d8ce29' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='119' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='dentry_operations' size-in-bits='1024' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='135' column='1' id='e4992400'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_revalidate' type-id='30ab2c05' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_weak_revalidate' type-id='30ab2c05' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_hash' type-id='65cea51e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_compare' type-id='fb86b772' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='d_delete' type-id='a50c1d00' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='d_init' type-id='6241aa4f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='d_release' type-id='f42e15b8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='d_prune' type-id='f42e15b8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='d_iput' type-id='40363cbb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='d_dname' type-id='84618a95' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='d_automount' type-id='da81d789' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='d_manage' type-id='6eededc8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='d_real' type-id='3cce524c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='d_canonical_path' type-id='8581ac2b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='delayed_call' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/delayed_call.h' line='10' column='1' id='f1fbc58e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fn' type-id='b7f9d8e6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/delayed_call.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/delayed_call.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bus_type' size-in-bits='1344' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='115' column='1' id='b31bfc8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dev_root' type-id='fa0b179b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus_groups' type-id='c97de1ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_groups' type-id='c97de1ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drv_groups' type-id='c97de1ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='match' type-id='2f28f04c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='uevent' type-id='22deb949' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='probe' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='remove' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='shutdown' type-id='dd787f72' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='online' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='offline' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='suspend' type-id='df416a94' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='resume' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='num_vf' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dma_configure' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='pm' type-id='3fab024e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='iommu_ops' type-id='f1ac64d0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='p' type-id='5da77304' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='lock_key' type-id='47479831' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='need_parent_lock' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='probe_type' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='238' column='1' id='171c98b7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='PROBE_DEFAULT_STRATEGY' value='0'/>
      <enumerator name='PROBE_PREFER_ASYNCHRONOUS' value='1'/>
      <enumerator name='PROBE_FORCE_SYNCHRONOUS' value='2'/>
    </enum-decl>
    <class-decl name='device_driver' size-in-bits='1024' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='280' column='1' id='fe007c02'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus' type-id='5e2671f8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='owner' type-id='2730d015' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mod_name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='suppress_bind_attrs' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='probe_type' type-id='171c98b7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='of_match_table' type-id='e5ce629e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='acpi_match_table' type-id='5b62aa60' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='probe' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='remove' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='shutdown' type-id='dd787f72' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='suspend' type-id='df416a94' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='resume' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='groups' type-id='c97de1ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='pm' type-id='3fab024e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='coredump' type-id='dd787f72' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='p' type-id='52abf1d3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='303' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='class' size-in-bits='960' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='407' column='1' id='fd48a067'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='owner' type-id='2730d015' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='class_groups' type-id='c97de1ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_groups' type-id='c97de1ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_kobj' type-id='d30bdc51' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_uevent' type-id='22deb949' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devnode' type-id='8cd77b5f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='class_release' type-id='bea4d586' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dev_release' type-id='dd787f72' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='shutdown_pre' type-id='613d39f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ns_type' type-id='47547dee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='namespace' type-id='e6c297c2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_ownership' type-id='f5f7cbd4' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='pm' type-id='3fab024e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='p' type-id='5da77304' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='430' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device_type' size-in-bits='384' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='557' column='1' id='bdae35f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='groups' type-id='c97de1ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uevent' type-id='22deb949' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='devnode' type-id='b72fdee5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='release' type-id='dd787f72' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pm' type-id='3fab024e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='565' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device_dma_parameters' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='754' column='1' id='37251e77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_segment_size' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='segment_boundary_mask' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='760' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='dl_dev_state' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='885' column='1' id='070abca2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DL_DEV_NO_DRIVER' value='0'/>
      <enumerator name='DL_DEV_PROBING' value='1'/>
      <enumerator name='DL_DEV_DRIVER_BOUND' value='2'/>
      <enumerator name='DL_DEV_UNBINDING' value='3'/>
    </enum-decl>
    <class-decl name='dev_links_info' size-in-bits='320' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='898' column='1' id='2d178f63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='suppliers' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='consumers' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='status' type-id='070abca2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='901' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device' size-in-bits='5888' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='987' column='1' id='66e487eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kobj' type-id='b6ab8849' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='988' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parent' type-id='fa0b179b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p' type-id='0d3b0dcf' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='991' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='init_name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='type' type-id='cd28613b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='5e2671f8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='driver' type-id='00c7b870' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='platform_data' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='driver_data' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1001' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='mutex' type-id='925167dc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='links' type-id='2d178f63' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='power' type-id='f3166b6b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='pm_domain' type-id='a4375c03' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1012' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='msi_domain' type-id='7544e824' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1015' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='pins' type-id='fa43ef1d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1018' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='msi_list' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1021' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='dma_ops' type-id='ac58af12' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='dma_mask' type-id='3df9fd28' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1025' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='coherent_dma_mask' type-id='91ce1af9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1026' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='bus_dma_mask' type-id='91ce1af9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1031' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='dma_pfn_offset' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1032' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='dma_parms' type-id='9b4aaf1f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1034' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='dma_pools' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1036' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='dma_mem' type-id='5bfba86c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1039' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='cma_area' type-id='6f67b38a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1043' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='archdata' type-id='d3e142f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='of_node' type-id='9a537bbe' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1049' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='fwnode' type-id='4a935625' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1050' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='devt' type-id='8504f260' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='id' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='devres_lock' type-id='fb4018a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1058' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='devres_head' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1059' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='class' type-id='67aca04f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='groups' type-id='c97de1ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='release' type-id='dd787f72' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='iommu_group' type-id='0b19fc54' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1065' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='iommu_fwspec' type-id='1979c577' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='iommu_param' type-id='506df562' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1067' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='offline_disabled' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5825'>
        <var-decl name='offline' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1070' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5826'>
        <var-decl name='of_node_reused' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5827'>
        <var-decl name='dma_coherent' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1075' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='dma_data_direction' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-direction.h' line='5' column='1' id='eea6b025'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DMA_BIDIRECTIONAL' value='0'/>
      <enumerator name='DMA_TO_DEVICE' value='1'/>
      <enumerator name='DMA_FROM_DEVICE' value='2'/>
      <enumerator name='DMA_NONE' value='3'/>
    </enum-decl>
    <class-decl name='dma_map_ops' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='79' column='1' id='d45f2b4f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alloc' type-id='06c31e09' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free' type-id='d7b98f89' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mmap' type-id='f7114ca5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_sgtable' type-id='295a92ed' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='map_page' type-id='7855184a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='unmap_page' type-id='6407fd0f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_sg' type-id='64452f48' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_sg' type-id='772c77c9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='map_resource' type-id='66c8694d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='unmap_resource' type-id='6407fd0f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='sync_single_for_cpu' type-id='b97350f1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='sync_single_for_device' type-id='b97350f1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='sync_sg_for_cpu' type-id='9ed36ca7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='sync_sg_for_device' type-id='9ed36ca7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='cache_sync' type-id='4935400d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dma_supported' type-id='5aa1f3eb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='get_required_mask' type-id='5dee5830' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='max_mapping_size' type-id='49f5e2e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='errseq_t' type-id='19c2251e' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/errseq.h' line='8' column='1' id='1da55f79'/>
    <class-decl name='kernel_symbol' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/export.h' line='61' column='1' id='9493d3c9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_offset' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/export.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name_offset' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/export.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iattr' size-in-bits='640' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='222' column='1' id='a9ef191f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ia_valid' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ia_mode' type-id='2594b00f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ia_uid' type-id='d80b72e6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ia_gid' type-id='094d8048' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ia_size' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ia_atime' type-id='40a816ad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ia_mtime' type-id='40a816ad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ia_ctime' type-id='40a816ad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ia_file' type-id='77e79a4b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='237' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rw_hint' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='298' column='1' id='0d20c3dd'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='WRITE_LIFE_NOT_SET' value='0'/>
      <enumerator name='WRITE_LIFE_NONE' value='1'/>
      <enumerator name='WRITE_LIFE_SHORT' value='2'/>
      <enumerator name='WRITE_LIFE_MEDIUM' value='3'/>
      <enumerator name='WRITE_LIFE_LONG' value='4'/>
      <enumerator name='WRITE_LIFE_EXTREME' value='5'/>
    </enum-decl>
    <class-decl name='kiocb' size-in-bits='384' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='316' column='1' id='da62d64b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ki_filp' type-id='77e79a4b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ki_pos' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ki_complete' type-id='9b28bd76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='private' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ki_flags' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ki_hint' type-id='1dc6a898' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='ki_ioprio' type-id='1dc6a898' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ki_cookie' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='328' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='address_space_operations' size-in-bits='1344' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='360' column='1' id='66fa8ce5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='writepage' type-id='8b8bc11e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='readpage' type-id='ab57fa9e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='writepages' type-id='01ffd89c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_page_dirty' type-id='1654d99a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readpages' type-id='230dd919' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_begin' type-id='4eb95ade' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='write_end' type-id='e6da64f6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bmap' type-id='aecbf18b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='invalidatepage' type-id='d8db14d1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='releasepage' type-id='919b335b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='freepage' type-id='2f974a69' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='direct_IO' type-id='227e209d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='migratepage' type-id='10451dea' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='isolate_page' type-id='a8faf36f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='putback_page' type-id='2f974a69' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='launder_page' type-id='1654d99a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_partially_uptodate' type-id='800c67c2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='is_dirty_writeback' type-id='6af64a09' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='error_remove_page' type-id='2c5f769d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='swap_activate' type-id='2eb7248e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='swap_deactivate' type-id='88909596' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='407' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='address_space' size-in-bits='1280' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='442' column='1' id='0fd82dc2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host' type-id='7e666abe' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i_pages' type-id='d39738ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gfp_mask' type-id='3eb7c31c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='i_mmap_writable' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='i_mmap' type-id='6fe1603d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='i_mmap_rwsem' type-id='f19fdb93' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nrpages' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nrexceptional' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='writeback_index' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='a_ops' type-id='7311f672' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='flags' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='wb_err' type-id='1da55f79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='private_lock' type-id='fb4018a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='private_list' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='private_data' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='457' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='block_device' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='466' column='1' id='1b893cc5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bd_dev' type-id='8504f260' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bd_openers' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bd_inode' type-id='7e666abe' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bd_super' type-id='42c8f564' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bd_mutex' type-id='925167dc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bd_claiming' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bd_holder' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bd_holders' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='bd_write_holder' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bd_holder_disks' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bd_contains' type-id='b88dd945' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bd_block_size' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='bd_partno' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bd_part' type-id='84dc82b7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='bd_part_count' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='bd_invalidated' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='bd_disk' type-id='33c599da' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='bd_queue' type-id='e7d2a5fc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='bd_bdi' type-id='ef4fae1b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='bd_list' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='bd_private' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='bd_fsfreeze_count' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='bd_fsfreeze_mutex' type-id='925167dc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='501' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='inode' size-in-bits='4672' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='621' column='1' id='fe070fe8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='i_mode' type-id='2594b00f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='i_opflags' type-id='8efea9e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='i_uid' type-id='d80b72e6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i_gid' type-id='094d8048' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='i_flags' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='i_acl' type-id='2871909b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='i_default_acl' type-id='2871909b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='i_op' type-id='de2c232c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='i_sb' type-id='42c8f564' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='i_mapping' type-id='f57039f0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='i_security' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='i_ino' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='' type-id='ac5ab59c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='650' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='i_rdev' type-id='8504f260' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_size' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='i_atime' type-id='40a816ad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='i_mtime' type-id='40a816ad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='i_ctime' type-id='40a816ad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='i_lock' type-id='fb4018a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='i_bytes' type-id='8efea9e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='i_blkbits' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1144'>
        <var-decl name='i_write_hint' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='i_blocks' type-id='17345459' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='i_state' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='i_rwsem' type-id='f19fdb93' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='dirtied_when' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='dirtied_time_when' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='i_hash' type-id='03a4a074' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='i_io_list' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='i_wb' type-id='f885ca7d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='i_wb_frn_winner' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='i_wb_frn_avg_time' type-id='1dc6a898' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2096'>
        <var-decl name='i_wb_frn_history' type-id='1dc6a898' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='i_lru' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='i_sb_list' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='i_wb_list' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='' type-id='ac5ab59d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='i_version' type-id='28ee064c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='i_count' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='i_dio_count' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='i_writecount' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='i_readcount' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='' type-id='ac5ab59e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='i_flctx' type-id='731257ff' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='i_data' type-id='0fd82dc2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='i_devices' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='' type-id='ac5ab59f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='i_generation' type-id='3f1a6b60' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='i_fsnotify_mask' type-id='3f1a6b60' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='i_fsnotify_marks' type-id='994d9d61' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='i_crypt_info' type-id='1ea8c5af' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='i_private' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='726' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__25' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='650' column='1' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='i_nlink' type-id='20f5f452' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='651' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__i_nlink' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='652' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__26' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='689' column='1' id='ac5ab59d'>
      <data-member access='public'>
        <var-decl name='i_dentry' type-id='e151255a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='690' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i_rcu' type-id='e3d8ce29' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='691' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__27' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='700' column='1' id='ac5ab59e'>
      <data-member access='public'>
        <var-decl name='i_fop' type-id='61758ee5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='701' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='free_inode' type-id='4f3d95df' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='702' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__30' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='707' column='1' id='ac5ab59f'>
      <data-member access='public'>
        <var-decl name='i_pipe' type-id='15d29710' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='708' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i_bdev' type-id='b88dd945' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='709' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i_cdev' type-id='3e6eb939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='710' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i_link' type-id='26a90f95' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='711' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i_dir_seq' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='712' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='fown_struct' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='891' column='1' id='6b640edd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='ac16795b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='892' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pid' type-id='b94e5398' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='893' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pid_type' type-id='ce78cf46' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='uid' type-id='d80b72e6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='895' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='euid' type-id='d80b72e6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='895' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='signum' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='896' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_ra_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='902' column='1' id='b31f003f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='903' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='904' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='async_size' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='905' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ra_pages' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='908' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mmap_miss' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='909' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prev_pos' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='910' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file' size-in-bits='2048' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='922' column='1' id='b4b8adeb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_u' type-id='ac5ab5a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_path' type-id='b5382ece' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='927' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_inode' type-id='7e666abe' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_op' type-id='61758ee5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_lock' type-id='fb4018a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='f_write_hint' type-id='0d20c3dd' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_count' type-id='f22a8abb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_flags' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='f_mode' type-id='2665334e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_pos_lock' type-id='925167dc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='f_pos' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='f_owner' type-id='6b640edd' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='f_cred' type-id='bc33861a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='f_ra' type-id='b31f003f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='f_version' type-id='91ce1af9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='f_security' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='private_data' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='f_ep_links' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='955' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='f_tfile_llink' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='956' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='f_mapping' type-id='f57039f0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='f_wb_err' type-id='1da55f79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='959' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='923' column='1' id='ac5ab5a0'>
      <data-member access='public'>
        <var-decl name='fu_llist' type-id='c5ccfee8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='924' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fu_rcuhead' type-id='e3d8ce29' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='925' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='fl_owner_t' type-id='eaa32e2f' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1012' column='1' id='bc5666d5'/>
    <class-decl name='file_lock_operations' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1016' column='1' id='1958bd2a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fl_copy_lock' type-id='7b9768f0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1017' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fl_release_private' type-id='c9e2bc02' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1018' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lock_manager_operations' size-in-bits='448' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1021' column='1' id='970ecd31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lm_get_owner' type-id='d6e9f1fa' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1022' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lm_put_owner' type-id='9615a2e0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1023' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lm_notify' type-id='c9e2bc02' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lm_grant' type-id='bdada41a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1025' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lm_break' type-id='5fb34715' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1026' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lm_change' type-id='4817356d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1027' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lm_setup' type-id='628f3294' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1028' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_lock' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1066' column='1' id='23c73eb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fl_blocker' type-id='0343ce83' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1067' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fl_list' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1068' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fl_link' type-id='03a4a074' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fl_blocked_requests' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1070' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='fl_blocked_member' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1073' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fl_owner' type-id='bc5666d5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1076' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fl_flags' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1077' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='fl_type' type-id='002ac4a6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1078' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='fl_pid' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1079' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='fl_link_cpu' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1080' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='fl_wait' type-id='b5ab048f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1081' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='fl_file' type-id='77e79a4b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1082' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='fl_start' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1083' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='fl_end' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='fl_fasync' type-id='5bb9c75d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1086' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='fl_break_time' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1088' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='fl_downgrade_time' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1089' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='fl_ops' type-id='dc4077ef' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='fl_lmops' type-id='a548fbc8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1092' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='fl_u' type-id='ac5ab5a1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1101' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__29' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1093' column='1' id='ac5ab5a1'>
      <data-member access='public'>
        <var-decl name='nfs_fl' type-id='17bacae5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1094' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nfs4_fl' type-id='b811a3f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='afs' type-id='e7f43f78' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1100' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1096' column='1' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1097' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='state' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1098' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='debug_id' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1099' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_lock_context' size-in-bits='448' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1104' column='1' id='fb0c2987'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flc_lock' type-id='fb4018a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flc_flock' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flc_posix' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flc_lease' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fasync_struct' size-in-bits='384' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1313' column='1' id='70c545cd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fa_lock' type-id='ac16795b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='magic' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fa_fd' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fa_next' type-id='5bb9c75d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fa_file' type-id='77e79a4b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fa_rcu' type-id='e3d8ce29' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1319' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sb_writers' size-in-bits='2944' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1400' column='1' id='fb476a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='frozen' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait_unfrozen' type-id='b5ab048f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rw_sem' type-id='a09ef5a6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1403' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='super_block' size-in-bits='11264' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1406' column='1' id='bc39a8be'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_list' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='s_dev' type-id='8504f260' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='s_blocksize_bits' type-id='002ac4a6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='s_blocksize' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='s_maxbytes' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='s_type' type-id='21e53d44' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='s_op' type-id='f7c6dcac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dq_op' type-id='85741a2a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='s_qcop' type-id='2cb49514' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='s_export_op' type-id='ab932c45' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_flags' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='s_iflags' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='s_magic' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='s_root' type-id='27675065' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='s_umount' type-id='f19fdb93' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='s_count' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='s_active' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='s_security' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='s_xattr' type-id='cb49d4b8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='s_cop' type-id='8d31a8d6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='s_roots' type-id='def98e71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='s_mounts' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='s_bdev' type-id='b88dd945' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='s_bdi' type-id='ef4fae1b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='s_mtd' type-id='58ed56f5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='s_instances' type-id='03a4a074' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='s_quota_types' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='s_dquot' type-id='c26e4ad8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='s_writers' type-id='fb476a2b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='s_fs_info' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='s_time_gran' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7584'>
        <var-decl name='s_fsnotify_mask' type-id='3f1a6b60' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7616'>
        <var-decl name='s_fsnotify_marks' type-id='994d9d61' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='s_id' type-id='16dc656a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='s_uuid' type-id='ec55eb74' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='s_max_links' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8096'>
        <var-decl name='s_mode' type-id='2665334e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8128'>
        <var-decl name='s_vfs_rename_mutex' type-id='925167dc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='s_subtype' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='s_d_op' type-id='1ee57353' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='cleancache_poolid' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='s_shrink' type-id='27cb404f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='s_remove_count' type-id='f22a8abb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='s_fsnotify_inode_refs' type-id='f22a8abb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='s_readonly_remount' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='s_dio_done_wq' type-id='242e3d19' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='s_pins' type-id='e151255a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='s_user_ns' type-id='c0ced320' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='s_dentry_lru' type-id='c653aac7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='s_inode_lru' type-id='c653aac7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='destroy_work' type-id='ef9025d0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='s_sync_lock' type-id='925167dc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10624'>
        <var-decl name='s_stack_depth' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='s_inode_list_lock' type-id='fb4018a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='s_inodes' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='s_inode_wblist_lock' type-id='fb4018a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='s_inodes_wb' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1525' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fiemap_extent_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1725' column='1' id='8ffe5745'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_flags' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fi_extents_mapped' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_extents_max' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_extents_start' type-id='d92598ce' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1729' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='filldir_t' type-id='78efe913' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1743' column='1' id='262124ef'/>
    <class-decl name='dir_context' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1746' column='1' id='d5476b80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='actor' type-id='262124ef' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pos' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1748' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_operations' size-in-bits='2048' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1800' column='1' id='7dffcde2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='owner' type-id='2730d015' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='llseek' type-id='07ebb4cd' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='read' type-id='4d8f5625' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write' type-id='5f29549c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='read_iter' type-id='227e209d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1805' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_iter' type-id='227e209d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='iopoll' type-id='6c4618be' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1807' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='iterate' type-id='42beb73a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='iterate_shared' type-id='42beb73a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='poll' type-id='4d01ede7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1810' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='unlocked_ioctl' type-id='fc7daf55' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='compat_ioctl' type-id='fc7daf55' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mmap' type-id='8ea2626c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='mmap_supported_flags' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='open' type-id='47800058' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='flush' type-id='5ddef2dd' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='release' type-id='47800058' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='fsync' type-id='31cc9254' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='fasync' type-id='b94ac371' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='lock' type-id='12f0ff82' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='sendpage' type-id='40da47a8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='get_unmapped_area' type-id='d44a8cec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='check_flags' type-id='7f416e10' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='flock' type-id='12f0ff82' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='splice_write' type-id='b22f4610' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='splice_read' type-id='72cd68b0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='setlease' type-id='87e3d3e2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1827' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='fallocate' type-id='a53e2328' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='show_fdinfo' type-id='eda08098' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='copy_file_range' type-id='d0882d6b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1834' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='remap_file_range' type-id='c1de1086' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='fadvise' type-id='31cc9254' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1839' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='inode_operations' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1842' column='1' id='5f5aa1ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lookup' type-id='02f90a61' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get_link' type-id='76ae8e1d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1844' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='permission' type-id='f4f91b99' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1845' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='permission2' type-id='29339961' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_acl' type-id='7f30b822' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1847' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readlink' type-id='a57bd028' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='create' type-id='c9cd0e09' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link' type-id='4b872e00' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlink' type-id='7f5be7f6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='symlink' type-id='234843b5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1854' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mkdir' type-id='98c2d938' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rmdir' type-id='7f5be7f6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mknod' type-id='f9e0c0e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='rename' type-id='7733ef81' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='setattr' type-id='c237e829' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1860' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='setattr2' type-id='88bb58e1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1861' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='getattr' type-id='0b787edf' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='listxattr' type-id='3494e4bb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='fiemap' type-id='0508acce' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='update_time' type-id='64ecf6a5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='atomic_open' type-id='d3807eb0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tmpfile' type-id='98c2d938' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='set_acl' type-id='820976ef' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1871' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='super_operations' size-in-bits='1920' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1923' column='1' id='874691ab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alloc_inode' type-id='e8c4dba4' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_inode' type-id='4f3d95df' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1925' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='free_inode' type-id='4f3d95df' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dirty_inode' type-id='5f5506f6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write_inode' type-id='fd780be6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drop_inode' type-id='28ba4492' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1930' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='evict_inode' type-id='4f3d95df' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1931' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='put_super' type-id='1ff54a45' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sync_fs' type-id='dcab5203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='freeze_super' type-id='d2f4c704' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='freeze_fs' type-id='d2f4c704' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='thaw_super' type-id='d2f4c704' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='unfreeze_fs' type-id='d2f4c704' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='statfs' type-id='35646c79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='remount_fs' type-id='552c8f87' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='clone_mnt_data' type-id='5ad9edb6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='copy_mnt_data' type-id='debb4ee8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='update_mnt_data' type-id='62bda903' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='umount_begin' type-id='1ff54a45' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='show_options' type-id='c94f6b13' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='show_options2' type-id='8d5d9e9b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='show_devname' type-id='c94f6b13' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='show_path' type-id='c94f6b13' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='show_stats' type-id='c94f6b13' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='quota_read' type-id='e295c77c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='quota_write' type-id='a9b95107' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='get_dquots' type-id='ae02292a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1953' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='bdev_try_to_free_page' type-id='ea44f8d2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1955' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nr_cached_objects' type-id='c4facf61' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1956' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='free_cached_objects' type-id='c4facf61' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1958' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_system_type' size-in-bits='640' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2200' column='1' id='2f5a60be'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fs_flags' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='init_fs_context' type-id='57f0383a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parameters' type-id='a2fb6348' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mount' type-id='d9394db1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='alloc_mnt_data' type-id='0cfacb48' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='kill_sb' type-id='1ff54a45' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='owner' type-id='2730d015' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='next' type-id='21e53d44' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fs_supers' type-id='e151255a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_lock_key' type-id='47479831' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_umount_key' type-id='47479831' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_vfs_rename_key' type-id='47479831' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_writers_key' type-id='9c02e2a6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_lock_key' type-id='47479831' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_mutex_key' type-id='47479831' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_mutex_dir_key' type-id='47479831' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fwnode_handle' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='17' column='1' id='d5ace205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secondary' type-id='4a935625' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ops' type-id='b4ff6cf8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='19' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fwnode_endpoint' size-in-bits='128' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='28' column='1' id='84a13146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='port' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='id' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='local_fwnode' type-id='7837cd88' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fwnode_reference_args' size-in-bits='640' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='42' column='1' id='8dbba1ec'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fwnode' type-id='4a935625' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nargs' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='args' type-id='6094c99c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fwnode_operations' size-in-bits='960' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='69' column='1' id='f45a6a89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='get' type-id='e3a3f61a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='put' type-id='c379ce2c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device_is_available' type-id='e4913062' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='device_get_match_data' type-id='def135ae' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='property_present' type-id='a9ee1319' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='property_read_int_array' type-id='15f6292e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='property_read_string_array' type-id='841b4311' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_parent' type-id='e9910ceb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_next_child_node' type-id='900dcb03' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_named_child_node' type-id='c297681a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_reference_args' type-id='4324a0e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='graph_get_next_endpoint' type-id='900dcb03' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='graph_get_remote_endpoint' type-id='e9910ceb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='graph_get_port_parent' type-id='e3a3f61a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='graph_parse_endpoint' type-id='bde527e9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='hrtimer_restart' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='56' column='1' id='7313b0ab'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HRTIMER_NORESTART' value='0'/>
      <enumerator name='HRTIMER_RESTART' value='1'/>
    </enum-decl>
    <class-decl name='hrtimer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='107' column='1' id='b6993efc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='fe3acb42' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_softexpires' type-id='fbc017ef' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='function' type-id='ca9b3bbf' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='base' type-id='730f4667' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='state' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='is_rel' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='is_soft' type-id='f9b06939' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hrtimer_clock_base' size-in-bits='512' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='147' column='1' id='1851ab9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cpu_base' type-id='75e9503b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='index' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='clockid' type-id='a1c3b834' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seq' type-id='e14c3b11' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='running' type-id='08c8d0fa' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='active' type-id='ff3c7f20' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_time' type-id='7a6c9108' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='offset' type-id='fbc017ef' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hrtimer_cpu_base' size-in-bits='4608' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='198' column='1' id='8d24b00b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='f5c90b3f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cpu' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='active_bases' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='clock_was_set_seq' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hres_active' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129'>
        <var-decl name='in_hrtirq' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='130'>
        <var-decl name='hang_detected' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131'>
        <var-decl name='softirq_activated' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nr_events' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nr_retries' type-id='8efea9e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='nr_hangs' type-id='8efea9e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='max_hang_time' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='expires_next' type-id='fbc017ef' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_timer' type-id='08c8d0fa' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='softirq_expires_next' type-id='fbc017ef' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='softirq_next_timer' type-id='08c8d0fa' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='clock_base' type-id='cb01bf4b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='217' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='idr' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/idr.h' line='19' column='1' id='37ce495e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr_rt' type-id='d39738ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/idr.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idr_base' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/idr.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='idr_next' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/idr.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='io_cq' size-in-bits='448' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='72' column='1' id='db04abd6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='q' type-id='e7d2a5fc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ioc' type-id='d042cfad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='ac5ab5a2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='ac5ab5a3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__20' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='82' column='1' id='ac5ab5a2'>
      <data-member access='public'>
        <var-decl name='q_node' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__rcu_icq_cache' type-id='f3b4aca8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='84' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__21' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='86' column='1' id='ac5ab5a3'>
      <data-member access='public'>
        <var-decl name='ioc_node' type-id='03a4a074' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='87' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__rcu_head' type-id='e3d8ce29' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='88' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='io_context' size-in-bits='832' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='98' column='1' id='d002899d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='f22a8abb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='active_ref' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nr_tasks' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ioprio' type-id='8efea9e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nr_batch_requests' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='last_waited' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='icq_tree' type-id='d39738ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='icq_hint' type-id='7c6e0e0c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='icq_list' type-id='e151255a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='release_work' type-id='ef9025d0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='resource' size-in-bits='512' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/ioport.h' line='20' column='1' id='5218160d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='acc63fdf' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/ioport.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='acc63fdf' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/ioport.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/ioport.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/ioport.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='desc' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/ioport.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='parent' type-id='c9d64c0d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/ioport.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sibling' type-id='c9d64c0d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/ioport.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='child' type-id='c9d64c0d' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/ioport.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='static_key' size-in-bits='32' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/jump_label.h' line='110' column='1' id='00205383'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enabled' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/jump_label.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_elem_dir' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='84' column='1' id='4303ca40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='subdirs' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='children' type-id='dec44472' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='root' type-id='e18defdb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_elem_symlink' size-in-bits='64' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='96' column='1' id='c8685ef0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='target_kn' type-id='150efd3f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_elem_attr' size-in-bits='256' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='100' column='1' id='9e04468e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ops' type-id='d37373f6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='open' type-id='627d9f9e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='69bf7bee' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='notify_next' type-id='150efd3f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='kernfs_node_id' size-in-bits='64' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='108' column='1' id='3dfef700'>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='109' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='id' type-id='91ce1af9' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='119' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='109' column='1' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ino' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='generation' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_node' size-in-bits='1024' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='131' column='1' id='29d79af7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='active' type-id='49178f86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='parent' type-id='150efd3f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rb' type-id='2a8a6332' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ns' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hash' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='' type-id='ac5ab5a4' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='id' type-id='3dfef700' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='flags' type-id='8efea9e5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='912'>
        <var-decl name='mode' type-id='2594b00f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='iattr' type-id='1f4b5d14' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='161' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__34' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='150' column='1' id='ac5ab5a4'>
      <data-member access='public'>
        <var-decl name='dir' type-id='4303ca40' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='151' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='symlink' type-id='c8685ef0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='152' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='attr' type-id='9e04468e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='153' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='kernfs_syscall_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='171' column='1' id='91f5bcb7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='show_options' type-id='efd5496b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mkdir' type-id='58d10a98' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rmdir' type-id='0b56752f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rename' type-id='aea90108' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='show_path' type-id='26692209' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_root' size-in-bits='768' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='183' column='1' id='471fc91b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kn' type-id='150efd3f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ino_idr' type-id='37ce495e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_generation' type-id='19c2251e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='syscall_ops' type-id='fefa8c5f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='supers' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='deactivate_waitq' type-id='b5ab048f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_open_file' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='199' column='1' id='60fb5bfa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kn' type-id='150efd3f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='file' type-id='77e79a4b' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seq_file' type-id='f8dc9def' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mutex' type-id='925167dc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='prealloc_mutex' type-id='925167dc' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='event' type-id='95e97e5e' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='list' type-id='72f469ec' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='prealloc_buf' type-id='26a90f95' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='atomic_write_len' type-id='b59d7dce' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mmapped' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1089'>
        <var-decl name='released' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='vm_ops' type-id='9be87662' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_ops' size-in-bits='768' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='219' column='1' id='ae89b201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='open' type-id='964d2eb6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='release' type-id='f1825e09' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seq_show' type-id='0131eb61' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='seq_start' type-id='a46b05a0' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='seq_next' type-id='b6ba26fa' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='seq_stop' type-id='6ba28d1c' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='read' type-id='17b1add7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='atomic_write_len' type-id='b59d7dce' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='prealloc' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='write' type-id='17b1add7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='poll' type-id='b347e5ac' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='mmap' type-id='f9e738c5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='268' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='key_serial_t' type-id='3ff5601b' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='28' column='1' id='c84025ab'/>
    <typedef-decl name='key_perm_t' type-id='8f92235e' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='31' column='1' id='296adac1'/>
    <class-decl name='key_tag' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='85' column='1' id='3173bc57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='usage' type-id='64615833' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='removed' type-id='b50a4934' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='keyring_index_key' size-in-bits='320' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='91' column='1' id='16ab8749'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab5a5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='d0a699d1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='domain_tag' type-id='fce14c5f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='description' type-id='80f4b756' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__17' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='94' column='1' id='ac5ab5a5'>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f7a' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='95' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='x' type-id='7359adad' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='104' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='95' column='1' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='desc_len' type-id='1dc6a898' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='desc' type-id='4a008bc3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='key_payload' size-in-bits='256' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='111' column='1' id='2888d74a'>
      <data-member access='public'>
        <var-decl name='rcu_data0' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='112' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='data' type-id='209ef23f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='113' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='key_restrict_link_func_t' type-id='a5786cbb' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='148' column='1' id='f87a5fab'/>
    <class-decl name='key_restriction' size-in-bits='192' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='153' column='1' id='fe81ecb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='check' type-id='f87a5fab' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='204a4632' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keytype' type-id='d0a699d1' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='key' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='172' column='1' id='128d0ac4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='usage' type-id='64615833' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='serial' type-id='c84025ab' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab5a6' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sem' type-id='f19fdb93' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='user' type-id='23704f74' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='security' type-id='eaa32e2f' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
