<abi-corpus version='2.0' path='data/test-read-dwarf/test17-pr19027.so' soname='libharfbuzz.so.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libfreetype.so.6'/>
    <dependency name='libpng16.so.16'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libbz2.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_create_sub_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_data_writable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='hb_tag_from_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_tag_to_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_combining_class' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_compose' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_decompose' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_decompose_compatibility' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_eastasian_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_default' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_empty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_is_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_make_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_reference' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_combining_class_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_compose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_decompose_compatibility_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_decompose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_eastasian_width_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_general_category_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_mirroring_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_script_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_general_category' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_mirroring' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_script' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_version_atleast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_version_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='hb-blob.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='6697334d' size-in-bits='384' id='bf5a2b7f'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='hb_atomic_int_t' type-id='95e97e5e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-atomic-private.hh' line='94' column='1' id='9046ccab'/>
    <class-decl name='hb_blob_t' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='53' column='1' id='a7cfc628'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='data' type-id='80f4b756' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='length' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='mode' type-id='3e97254d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='user_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='destroy' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='64' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='hb_memory_mode_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='58' column='1' id='3e97254d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_MEMORY_MODE_DUPLICATE' value='0'/>
      <enumerator name='HB_MEMORY_MODE_READONLY' value='1'/>
      <enumerator name='HB_MEMORY_MODE_WRITABLE' value='2'/>
      <enumerator name='HB_MEMORY_MODE_READONLY_MAY_MAKE_WRITABLE' value='3'/>
    </enum-decl>
    <typedef-decl name='hb_blob_t' type-id='a7cfc628' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='65' column='1' id='a08f20c3'/>
    <typedef-decl name='hb_bool_t' type-id='95e97e5e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='73' column='1' id='fd106398'/>
    <class-decl name='hb_user_data_key_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='334' column='1' id='0ca54af3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='unused' type-id='a84c031d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_user_data_key_t' type-id='0ca54af3' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='337' column='1' id='8f0d6582'/>
    <typedef-decl name='hb_destroy_func_t' type-id='b7f9d8e6' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='339' column='1' id='ed954d2d'/>
    <typedef-decl name='hb_mutex_impl_t' type-id='70681f9b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='59' column='1' id='1e219f0a'/>
    <class-decl name='hb_mutex_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='117' column='1' id='64a0d528'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='1e219f0a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_reference_count_t' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='53' column='1' id='775272c6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='9046ccab' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_user_data_array_t' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='70' column='1' id='6e658f81'>
      <member-type access='public'>
        <class-decl name='hb_user_data_item_t' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='71' column='1' id='6697334d'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='key' type-id='49203b03' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='72' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='73' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='destroy' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='64a0d528' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='items' type-id='8806fe52' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_object_header_t' size-in-bits='896' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='101' column='1' id='825dc3de'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='775272c6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='user_data' type-id='6e658f81' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_prealloced_array_t&lt;hb_user_data_array_t::hb_user_data_item_t, 2u&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='329' column='1' id='f1a94475'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='allocated' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='array' type-id='4e6ceb9d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='static_array' type-id='bf5a2b7f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='333' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='find&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5f7263a5' is-artificial='yes'/>
          <parameter type-id='49203b03'/>
          <return type-id='4e6ceb9d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find&lt;hb_user_data_array_t::hb_user_data_item_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5f7263a5' is-artificial='yes'/>
          <parameter type-id='6697334d'/>
          <return type-id='4e6ceb9d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_lockable_set_t&lt;hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='449' column='1' id='8806fe52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='items' type-id='f1a94475' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='450' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='find&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='496' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='61d87210' is-artificial='yes'/>
          <parameter type-id='49203b03'/>
          <parameter type-id='4e6ceb9d'/>
          <parameter type-id='85f010a2'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='480' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='61d87210' is-artificial='yes'/>
          <parameter type-id='49203b03'/>
          <parameter type-id='85f010a2'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='replace_or_insert&lt;hb_user_data_array_t::hb_user_data_item_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='455' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='61d87210' is-artificial='yes'/>
          <parameter type-id='6697334d'/>
          <parameter type-id='85f010a2'/>
          <parameter type-id='c894953d'/>
          <return type-id='4e6ceb9d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='62' column='1' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' filepath='/usr/include/bits/pthreadtypes.h' line='65' column='1' id='518fb49c'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1' id='70681f9b'>
      <member-type access='public'>
        <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1' id='6688f464'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='__count' type-id='f0981eeb' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='81' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='82' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='__nusers' type-id='f0981eeb' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='84' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='88' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='__spins' type-id='95e97e5e' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='90' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='91' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='__data' type-id='6688f464' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='101' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='102' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='bd54fe1a' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='103' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='a7cfc628' const='yes' id='23880b93'/>
    <pointer-type-def type-id='23880b93' size-in-bits='64' id='a82a743b'/>
    <qualified-type-def type-id='825dc3de' const='yes' id='47530e67'/>
    <pointer-type-def type-id='47530e67' size-in-bits='64' id='94bf8337'/>
    <qualified-type-def type-id='f1a94475' const='yes' id='161590f0'/>
    <pointer-type-def type-id='161590f0' size-in-bits='64' id='9df3072e'/>
    <qualified-type-def type-id='775272c6' const='yes' id='f1db39eb'/>
    <pointer-type-def type-id='f1db39eb' size-in-bits='64' id='7d1bead3'/>
    <qualified-type-def type-id='7d1bead3' const='yes' id='301c61e8'/>
    <qualified-type-def type-id='6697334d' const='yes' id='916351d2'/>
    <reference-type-def kind='lvalue' type-id='916351d2' size-in-bits='64' id='d35a031c'/>
    <pointer-type-def type-id='916351d2' size-in-bits='64' id='d75a0968'/>
    <pointer-type-def type-id='a08f20c3' size-in-bits='64' id='9d7b4d1e'/>
    <pointer-type-def type-id='8806fe52' size-in-bits='64' id='61d87210'/>
    <qualified-type-def type-id='61d87210' const='yes' id='681c3da3'/>
    <qualified-type-def type-id='85f010a2' id='85f010a3'/>
    <reference-type-def kind='lvalue' type-id='64a0d528' size-in-bits='64' id='85f010a2'/>
    <pointer-type-def type-id='64a0d528' size-in-bits='64' id='89f016ee'/>
    <qualified-type-def type-id='89f016ee' const='yes' id='c9acb9e1'/>
    <pointer-type-def type-id='f1a94475' size-in-bits='64' id='5f7263a5'/>
    <qualified-type-def type-id='5f7263a5' const='yes' id='247b7b1a'/>
    <pointer-type-def type-id='775272c6' size-in-bits='64' id='e82fe34c'/>
    <qualified-type-def type-id='e82fe34c' const='yes' id='2600a777'/>
    <pointer-type-def type-id='6e658f81' size-in-bits='64' id='1020ec09'/>
    <qualified-type-def type-id='1020ec09' const='yes' id='cf9b4126'/>
    <reference-type-def kind='lvalue' type-id='6697334d' size-in-bits='64' id='426cd8b9'/>
    <pointer-type-def type-id='6697334d' size-in-bits='64' id='4e6ceb9d'/>
    <qualified-type-def type-id='4e6ceb9d' const='yes' id='f1ba1ef2'/>
    <pointer-type-def type-id='8f0d6582' size-in-bits='64' id='49203b03'/>
    <pointer-type-def type-id='f0981eeb' size-in-bits='64' id='807869d3'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <function-decl name='hb_blob_create' mangled-name='hb_blob_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create'>
      <parameter type-id='80f4b756' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1'/>
      <parameter type-id='f0981eeb' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='98' column='1'/>
      <parameter type-id='3e97254d' name='mode' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='99' column='1'/>
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='100' column='1'/>
      <parameter type-id='ed954d2d' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='101' column='1'/>
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <function-decl name='hb_blob_create_sub_blob' mangled-name='hb_blob_create_sub_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create_sub_blob'>
      <parameter type-id='9d7b4d1e' name='parent' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1'/>
      <parameter type-id='f0981eeb' name='offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='151' column='1'/>
      <parameter type-id='f0981eeb' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='152' column='1'/>
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <function-decl name='hb_blob_get_empty' mangled-name='hb_blob_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_empty'>
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <function-decl name='hb_blob_reference' mangled-name='hb_blob_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_reference'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1'/>
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <function-decl name='hb_blob_destroy' mangled-name='hb_blob_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_destroy'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_blob_set_user_data' mangled-name='hb_blob_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_set_user_data'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1'/>
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='254' column='1'/>
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='255' column='1'/>
      <parameter type-id='ed954d2d' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='256' column='1'/>
      <parameter type-id='fd106398' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='257' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <function-decl name='hb_blob_get_user_data' mangled-name='hb_blob_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_user_data'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1'/>
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='275' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='hb_blob_make_immutable' mangled-name='hb_blob_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_make_immutable'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_blob_is_immutable' mangled-name='hb_blob_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_is_immutable'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <function-decl name='hb_blob_get_length' mangled-name='hb_blob_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_length'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='hb_blob_get_data' mangled-name='hb_blob_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <parameter type-id='807869d3' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='hb_blob_get_data_writable' mangled-name='hb_blob_get_data_writable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data_writable'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <parameter type-id='807869d3' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer-serialize.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='80f4b756' size-in-bits='512' id='31fa0500'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='a959aecb' size-in-bits='320' id='59ba990d'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='23bd8cb5' size-in-bits='32' id='eaa227ea'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='32' id='e09548f1'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='32' id='8141bf33'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='64' id='0d532ec1'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <class-decl name='hb_buffer_t' size-in-bits='2752' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='46' column='1' id='57c520e9'>
      <member-type access='public'>
        <typedef-decl name='scratch_buffer_t' type-id='bd54fe1a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='190' column='1' id='9b0d70c8'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='unicode' type-id='db70339e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='flags' type-id='77054a06' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='replacement' type-id='a959aecb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='content_type' type-id='e8b55c7f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='props' type-id='c03d4c5f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='in_error' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1352'>
        <var-decl name='have_output' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <var-decl name='have_positions' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='idx' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='len' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='out_len' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='allocated' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='info' type-id='4cf9317a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='out_info' type-id='4cf9317a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='pos' type-id='9493c6e3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='serial' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='allocated_var_bytes' type-id='13339fda' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='allocated_var_owner' type-id='31fa0500' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='87' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='CONTEXT_LENGTH' type-id='20f5f452' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='context' type-id='59ba990d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='context_len' type-id='0d532ec1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_glyph_info_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='44' column='1' id='1c727cac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='codepoint' type-id='a959aecb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mask' type-id='b7def578' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cluster' type-id='8f92235e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='var1' type-id='a7df0b99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='var2' type-id='a7df0b99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_glyph_info_t' type-id='1c727cac' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='52' column='1' id='60021ca7'/>
    <class-decl name='hb_glyph_position_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='54' column='1' id='a9943313'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_advance' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y_advance' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_offset' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='y_offset' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='var' type-id='a7df0b99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_glyph_position_t' type-id='a9943313' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='62' column='1' id='ab180530'/>
    <class-decl name='hb_segment_properties_t' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='65' column='1' id='7f15157c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='direction' type-id='17bc5dc7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='script' type-id='e02a2c4f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='language' type-id='4817e45a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved1' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved2' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_segment_properties_t' type-id='7f15157c' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='72' column='1' id='c03d4c5f'/>
    <typedef-decl name='hb_buffer_t' type-id='57c520e9' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='93' column='1' id='1ad0166e'/>
    <enum-decl name='hb_buffer_content_type_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='119' column='1' id='e8b55c7f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_INVALID' value='0'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_UNICODE' value='1'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_GLYPHS' value='2'/>
    </enum-decl>
    <enum-decl name='hb_buffer_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='174' column='1' id='77054a06'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_BUFFER_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_FLAG_BOT' value='1'/>
      <enumerator name='HB_BUFFER_FLAG_EOT' value='2'/>
      <enumerator name='HB_BUFFER_FLAG_PRESERVE_DEFAULT_IGNORABLES' value='4'/>
    </enum-decl>
    <enum-decl name='hb_buffer_serialize_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='298' column='1' id='9562cc1f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_CLUSTERS' value='1'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_POSITIONS' value='2'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_GLYPH_NAMES' value='4'/>
    </enum-decl>
    <enum-decl name='hb_buffer_serialize_format_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='305' column='1' id='a23c3b31'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_TEXT' value='1413830740'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_JSON' value='1246973774'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_INVALID' value='0'/>
    </enum-decl>
    <class-decl name='hb_language_impl_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='167' column='1' id='73275f42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='048e5bff' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='168' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_codepoint_t' type-id='8f92235e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='75' column='1' id='a959aecb'/>
    <typedef-decl name='hb_position_t' type-id='3ff5601b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='76' column='1' id='fab7f087'/>
    <typedef-decl name='hb_mask_t' type-id='8f92235e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='77' column='1' id='b7def578'/>
    <union-decl name='_hb_var_int_t' size-in-bits='32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='79' column='1' id='c574bffc'>
      <data-member access='public'>
        <var-decl name='u32' type-id='8f92235e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i32' type-id='3ff5601b' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='81' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u16' type-id='8141bf33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='82' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i16' type-id='eaa227ea' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u8' type-id='d351502e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='84' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i8' type-id='e09548f1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='hb_var_int_t' type-id='c574bffc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='86' column='1' id='a7df0b99'/>
    <enum-decl name='hb_direction_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='111' column='1' id='17bc5dc7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_DIRECTION_INVALID' value='0'/>
      <enumerator name='HB_DIRECTION_LTR' value='4'/>
      <enumerator name='HB_DIRECTION_RTL' value='5'/>
      <enumerator name='HB_DIRECTION_TTB' value='6'/>
      <enumerator name='HB_DIRECTION_BTT' value='7'/>
    </enum-decl>
    <typedef-decl name='hb_language_t' type-id='e4dcb57b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='137' column='1' id='4817e45a'/>
    <enum-decl name='hb_script_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='157' column='1' id='e02a2c4f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_SCRIPT_COMMON' value='1517910393'/>
      <enumerator name='HB_SCRIPT_INHERITED' value='1516858984'/>
      <enumerator name='HB_SCRIPT_UNKNOWN' value='1517976186'/>
      <enumerator name='HB_SCRIPT_ARABIC' value='1098015074'/>
      <enumerator name='HB_SCRIPT_ARMENIAN' value='1098018158'/>
      <enumerator name='HB_SCRIPT_BENGALI' value='1113943655'/>
      <enumerator name='HB_SCRIPT_CYRILLIC' value='1132032620'/>
      <enumerator name='HB_SCRIPT_DEVANAGARI' value='1147500129'/>
      <enumerator name='HB_SCRIPT_GEORGIAN' value='1197830002'/>
      <enumerator name='HB_SCRIPT_GREEK' value='1198679403'/>
      <enumerator name='HB_SCRIPT_GUJARATI' value='1198877298'/>
      <enumerator name='HB_SCRIPT_GURMUKHI' value='1198879349'/>
      <enumerator name='HB_SCRIPT_HANGUL' value='1214344807'/>
      <enumerator name='HB_SCRIPT_HAN' value='1214344809'/>
      <enumerator name='HB_SCRIPT_HEBREW' value='1214603890'/>
      <enumerator name='HB_SCRIPT_HIRAGANA' value='1214870113'/>
      <enumerator name='HB_SCRIPT_KANNADA' value='1265525857'/>
      <enumerator name='HB_SCRIPT_KATAKANA' value='1264676449'/>
      <enumerator name='HB_SCRIPT_LAO' value='1281453935'/>
      <enumerator name='HB_SCRIPT_LATIN' value='1281455214'/>
      <enumerator name='HB_SCRIPT_MALAYALAM' value='1298954605'/>
      <enumerator name='HB_SCRIPT_ORIYA' value='1332902241'/>
      <enumerator name='HB_SCRIPT_TAMIL' value='1415671148'/>
      <enumerator name='HB_SCRIPT_TELUGU' value='1415933045'/>
      <enumerator name='HB_SCRIPT_THAI' value='1416126825'/>
      <enumerator name='HB_SCRIPT_TIBETAN' value='1416192628'/>
      <enumerator name='HB_SCRIPT_BOPOMOFO' value='1114599535'/>
      <enumerator name='HB_SCRIPT_BRAILLE' value='1114792297'/>
      <enumerator name='HB_SCRIPT_CANADIAN_SYLLABICS' value='1130458739'/>
      <enumerator name='HB_SCRIPT_CHEROKEE' value='1130915186'/>
      <enumerator name='HB_SCRIPT_ETHIOPIC' value='1165256809'/>
      <enumerator name='HB_SCRIPT_KHMER' value='1265134962'/>
      <enumerator name='HB_SCRIPT_MONGOLIAN' value='1299148391'/>
      <enumerator name='HB_SCRIPT_MYANMAR' value='1299803506'/>
      <enumerator name='HB_SCRIPT_OGHAM' value='1332175213'/>
      <enumerator name='HB_SCRIPT_RUNIC' value='1383427698'/>
      <enumerator name='HB_SCRIPT_SINHALA' value='1399418472'/>
      <enumerator name='HB_SCRIPT_SYRIAC' value='1400468067'/>
      <enumerator name='HB_SCRIPT_THAANA' value='1416126817'/>
      <enumerator name='HB_SCRIPT_YI' value='1500080489'/>
      <enumerator name='HB_SCRIPT_DESERET' value='1148416628'/>
      <enumerator name='HB_SCRIPT_GOTHIC' value='1198486632'/>
      <enumerator name='HB_SCRIPT_OLD_ITALIC' value='1232363884'/>
      <enumerator name='HB_SCRIPT_BUHID' value='1114990692'/>
      <enumerator name='HB_SCRIPT_HANUNOO' value='1214344815'/>
      <enumerator name='HB_SCRIPT_TAGALOG' value='1416064103'/>
      <enumerator name='HB_SCRIPT_TAGBANWA' value='1415669602'/>
      <enumerator name='HB_SCRIPT_CYPRIOT' value='1131442804'/>
      <enumerator name='HB_SCRIPT_LIMBU' value='1281977698'/>
      <enumerator name='HB_SCRIPT_LINEAR_B' value='1281977954'/>
      <enumerator name='HB_SCRIPT_OSMANYA' value='1332964705'/>
      <enumerator name='HB_SCRIPT_SHAVIAN' value='1399349623'/>
      <enumerator name='HB_SCRIPT_TAI_LE' value='1415670885'/>
      <enumerator name='HB_SCRIPT_UGARITIC' value='1432838514'/>
      <enumerator name='HB_SCRIPT_BUGINESE' value='1114990441'/>
      <enumerator name='HB_SCRIPT_COPTIC' value='1131376756'/>
      <enumerator name='HB_SCRIPT_GLAGOLITIC' value='1198285159'/>
      <enumerator name='HB_SCRIPT_KHAROSHTHI' value='1265131890'/>
      <enumerator name='HB_SCRIPT_NEW_TAI_LUE' value='1415670901'/>
      <enumerator name='HB_SCRIPT_OLD_PERSIAN' value='1483761007'/>
      <enumerator name='HB_SCRIPT_SYLOTI_NAGRI' value='1400466543'/>
      <enumerator name='HB_SCRIPT_TIFINAGH' value='1415999079'/>
      <enumerator name='HB_SCRIPT_BALINESE' value='1113681001'/>
      <enumerator name='HB_SCRIPT_CUNEIFORM' value='1483961720'/>
      <enumerator name='HB_SCRIPT_NKO' value='1315663727'/>
      <enumerator name='HB_SCRIPT_PHAGS_PA' value='1349017959'/>
      <enumerator name='HB_SCRIPT_PHOENICIAN' value='1349021304'/>
      <enumerator name='HB_SCRIPT_CARIAN' value='1130459753'/>
      <enumerator name='HB_SCRIPT_CHAM' value='1130914157'/>
      <enumerator name='HB_SCRIPT_KAYAH_LI' value='1264675945'/>
      <enumerator name='HB_SCRIPT_LEPCHA' value='1281716323'/>
      <enumerator name='HB_SCRIPT_LYCIAN' value='1283023721'/>
      <enumerator name='HB_SCRIPT_LYDIAN' value='1283023977'/>
      <enumerator name='HB_SCRIPT_OL_CHIKI' value='1332503403'/>
      <enumerator name='HB_SCRIPT_REJANG' value='1382706791'/>
      <enumerator name='HB_SCRIPT_SAURASHTRA' value='1398895986'/>
      <enumerator name='HB_SCRIPT_SUNDANESE' value='1400204900'/>
      <enumerator name='HB_SCRIPT_VAI' value='1449224553'/>
      <enumerator name='HB_SCRIPT_AVESTAN' value='1098281844'/>
      <enumerator name='HB_SCRIPT_BAMUM' value='1113681269'/>
      <enumerator name='HB_SCRIPT_EGYPTIAN_HIEROGLYPHS' value='1164409200'/>
      <enumerator name='HB_SCRIPT_IMPERIAL_ARAMAIC' value='1098018153'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PAHLAVI' value='1349020777'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PARTHIAN' value='1349678185'/>
      <enumerator name='HB_SCRIPT_JAVANESE' value='1247901281'/>
      <enumerator name='HB_SCRIPT_KAITHI' value='1265920105'/>
      <enumerator name='HB_SCRIPT_LISU' value='1281979253'/>
      <enumerator name='HB_SCRIPT_MEETEI_MAYEK' value='1299473769'/>
      <enumerator name='HB_SCRIPT_OLD_SOUTH_ARABIAN' value='1398895202'/>
      <enumerator name='HB_SCRIPT_OLD_TURKIC' value='1332898664'/>
      <enumerator name='HB_SCRIPT_SAMARITAN' value='1398893938'/>
      <enumerator name='HB_SCRIPT_TAI_THAM' value='1281453665'/>
      <enumerator name='HB_SCRIPT_TAI_VIET' value='1415673460'/>
      <enumerator name='HB_SCRIPT_BATAK' value='1113683051'/>
      <enumerator name='HB_SCRIPT_BRAHMI' value='1114792296'/>
      <enumerator name='HB_SCRIPT_MANDAIC' value='1298230884'/>
      <enumerator name='HB_SCRIPT_CHAKMA' value='1130457965'/>
      <enumerator name='HB_SCRIPT_MEROITIC_CURSIVE' value='1298494051'/>
      <enumerator name='HB_SCRIPT_MEROITIC_HIEROGLYPHS' value='1298494063'/>
      <enumerator name='HB_SCRIPT_MIAO' value='1349284452'/>
      <enumerator name='HB_SCRIPT_SHARADA' value='1399353956'/>
      <enumerator name='HB_SCRIPT_SORA_SOMPENG' value='1399812705'/>
      <enumerator name='HB_SCRIPT_TAKRI' value='1415670642'/>
      <enumerator name='HB_SCRIPT_BASSA_VAH' value='1113682803'/>
      <enumerator name='HB_SCRIPT_CAUCASIAN_ALBANIAN' value='1097295970'/>
      <enumerator name='HB_SCRIPT_DUPLOYAN' value='1148547180'/>
      <enumerator name='HB_SCRIPT_ELBASAN' value='1164730977'/>
      <enumerator name='HB_SCRIPT_GRANTHA' value='1198678382'/>
      <enumerator name='HB_SCRIPT_KHOJKI' value='1265135466'/>
      <enumerator name='HB_SCRIPT_KHUDAWADI' value='1399418468'/>
      <enumerator name='HB_SCRIPT_LINEAR_A' value='1281977953'/>
      <enumerator name='HB_SCRIPT_MAHAJANI' value='1298229354'/>
      <enumerator name='HB_SCRIPT_MANICHAEAN' value='1298230889'/>
      <enumerator name='HB_SCRIPT_MENDE_KIKAKUI' value='1298493028'/>
      <enumerator name='HB_SCRIPT_MODI' value='1299145833'/>
      <enumerator name='HB_SCRIPT_MRO' value='1299345263'/>
      <enumerator name='HB_SCRIPT_NABATAEAN' value='1315070324'/>
      <enumerator name='HB_SCRIPT_OLD_NORTH_ARABIAN' value='1315009122'/>
      <enumerator name='HB_SCRIPT_OLD_PERMIC' value='1348825709'/>
      <enumerator name='HB_SCRIPT_PAHAWH_HMONG' value='1215131239'/>
      <enumerator name='HB_SCRIPT_PALMYRENE' value='1348562029'/>
      <enumerator name='HB_SCRIPT_PAU_CIN_HAU' value='1348564323'/>
      <enumerator name='HB_SCRIPT_PSALTER_PAHLAVI' value='1349020784'/>
      <enumerator name='HB_SCRIPT_SIDDHAM' value='1399415908'/>
      <enumerator name='HB_SCRIPT_TIRHUTA' value='1416196712'/>
      <enumerator name='HB_SCRIPT_WARANG_CITI' value='1466004065'/>
      <enumerator name='HB_SCRIPT_INVALID' value='0'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE' value='4294967295'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE_SIGNED' value='2147483647'/>
    </enum-decl>
    <class-decl name='hb_font_t' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='91' column='1' id='4847a5be'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='fd106398' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='parent' type-id='022d8174' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='face' type-id='d4e35730' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='x_scale' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='y_scale' type-id='95e97e5e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='x_ppem' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='y_ppem' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='klass' type-id='af4ab3c8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='user_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='destroy' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='shaper_data' type-id='330059bd' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='110' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_font_t' type-id='4847a5be' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='40' column='1' id='f5655a8d'/>
    <class-decl name='hb_unicode_funcs_t' size-in-bits='2560' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='64' column='1' id='6d435e08'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='203' column='1' id='84a31543'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='6e33b528' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='e5cbe98b' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='83b452b2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='06dd29d8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='e680c8cc' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='0b2f1b2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='6712eb84' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='ae8112a1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__1' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='209' column='1' id='b54283fc'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__2' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='215' column='1' id='a84125dc'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='parent' type-id='db70339e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='immutable' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='func' type-id='84a31543' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='user_data' type-id='b54283fc' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='destroy' type-id='a84125dc' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='219' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='hb_unicode_general_category_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='46' column='1' id='076e7829'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONTROL' value='0'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FORMAT' value='1'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UNASSIGNED' value='2'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PRIVATE_USE' value='3'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SURROGATE' value='4'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LOWERCASE_LETTER' value='5'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_LETTER' value='6'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_LETTER' value='7'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_TITLECASE_LETTER' value='8'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UPPERCASE_LETTER' value='9'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACING_MARK' value='10'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_ENCLOSING_MARK' value='11'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_NON_SPACING_MARK' value='12'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DECIMAL_NUMBER' value='13'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LETTER_NUMBER' value='14'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_NUMBER' value='15'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONNECT_PUNCTUATION' value='16'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DASH_PUNCTUATION' value='17'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CLOSE_PUNCTUATION' value='18'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FINAL_PUNCTUATION' value='19'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_INITIAL_PUNCTUATION' value='20'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_PUNCTUATION' value='21'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OPEN_PUNCTUATION' value='22'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CURRENCY_SYMBOL' value='23'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_SYMBOL' value='24'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MATH_SYMBOL' value='25'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_SYMBOL' value='26'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LINE_SEPARATOR' value='27'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PARAGRAPH_SEPARATOR' value='28'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACE_SEPARATOR' value='29'/>
    </enum-decl>
    <enum-decl name='hb_unicode_combining_class_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='87' column='1' id='e6a1ecc3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NOT_REORDERED' value='0'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_OVERLAY' value='1'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NUKTA' value='7'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_KANA_VOICING' value='8'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_VIRAMA' value='9'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC10' value='10'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC11' value='11'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC12' value='12'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC13' value='13'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC14' value='14'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC15' value='15'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC16' value='16'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC17' value='17'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC18' value='18'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC19' value='19'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC20' value='20'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC21' value='21'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC22' value='22'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC23' value='23'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC24' value='24'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC25' value='25'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC26' value='26'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC27' value='27'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC28' value='28'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC29' value='29'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC30' value='30'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC31' value='31'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC32' value='32'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC33' value='33'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC34' value='34'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC35' value='35'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC36' value='36'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC84' value='84'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC91' value='91'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC103' value='103'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC107' value='107'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC118' value='118'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC122' value='122'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC129' value='129'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC130' value='130'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC133' value='132'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW_LEFT' value='200'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW' value='202'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE' value='214'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE_RIGHT' value='216'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_LEFT' value='218'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW' value='220'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_RIGHT' value='222'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_LEFT' value='224'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_RIGHT' value='226'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_LEFT' value='228'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE' value='230'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_RIGHT' value='232'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_BELOW' value='233'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_ABOVE' value='234'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_IOTA_SUBSCRIPT' value='240'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_INVALID' value='255'/>
    </enum-decl>
    <typedef-decl name='hb_unicode_funcs_t' type-id='6d435e08' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='171' column='1' id='07a8a669'/>
    <typedef-decl name='hb_unicode_combining_class_func_t' type-id='8b0f8e39' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='224' column='1' id='6e33b528'/>
    <typedef-decl name='hb_unicode_eastasian_width_func_t' type-id='ee16bed1' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='227' column='1' id='e5cbe98b'/>
    <typedef-decl name='hb_unicode_general_category_func_t' type-id='576d41bf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='230' column='1' id='83b452b2'/>
    <typedef-decl name='hb_unicode_mirroring_func_t' type-id='cfa3aa71' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='233' column='1' id='06dd29d8'/>
    <typedef-decl name='hb_unicode_script_func_t' type-id='0fa4443d' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='236' column='1' id='e680c8cc'/>
    <typedef-decl name='hb_unicode_compose_func_t' type-id='f184e0c7' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='242' column='1' id='0b2f1b2f'/>
    <typedef-decl name='hb_unicode_decompose_func_t' type-id='d543f608' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='247' column='1' id='6712eb84'/>
    <typedef-decl name='hb_unicode_decompose_compatibility_func_t' type-id='518e9f3c' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='270' column='1' id='ae8112a1'/>
    <typedef-decl name='int8_t' type-id='28577a57' filepath='/usr/include/stdint.h' line='37' column='1' id='ee31ee44'/>
    <typedef-decl name='int16_t' type-id='a2185560' filepath='/usr/include/stdint.h' line='38' column='1' id='23bd8cb5'/>
    <typedef-decl name='int32_t' type-id='95e97e5e' filepath='/usr/include/stdint.h' line='39' column='1' id='3ff5601b'/>
    <typedef-decl name='uint8_t' type-id='002ac4a6' filepath='/usr/include/stdint.h' line='49' column='1' id='b96825af'/>
    <typedef-decl name='uint16_t' type-id='8efea9e5' filepath='/usr/include/stdint.h' line='50' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='f0981eeb' filepath='/usr/include/stdint.h' line='52' column='1' id='8f92235e'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <qualified-type-def type-id='57c520e9' const='yes' id='69ce98fe'/>
    <pointer-type-def type-id='69ce98fe' size-in-bits='64' id='643a95bc'/>
    <qualified-type-def type-id='a959aecb' const='yes' id='8eccec7b'/>
    <pointer-type-def type-id='8eccec7b' size-in-bits='64' id='1d980383'/>
    <qualified-type-def type-id='60021ca7' const='yes' id='b2ab6717'/>
    <reference-type-def kind='lvalue' type-id='b2ab6717' size-in-bits='64' id='74d37223'/>
    <qualified-type-def type-id='73275f42' const='yes' id='3fca8d53'/>
    <pointer-type-def type-id='3fca8d53' size-in-bits='64' id='e4dcb57b'/>
    <qualified-type-def type-id='6d435e08' const='yes' id='feee6819'/>
    <pointer-type-def type-id='feee6819' size-in-bits='64' id='844e0849'/>
    <qualified-type-def type-id='f0981eeb' const='yes' id='20f5f452'/>
    <pointer-type-def type-id='de6e89d9' size-in-bits='64' id='0fa4443d'/>
    <pointer-type-def type-id='24736795' size-in-bits='64' id='8b0f8e39'/>
    <pointer-type-def type-id='c7897c8b' size-in-bits='64' id='576d41bf'/>
    <pointer-type-def type-id='57c520e9' size-in-bits='64' id='191f8691'/>
    <pointer-type-def type-id='9b0d70c8' size-in-bits='64' id='62fafbaf'/>
    <pointer-type-def type-id='a959aecb' size-in-bits='64' id='2f53c570'/>
    <pointer-type-def type-id='f5655a8d' size-in-bits='64' id='022d8174'/>
    <reference-type-def kind='lvalue' type-id='60021ca7' size-in-bits='64' id='40f91e96'/>
    <pointer-type-def type-id='60021ca7' size-in-bits='64' id='4cf9317a'/>
    <reference-type-def kind='lvalue' type-id='ab180530' size-in-bits='64' id='a093d9c7'/>
    <pointer-type-def type-id='ab180530' size-in-bits='64' id='9493c6e3'/>
    <pointer-type-def type-id='07a8a669' size-in-bits='64' id='db70339e'/>
    <pointer-type-def type-id='f15a2796' size-in-bits='64' id='d543f608'/>
    <pointer-type-def type-id='634c497b' size-in-bits='64' id='f184e0c7'/>
    <pointer-type-def type-id='7e5d35b5' size-in-bits='64' id='cfa3aa71'/>
    <pointer-type-def type-id='f57cd2ba' size-in-bits='64' id='518e9f3c'/>
    <pointer-type-def type-id='10778475' size-in-bits='64' id='ee16bed1'/>
    <function-decl name='hb_buffer_serialize_list_formats' mangled-name='hb_buffer_serialize_list_formats' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_list_formats'>
      <return type-id='7d3cd834'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_format_from_string' mangled-name='hb_buffer_serialize_format_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_from_string'>
      <parameter type-id='80f4b756' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <return type-id='a23c3b31'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_format_to_string' mangled-name='hb_buffer_serialize_format_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_to_string'>
      <parameter type-id='a23c3b31' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_glyphs' mangled-name='hb_buffer_serialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_glyphs'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1'/>
      <parameter type-id='f0981eeb' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='247' column='1'/>
      <parameter type-id='f0981eeb' name='end' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='248' column='1'/>
      <parameter type-id='26a90f95' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='249' column='1'/>
      <parameter type-id='f0981eeb' name='buf_size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='250' column='1'/>
      <parameter type-id='807869d3' name='buf_consumed' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='251' column='1'/>
      <parameter type-id='022d8174' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='252' column='1'/>
      <parameter type-id='a23c3b31' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='253' column='1'/>
      <parameter type-id='9562cc1f' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='254' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='hb_buffer_deserialize_glyphs' mangled-name='hb_buffer_deserialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_deserialize_glyphs'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1'/>
      <parameter type-id='80f4b756' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='354' column='1'/>
      <parameter type-id='95e97e5e' name='buf_len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='355' column='1'/>
      <parameter type-id='7d3cd834' name='end_ptr' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='356' column='1'/>
      <parameter type-id='022d8174' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='357' column='1'/>
      <parameter type-id='a23c3b31' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='358' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <class-decl name='hb_shaper_data_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='53' column='1' id='330059bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ot' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fallback' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='9b45d938' size-in-bits='8' id='048e5bff'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <function-type size-in-bits='64' id='de6e89d9'>
      <parameter type-id='db70339e'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='e02a2c4f'/>
    </function-type>
    <function-type size-in-bits='64' id='24736795'>
      <parameter type-id='db70339e'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='e6a1ecc3'/>
    </function-type>
    <function-type size-in-bits='64' id='c7897c8b'>
      <parameter type-id='db70339e'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='076e7829'/>
    </function-type>
    <function-type size-in-bits='64' id='f15a2796'>
      <parameter type-id='db70339e'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='2f53c570'/>
      <parameter type-id='2f53c570'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fd106398'/>
    </function-type>
    <function-type size-in-bits='64' id='634c497b'>
      <parameter type-id='db70339e'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='2f53c570'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fd106398'/>
    </function-type>
    <function-type size-in-bits='64' id='7e5d35b5'>
      <parameter type-id='db70339e'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='a959aecb'/>
    </function-type>
    <function-type size-in-bits='64' id='f57cd2ba'>
      <parameter type-id='db70339e'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='2f53c570'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='f0981eeb'/>
    </function-type>
    <function-type size-in-bits='64' id='10778475'>
      <parameter type-id='db70339e'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='f0981eeb'/>
    </function-type>
    <pointer-type-def type-id='e7d6a3bd' size-in-bits='64' id='d4e35730'/>
    <pointer-type-def type-id='e0cb82cd' size-in-bits='64' id='af4ab3c8'/>
    <typedef-decl name='hb_face_t' type-id='33103862' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='44' column='1' id='e7d6a3bd'/>
    <typedef-decl name='hb_font_funcs_t' type-id='52c7255a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='47' column='1' id='e0cb82cd'/>
    <class-decl name='hb_face_t' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='43' column='1' id='33103862'>
      <member-type access='public'>
        <class-decl name='plan_node_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='59' column='1' id='796ce979'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='shape_plan' type-id='4b761f1c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='60' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='next' type-id='76ba0571' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='61' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='fd106398' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='reference_table_func' type-id='36cb7639' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='user_data' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='destroy' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='index' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='upem' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='num_glyphs' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='shaper_data' type-id='330059bd' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='shape_plans' type-id='76ba0571' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_font_funcs_t' size-in-bits='3072' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='58' column='1' id='52c7255a'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='66' column='1' id='540bfa7a'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='glyph' type-id='edf20f30' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='glyph_h_advance' type-id='470d6fd2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='glyph_v_advance' type-id='8c28fd84' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='glyph_h_origin' type-id='da57d2e2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='glyph_v_origin' type-id='ef07a49c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='glyph_h_kerning' type-id='6a2b14c4' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='glyph_v_kerning' type-id='32616a16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='glyph_extents' type-id='0ac172ae' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='glyph_contour_point' type-id='6645a91c' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='glyph_name' type-id='f25382de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <var-decl name='glyph_from_name' type-id='d1896ec7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__1' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='72' column='1' id='91b99901'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='glyph' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='glyph_h_advance' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='glyph_v_advance' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='glyph_h_origin' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='glyph_v_origin' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='glyph_h_kerning' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='glyph_v_kerning' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='glyph_extents' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='glyph_contour_point' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='glyph_name' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <var-decl name='glyph_from_name' type-id='eaa32e2f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__2' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='78' column='1' id='81c762bc'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='glyph' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='glyph_h_advance' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='glyph_v_advance' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='glyph_h_origin' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='glyph_v_origin' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='glyph_h_kerning' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='glyph_v_kerning' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='glyph_extents' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='glyph_contour_point' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='glyph_name' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <var-decl name='glyph_from_name' type-id='ed954d2d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='fd106398' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='get' type-id='540bfa7a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='user_data' type-id='91b99901' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='destroy' type-id='81c762bc' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='82' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='796ce979' size-in-bits='64' id='76ba0571'/>
    <pointer-type-def type-id='3e9ec359' size-in-bits='64' id='4b761f1c'/>
    <typedef-decl name='hb_font_get_glyph_contour_point_func_t' type-id='d8c35c42' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='127' column='1' id='6645a91c'/>
    <typedef-decl name='hb_font_get_glyph_extents_func_t' type-id='9e69dfc6' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='123' column='1' id='0ac172ae'/>
    <typedef-decl name='hb_font_get_glyph_from_name_func_t' type-id='a223d247' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='137' column='1' id='d1896ec7'/>
    <typedef-decl name='hb_font_get_glyph_func_t' type-id='ae899539' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='97' column='1' id='edf20f30'/>
    <typedef-decl name='hb_font_get_glyph_h_advance_func_t' type-id='2e3a3e2f' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='103' column='1' id='470d6fd2'/>
    <typedef-decl name='hb_font_get_glyph_h_kerning_func_t' type-id='5f398a99' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='116' column='1' id='6a2b14c4'/>
    <typedef-decl name='hb_font_get_glyph_h_origin_func_t' type-id='42df68a1' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='110' column='1' id='da57d2e2'/>
    <typedef-decl name='hb_font_get_glyph_name_func_t' type-id='5e22d31a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='133' column='1' id='f25382de'/>
    <typedef-decl name='hb_font_get_glyph_v_advance_func_t' type-id='2e3a3e2f' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='104' column='1' id='8c28fd84'/>
    <typedef-decl name='hb_font_get_glyph_v_kerning_func_t' type-id='5f398a99' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='117' column='1' id='32616a16'/>
    <typedef-decl name='hb_font_get_glyph_v_origin_func_t' type-id='42df68a1' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='111' column='1' id='ef07a49c'/>
    <typedef-decl name='hb_reference_table_func_t' type-id='899129c7' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='50' column='1' id='36cb7639'/>
    <pointer-type-def type-id='ad9ef563' size-in-bits='64' id='899129c7'/>
    <pointer-type-def type-id='f1e70f9b' size-in-bits='64' id='a223d247'/>
    <pointer-type-def type-id='0acea6e8' size-in-bits='64' id='5e22d31a'/>
    <pointer-type-def type-id='2df2291c' size-in-bits='64' id='9e69dfc6'/>
    <pointer-type-def type-id='e440a805' size-in-bits='64' id='ae899539'/>
    <pointer-type-def type-id='7dfd7d50' size-in-bits='64' id='d8c35c42'/>
    <typedef-decl name='hb_font_get_glyph_advance_func_t' type-id='b3d0598b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='102' column='1' id='2e3a3e2f'/>
    <typedef-decl name='hb_font_get_glyph_kerning_func_t' type-id='134be6b5' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='115' column='1' id='5f398a99'/>
    <typedef-decl name='hb_font_get_glyph_origin_func_t' type-id='7310f374' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='109' column='1' id='42df68a1'/>
    <typedef-decl name='hb_shape_plan_t' type-id='368f2b06' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan.h' line='39' column='1' id='3e9ec359'/>
    <class-decl name='hb_shape_plan_t' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='36' column='1' id='368f2b06'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='825dc3de' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='default_shaper_list' type-id='fd106398' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='face_unsafe' type-id='d4e35730' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='props' type-id='c03d4c5f' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='shaper_func' type-id='cbe55efb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='shaper_name' type-id='80f4b756' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='user_features' type-id='c1ba349d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='num_user_features' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='shaper_data' type-id='330059bd' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='50' column='1'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='64' id='ad9ef563'>
      <parameter type-id='d4e35730'/>
      <parameter type-id='863e9b4e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='9d7b4d1e'/>
    </function-type>
    <function-type size-in-bits='64' id='f1e70f9b'>
      <parameter type-id='022d8174'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='2f53c570'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fd106398'/>
    </function-type>
    <function-type size-in-bits='64' id='0acea6e8'>
      <parameter type-id='022d8174'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='26a90f95'/>
      <parameter type-id='f0981eeb'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fd106398'/>
    </function-type>
    <function-type size-in-bits='64' id='2df2291c'>
      <parameter type-id='022d8174'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='760d24cb'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fd106398'/>
    </function-type>
    <function-type size-in-bits='64' id='e440a805'>
      <parameter type-id='022d8174'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='2f53c570'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fd106398'/>
    </function-type>
    <function-type size-in-bits='64' id='7dfd7d50'>
      <parameter type-id='022d8174'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='f0981eeb'/>
      <parameter type-id='be24ff0e'/>
      <parameter type-id='be24ff0e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fd106398'/>
    </function-type>
    <pointer-type-def type-id='36805602' size-in-bits='64' id='7310f374'/>
    <pointer-type-def type-id='314601a9' size-in-bits='64' id='134be6b5'/>
    <pointer-type-def type-id='ce44bd67' size-in-bits='64' id='b3d0598b'/>
    <function-type size-in-bits='64' id='36805602'>
      <parameter type-id='022d8174'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='be24ff0e'/>
      <parameter type-id='be24ff0e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fd106398'/>
    </function-type>
    <function-type size-in-bits='64' id='314601a9'>
      <parameter type-id='022d8174'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fab7f087'/>
    </function-type>
    <function-type size-in-bits='64' id='ce44bd67'>
      <parameter type-id='022d8174'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='a959aecb'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='fab7f087'/>
    </function-type>
    <pointer-type-def type-id='080f0c70' size-in-bits='64' id='c1ba349d'/>
    <pointer-type-def type-id='9931de52' size-in-bits='64' id='760d24cb'/>
    <pointer-type-def type-id='fab7f087' size-in-bits='64' id='be24ff0e'/>
    <pointer-type-def type-id='44223c94' size-in-bits='64' id='cbe55efb'/>
    <typedef-decl name='hb_tag_t' type-id='8f92235e' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='91' column='1' id='863e9b4e'/>
    <typedef-decl name='hb_feature_t' type-id='40daad3d' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='48' column='1' id='080f0c70'/>
    <typedef-decl name='hb_glyph_extents_t' type-id='ed56fa9b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='89' column='1' id='9931de52'/>
    <typedef-decl name='hb_shape_func_t' type-id='d783e37a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='36' column='1' id='44223c94'/>
    <class-decl name='hb_feature_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='43' column='1' id='40daad3d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tag' type-id='863e9b4e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='value' type-id='8f92235e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_glyph_extents_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='84' column='1' id='ed56fa9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_bearing' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y_bearing' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='fab7f087' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='64' id='d783e37a'>
      <parameter type-id='4b761f1c'/>
      <parameter type-id='022d8174'/>
      <parameter type-id='191f8691'/>
      <parameter type-id='36b4ffde'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='fd106398'/>
    </function-type>
    <pointer-type-def type-id='14d5e340' size-in-bits='64' id='36b4ffde'/>
    <qualified-type-def type-id='080f0c70' const='yes' id='14d5e340'/>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <class-decl name='hb_utf_t&lt;unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='32' column='1' id='1631866e'/>
    <class-decl name='hb_utf_t&lt;unsigned char, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='39' column='1' id='675ac8eb'/>
    <class-decl name='hb_utf_t&lt;short unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='138' column='1' id='2dff2000'/>
    <qualified-type-def type-id='74d37223' id='74d37224'/>
    <qualified-type-def type-id='c03d4c5f' const='yes' id='77bfebcf'/>
    <pointer-type-def type-id='77bfebcf' size-in-bits='64' id='6820597f'/>
    <qualified-type-def type-id='149c6638' const='yes' id='b01a5ac8'/>
    <pointer-type-def type-id='b01a5ac8' size-in-bits='64' id='1b7d11c6'/>
    <qualified-type-def type-id='8f92235e' const='yes' id='b9930aae'/>
    <pointer-type-def type-id='b9930aae' size-in-bits='64' id='a6798dcc'/>
    <qualified-type-def type-id='b96825af' const='yes' id='2b61797f'/>
    <pointer-type-def type-id='2b61797f' size-in-bits='64' id='9f7200cf'/>
    <qualified-type-def type-id='191f8691' const='yes' id='631c326e'/>
    <pointer-type-def type-id='c03d4c5f' size-in-bits='64' id='041dea0a'/>
    <qualified-type-def type-id='db70339e' const='yes' id='986b4f11'/>
    <function-decl name='hb_segment_properties_equal' mangled-name='hb_segment_properties_equal' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_equal'>
      <parameter type-id='6820597f' name='a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1'/>
      <parameter type-id='6820597f' name='b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='41' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <function-decl name='hb_segment_properties_hash' mangled-name='hb_segment_properties_hash' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_hash'>
      <parameter type-id='6820597f' name='p' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='hb_buffer_create' mangled-name='hb_buffer_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_create'>
      <return type-id='191f8691'/>
    </function-decl>
    <function-decl name='hb_buffer_get_empty' mangled-name='hb_buffer_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_empty'>
      <return type-id='191f8691'/>
    </function-decl>
    <function-decl name='hb_buffer_reference' mangled-name='hb_buffer_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reference'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1'/>
      <return type-id='191f8691'/>
    </function-decl>
    <function-decl name='hb_buffer_destroy' mangled-name='hb_buffer_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_destroy'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_set_user_data' mangled-name='hb_buffer_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_user_data'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1'/>
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='773' column='1'/>
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='774' column='1'/>
      <parameter type-id='ed954d2d' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='775' column='1'/>
      <parameter type-id='fd106398' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='776' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <function-decl name='hb_buffer_get_user_data' mangled-name='hb_buffer_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_user_data'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1'/>
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='794' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='hb_buffer_set_content_type' mangled-name='hb_buffer_set_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_content_type'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1'/>
      <parameter type-id='e8b55c7f' name='content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='811' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_get_content_type' mangled-name='hb_buffer_get_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_content_type'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1'/>
      <return type-id='e8b55c7f'/>
    </function-decl>
    <function-decl name='hb_buffer_set_unicode_funcs' mangled-name='hb_buffer_set_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_unicode_funcs'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1'/>
      <parameter type-id='db70339e' name='unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='844' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_get_unicode_funcs' mangled-name='hb_buffer_get_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_unicode_funcs'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1'/>
      <return type-id='db70339e'/>
    </function-decl>
    <function-decl name='hb_buffer_set_direction' mangled-name='hb_buffer_set_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_direction'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1'/>
      <parameter type-id='17bc5dc7' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='885' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_get_direction' mangled-name='hb_buffer_get_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_direction'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1'/>
      <return type-id='17bc5dc7'/>
    </function-decl>
    <function-decl name='hb_buffer_set_script' mangled-name='hb_buffer_set_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_script'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1'/>
      <parameter type-id='e02a2c4f' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='921' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_get_script' mangled-name='hb_buffer_get_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_script'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1'/>
      <return type-id='e02a2c4f'/>
    </function-decl>
    <function-decl name='hb_buffer_set_language' mangled-name='hb_buffer_set_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_language'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1'/>
      <parameter type-id='4817e45a' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='956' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_get_language' mangled-name='hb_buffer_get_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_language'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1'/>
      <return type-id='4817e45a'/>
    </function-decl>
    <function-decl name='hb_buffer_set_segment_properties' mangled-name='hb_buffer_set_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_segment_properties'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1'/>
      <parameter type-id='6820597f' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='991' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_get_segment_properties' mangled-name='hb_buffer_get_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_segment_properties'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1'/>
      <parameter type-id='041dea0a' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1010' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_set_flags' mangled-name='hb_buffer_set_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_flags'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1'/>
      <parameter type-id='77054a06' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1027' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_get_flags' mangled-name='hb_buffer_get_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_flags'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1'/>
      <return type-id='77054a06'/>
    </function-decl>
    <function-decl name='hb_buffer_set_replacement_codepoint' mangled-name='hb_buffer_set_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_replacement_codepoint'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1'/>
      <parameter type-id='a959aecb' name='replacement' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1063' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_get_replacement_codepoint' mangled-name='hb_buffer_get_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_replacement_codepoint'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1'/>
      <return type-id='a959aecb'/>
    </function-decl>
    <function-decl name='hb_buffer_reset' mangled-name='hb_buffer_reset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reset'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_clear_contents' mangled-name='hb_buffer_clear_contents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_clear_contents'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_pre_allocate' mangled-name='hb_buffer_pre_allocate' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_pre_allocate'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <parameter type-id='f0981eeb' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <function-decl name='hb_buffer_allocation_successful' mangled-name='hb_buffer_allocation_successful' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_allocation_successful'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <function-decl name='hb_buffer_add' mangled-name='hb_buffer_add' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1'/>
      <parameter type-id='a959aecb' name='codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1161' column='1'/>
      <parameter type-id='f0981eeb' name='cluster' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1162' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_set_length' mangled-name='hb_buffer_set_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_length'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <parameter type-id='f0981eeb' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <function-decl name='hb_buffer_get_length' mangled-name='hb_buffer_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_length'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='hb_buffer_get_glyph_infos' mangled-name='hb_buffer_get_glyph_infos' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_infos'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1'/>
      <parameter type-id='807869d3' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1238' column='1'/>
      <return type-id='4cf9317a'/>
    </function-decl>
    <function-decl name='hb_buffer_get_glyph_positions' mangled-name='hb_buffer_get_glyph_positions' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_positions'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1'/>
      <parameter type-id='807869d3' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1260' column='1'/>
      <return type-id='9493c6e3'/>
    </function-decl>
    <function-decl name='hb_buffer_reverse' mangled-name='hb_buffer_reverse' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_reverse_clusters' mangled-name='hb_buffer_reverse_clusters' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse_clusters'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_guess_segment_properties' mangled-name='hb_buffer_guess_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_guess_segment_properties'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf8' mangled-name='hb_buffer_add_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf8'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1'/>
      <parameter type-id='80f4b756' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1414' column='1'/>
      <parameter type-id='95e97e5e' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1415' column='1'/>
      <parameter type-id='f0981eeb' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1416' column='1'/>
      <parameter type-id='95e97e5e' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1417' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf16' mangled-name='hb_buffer_add_utf16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf16'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1'/>
      <parameter type-id='1b7d11c6' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1436' column='1'/>
      <parameter type-id='95e97e5e' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1437' column='1'/>
      <parameter type-id='f0981eeb' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1438' column='1'/>
      <parameter type-id='95e97e5e' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1439' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf32' mangled-name='hb_buffer_add_utf32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf32'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1'/>
      <parameter type-id='a6798dcc' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1458' column='1'/>
      <parameter type-id='95e97e5e' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1459' column='1'/>
      <parameter type-id='f0981eeb' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1460' column='1'/>
      <parameter type-id='95e97e5e' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1461' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_add_codepoints' mangled-name='hb_buffer_add_codepoints' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_codepoints'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1'/>
      <parameter type-id='1d980383' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1480' column='1'/>
      <parameter type-id='95e97e5e' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1481' column='1'/>
      <parameter type-id='f0981eeb' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1482' column='1'/>
      <parameter type-id='95e97e5e' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1483' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_buffer_normalize_glyphs' mangled-name='hb_buffer_normalize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_normalize_glyphs'>
      <parameter type-id='191f8691' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <class-decl name='hb_language_item_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='212' column='1' id='1bb48d4b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='e810096b' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lang' type-id='4817e45a' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='215' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='1bb48d4b' const='yes' id='9849e2da'/>
    <pointer-type-def type-id='9849e2da' size-in-bits='64' id='ac503fd0'/>
    <qualified-type-def type-id='ac503fd0' const='yes' id='608e22e3'/>
    <qualified-type-def type-id='d75a0968' const='yes' id='e58002bb'/>
    <reference-type-def kind='lvalue' type-id='1bb48d4b' size-in-bits='64' id='e410031f'/>
    <pointer-type-def type-id='1bb48d4b' size-in-bits='64' id='e810096b'/>
    <qualified-type-def type-id='e810096b' const='yes' id='62bad920'/>
    <qualified-type-def type-id='426cd8b9' id='426cd8ba'/>
    <function-decl name='hb_tag_from_string' mangled-name='hb_tag_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_from_string'>
      <parameter type-id='80f4b756' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <return type-id='863e9b4e'/>
    </function-decl>
    <function-decl name='hb_tag_to_string' mangled-name='hb_tag_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_to_string'>
      <parameter type-id='863e9b4e' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <parameter type-id='26a90f95' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_direction_from_string' mangled-name='hb_direction_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_from_string'>
      <parameter type-id='80f4b756' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <return type-id='17bc5dc7'/>
    </function-decl>
    <function-decl name='hb_direction_to_string' mangled-name='hb_direction_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_to_string'>
      <parameter type-id='17bc5dc7' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='hb_language_from_string' mangled-name='hb_language_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_from_string'>
      <parameter type-id='80f4b756' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <return type-id='4817e45a'/>
    </function-decl>
    <function-decl name='hb_language_to_string' mangled-name='hb_language_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_to_string'>
      <parameter type-id='4817e45a' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='hb_language_get_default' mangled-name='hb_language_get_default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_get_default'>
      <return type-id='4817e45a'/>
    </function-decl>
    <function-decl name='hb_script_from_iso15924_tag' mangled-name='hb_script_from_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_iso15924_tag'>
      <parameter type-id='863e9b4e' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1'/>
      <return type-id='e02a2c4f'/>
    </function-decl>
    <function-decl name='hb_script_from_string' mangled-name='hb_script_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_string'>
      <parameter type-id='80f4b756' name='s' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <parameter type-id='95e97e5e' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <return type-id='e02a2c4f'/>
    </function-decl>
    <function-decl name='hb_script_to_iso15924_tag' mangled-name='hb_script_to_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_to_iso15924_tag'>
      <parameter type-id='e02a2c4f' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1'/>
      <return type-id='863e9b4e'/>
    </function-decl>
    <function-decl name='hb_script_get_horizontal_direction' mangled-name='hb_script_get_horizontal_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_get_horizontal_direction'>
      <parameter type-id='e02a2c4f' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1'/>
      <return type-id='17bc5dc7'/>
    </function-decl>
    <function-decl name='hb_version' mangled-name='hb_version' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version'>
      <parameter type-id='807869d3' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1'/>
      <parameter type-id='807869d3' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='548' column='1'/>
      <parameter type-id='807869d3' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='549' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_version_string' mangled-name='hb_version_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_string'>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='hb_version_atleast' mangled-name='hb_version_atleast' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_atleast'>
      <parameter type-id='f0981eeb' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1'/>
      <parameter type-id='f0981eeb' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='585' column='1'/>
      <parameter type-id='f0981eeb' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='586' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-face.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='94eda2ef' size-in-bits='32' id='08204ba6'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='767ae7db' size-in-bits='128' id='b164f8c2'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' id='0f4b9e74'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <class-decl name='hb_auto_trace_t&lt;0, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='749' column='1' id='6f2257b0'>
      <member-function access='public'>
        <function-decl name='hb_auto_trace_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='797' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a81985b6' is-artificial='yes'/>
          <parameter type-id='807869d3'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='80f4b756'/>
          <parameter is-variadic='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='cd589039' size-in-bits='64' id='5733e011'/>
    <qualified-type-def type-id='5733e011' const='yes' id='1ec1bfee'/>
    <pointer-type-def type-id='800228a3' size-in-bits='64' id='3e93f393'/>
    <pointer-type-def type-id='cf2ea6fb' size-in-bits='64' id='ad78de4b'/>
    <pointer-type-def type-id='b9861d38' size-in-bits='64' id='1fc811fe'/>
    <pointer-type-def type-id='1ec65e80' size-in-bits='64' id='a70af086'/>
    <qualified-type-def type-id='a70af086' const='yes' id='2d9df339'/>
    <pointer-type-def type-id='bb4be765' size-in-bits='64' id='64ca95b5'/>
    <pointer-type-def type-id='f5cfcae8' size-in-bits='64' id='cd1ddede'/>
    <qualified-type-def type-id='cd1ddede' const='yes' id='cde357d1'/>
    <pointer-type-def type-id='4911f971' size-in-bits='64' id='675cdb69'/>
    <pointer-type-def type-id='39e17099' size-in-bits='64' id='96caa8b1'/>
    <pointer-type-def type-id='1c64eff2' size-in-bits='64' id='9761a290'/>
    <pointer-type-def type-id='9c7d2ab6' size-in-bits='64' id='a28283dc'/>
    <qualified-type-def type-id='a28283dc' const='yes' id='8a179247'/>
    <pointer-type-def type-id='95e4de29' size-in-bits='64' id='8e348f51'/>
    <reference-type-def kind='lvalue' type-id='1efa9947' size-in-bits='64' id='b2be891b'/>
    <pointer-type-def type-id='1efa9947' size-in-bits='64' id='aebe82cf'/>
    <qualified-type-def type-id='aebe82cf' const='yes' id='071de45c'/>
    <reference-type-def kind='lvalue' type-id='94eda2ef' size-in-bits='64' id='e39ca893'/>
    <pointer-type-def type-id='94eda2ef' size-in-bits='64' id='ef9cbb77'/>
    <qualified-type-def type-id='ef9cbb77' const='yes' id='3cd3e024'/>
    <pointer-type-def type-id='47b5763d' size-in-bits='64' id='0380710d'/>
    <qualified-type-def type-id='0380710d' const='yes' id='d3b551e2'/>
    <reference-type-def kind='lvalue' type-id='741d8570' size-in-bits='64' id='c6b25dea'/>
    <pointer-type-def type-id='e46cf9da' size-in-bits='64' id='ea6d94f8'/>
    <qualified-type-def type-id='ea6d94f8' const='yes' id='20df758b'/>
    <pointer-type-def type-id='66944035' size-in-bits='64' id='65a66565'/>
    <qualified-type-def type-id='65a66565' const='yes' id='64aec85a'/>
    <pointer-type-def type-id='767ae7db' size-in-bits='64' id='20c370db'/>
    <pointer-type-def type-id='d5381802' size-in-bits='64' id='0e4c7710'/>
    <pointer-type-def type-id='316f4e21' size-in-bits='64' id='f7829ef9'/>
    <qualified-type-def type-id='f7829ef9' const='yes' id='2a36ae16'/>
    <pointer-type-def type-id='61c89292' size-in-bits='64' id='e0d77320'/>
    <pointer-type-def type-id='62797b94' size-in-bits='64' id='d55bca92'/>
    <qualified-type-def type-id='d55bca92' const='yes' id='5b42fd1d'/>
    <pointer-type-def type-id='0d37cc34' size-in-bits='64' id='6cc0ec22'/>
    <qualified-type-def type-id='6cc0ec22' const='yes' id='6ed2392d'/>
    <qualified-type-def type-id='cd589039' const='yes' id='20688840'/>
    <pointer-type-def type-id='20688840' size-in-bits='64' id='6e8ebede'/>
    <qualified-type-def type-id='6e8ebede' const='yes' id='1ccd37d1'/>
    <qualified-type-def type-id='800228a3' const='yes' id='bc98c348'/>
    <reference-type-def kind='lvalue' type-id='bc98c348' size-in-bits='64' id='527ba62a'/>
    <pointer-type-def type-id='bc98c348' size-in-bits='64' id='467b9346'/>
    <qualified-type-def type-id='cf2ea6fb' const='yes' id='cf7e7238'/>
    <reference-type-def kind='lvalue' type-id='cf7e7238' size-in-bits='64' id='c20da53a'/>
    <pointer-type-def type-id='cf7e7238' size-in-bits='64' id='b60d9256'/>
    <qualified-type-def type-id='b9861d38' const='yes' id='c7d56f3d'/>
    <reference-type-def kind='lvalue' type-id='c7d56f3d' size-in-bits='64' id='affde781'/>
    <pointer-type-def type-id='c7d56f3d' size-in-bits='64' id='abfde135'/>
    <qualified-type-def type-id='abfde135' const='yes' id='869c8c2a'/>
    <qualified-type-def type-id='1ec65e80' const='yes' id='67606479'/>
    <qualified-type-def type-id='1bbe018d' id='1bbe018e'/>
    <reference-type-def kind='lvalue' type-id='67606479' size-in-bits='64' id='1bbe018d'/>
    <pointer-type-def type-id='67606479' size-in-bits='64' id='0fbdeea9'/>
    <qualified-type-def type-id='0fbdeea9' const='yes' id='ee0487c6'/>
    <qualified-type-def type-id='bb4be765' const='yes' id='40551644'/>
    <pointer-type-def type-id='40551644' size-in-bits='64' id='b3f24f2a'/>
    <qualified-type-def type-id='f5cfcae8' const='yes' id='bbd1868d'/>
    <pointer-type-def type-id='bbd1868d' size-in-bits='64' id='51d6f8e5'/>
    <qualified-type-def type-id='4911f971' const='yes' id='1468a478'/>
    <reference-type-def kind='lvalue' type-id='1468a478' size-in-bits='64' id='7ebabffa'/>
    <pointer-type-def type-id='1468a478' size-in-bits='64' id='72baad16'/>
    <qualified-type-def type-id='39e17099' const='yes' id='87b6dac0'/>
    <reference-type-def kind='lvalue' type-id='87b6dac0' size-in-bits='64' id='8ada9812'/>
    <pointer-type-def type-id='87b6dac0' size-in-bits='64' id='8eda9e5e'/>
    <qualified-type-def type-id='1c64eff2' const='yes' id='01a37c4d'/>
    <reference-type-def kind='lvalue' type-id='01a37c4d' size-in-bits='64' id='ff5cdc71'/>
    <pointer-type-def type-id='01a37c4d' size-in-bits='64' id='fb5cd625'/>
    <qualified-type-def type-id='fb5cd625' const='yes' id='047e599a'/>
    <qualified-type-def type-id='9c7d2ab6' const='yes' id='13b8b8c5'/>
    <qualified-type-def type-id='eecb0d59' id='eecb0d5a'/>
    <reference-type-def kind='lvalue' type-id='13b8b8c5' size-in-bits='64' id='eecb0d59'/>
    <pointer-type-def type-id='13b8b8c5' size-in-bits='64' id='facb203d'/>
    <qualified-type-def type-id='facb203d' const='yes' id='61513692'/>
    <qualified-type-def type-id='95e4de29' const='yes' id='e9ffc85c'/>
    <pointer-type-def type-id='e9ffc85c' size-in-bits='64' id='d3a891c2'/>
    <qualified-type-def type-id='f9328f62' const='yes' id='2925da5f'/>
    <pointer-type-def type-id='2925da5f' size-in-bits='64' id='3b96e62f'/>
    <qualified-type-def type-id='1efa9947' const='yes' id='9cc376f0'/>
    <reference-type-def kind='lvalue' type-id='9cc376f0' size-in-bits='64' id='9db412e2'/>
    <pointer-type-def type-id='9cc376f0' size-in-bits='64' id='a1b4192e'/>
    <qualified-type-def type-id='a1b4192e' const='yes' id='f4603da1'/>
    <qualified-type-def type-id='94eda2ef' const='yes' id='4fc7a08c'/>
    <reference-type-def kind='lvalue' type-id='4fc7a08c' size-in-bits='64' id='4141eb9e'/>
    <pointer-type-def type-id='4fc7a08c' size-in-bits='64' id='3d41e552'/>
    <qualified-type-def type-id='3d41e552' const='yes' id='043b235d'/>
    <qualified-type-def type-id='3891f6c3' const='yes' id='5800d7d3'/>
    <reference-type-def kind='lvalue' type-id='5800d7d3' size-in-bits='64' id='7e53f6af'/>
    <qualified-type-def type-id='47b5763d' const='yes' id='dea93a3c'/>
    <pointer-type-def type-id='dea93a3c' size-in-bits='64' id='9a6670a2'/>
    <qualified-type-def type-id='9a6670a2' const='yes' id='862799ad'/>
    <qualified-type-def type-id='e46cf9da' const='yes' id='3f77dc39'/>
    <pointer-type-def type-id='3f77dc39' size-in-bits='64' id='fcaf71e9'/>
    <qualified-type-def type-id='fcaf71e9' const='yes' id='ccb3f486'/>
    <qualified-type-def type-id='66944035' const='yes' id='7d57f556'/>
    <pointer-type-def type-id='7d57f556' size-in-bits='64' id='cd777234'/>
    <qualified-type-def type-id='cd777234' const='yes' id='c12fd47f'/>
    <qualified-type-def type-id='767ae7db' const='yes' id='2991f388'/>
    <reference-type-def kind='lvalue' type-id='2991f388' size-in-bits='64' id='1ec29aea'/>
    <pointer-type-def type-id='2991f388' size-in-bits='64' id='12c28806'/>
    <qualified-type-def type-id='d5381802' const='yes' id='150639ed'/>
    <pointer-type-def type-id='150639ed' size-in-bits='64' id='dfccf445'/>
    <qualified-type-def type-id='19911c50' const='yes' id='830500c0'/>
    <pointer-type-def type-id='830500c0' size-in-bits='64' id='2ae0705e'/>
    <qualified-type-def type-id='316f4e21' const='yes' id='cf0583f6'/>
    <pointer-type-def type-id='cf0583f6' size-in-bits='64' id='c1ae9354'/>
    <qualified-type-def type-id='c1ae9354' const='yes' id='88fd271f'/>
    <qualified-type-def type-id='62797b94' const='yes' id='4dbdd33d'/>
    <pointer-type-def type-id='4dbdd33d' size-in-bits='64' id='78d34d35'/>
    <qualified-type-def type-id='78d34d35' const='yes' id='8966982a'/>
    <qualified-type-def type-id='0d37cc34' const='yes' id='f8c2156d'/>
    <pointer-type-def type-id='f8c2156d' size-in-bits='64' id='e0877ec5'/>
    <qualified-type-def type-id='e0877ec5' const='yes' id='a35e45ba'/>
    <qualified-type-def type-id='33103862' const='yes' id='1dd4ab4d'/>
    <pointer-type-def type-id='1dd4ab4d' size-in-bits='64' id='5cc9d325'/>
    <qualified-type-def type-id='5cc9d325' const='yes' id='f09b6e9a'/>
    <qualified-type-def type-id='52c7255a' const='yes' id='22e92cdd'/>
    <pointer-type-def type-id='22e92cdd' size-in-bits='64' id='ec11c8d5'/>
    <qualified-type-def type-id='4847a5be' const='yes' id='8d95617d'/>
    <pointer-type-def type-id='8d95617d' size-in-bits='64' id='39283bf5'/>
    <qualified-type-def type-id='368f2b06' const='yes' id='094f6269'/>
    <pointer-type-def type-id='094f6269' size-in-bits='64' id='eaf7af79'/>
    <qualified-type-def type-id='863e9b4e' const='yes' id='fd26009e'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <reference-type-def kind='lvalue' type-id='2448a865' size-in-bits='64' id='6160e179'/>
    <pointer-type-def type-id='6f2257b0' size-in-bits='64' id='a81985b6'/>
    <qualified-type-def type-id='a81985b6' const='yes' id='85e930a9'/>
    <function-decl name='hb_face_create_for_tables' mangled-name='hb_face_create_for_tables' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_create_for_tables'>
      <parameter type-id='36cb7639' name='reference_table_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='83' column='1'/>
      <parameter type-id='eaa32e2f' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='84' column='1'/>
      <parameter type-id='ed954d2d' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='85' column='1'/>
      <return type-id='d4e35730'/>
    </function-decl>
    <function-decl name='hb_face_create' mangled-name='hb_face_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_create'>
      <parameter type-id='9d7b4d1e' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='163' column='1'/>
      <parameter type-id='f0981eeb' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='164' column='1'/>
      <return type-id='d4e35730'/>
    </function-decl>
    <function-decl name='hb_face_get_empty' mangled-name='hb_face_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_empty'>
      <return type-id='d4e35730'/>
    </function-decl>
    <function-decl name='hb_face_reference' mangled-name='hb_face_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='212' column='1'/>
      <return type-id='d4e35730'/>
    </function-decl>
    <function-decl name='hb_face_destroy' mangled-name='hb_face_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_destroy'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_face_set_user_data' mangled-name='hb_face_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_user_data'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='263' column='1'/>
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='264' column='1'/>
      <parameter type-id='eaa32e2f' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='265' column='1'/>
      <parameter type-id='ed954d2d' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='266' column='1'/>
      <parameter type-id='fd106398' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='267' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <function-decl name='hb_face_get_user_data' mangled-name='hb_face_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_user_data'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='284' column='1'/>
      <parameter type-id='49203b03' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='285' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='hb_face_make_immutable' mangled-name='hb_face_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_make_immutable'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_face_is_immutable' mangled-name='hb_face_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_is_immutable'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='318' column='1'/>
      <return type-id='fd106398'/>
    </function-decl>
    <function-decl name='hb_face_reference_table' mangled-name='hb_face_reference_table' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference_table'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='336' column='1'/>
      <parameter type-id='863e9b4e' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='337' column='1'/>
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <function-decl name='hb_face_reference_blob' mangled-name='hb_face_reference_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference_blob'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='353' column='1'/>
      <return type-id='9d7b4d1e'/>
    </function-decl>
    <function-decl name='hb_face_set_index' mangled-name='hb_face_set_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_index'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <parameter type-id='f0981eeb' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_face_get_index' mangled-name='hb_face_get_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_index'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='hb_face_set_upem' mangled-name='hb_face_set_upem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_upem'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <parameter type-id='f0981eeb' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_face_get_upem' mangled-name='hb_face_get_upem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_upem'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='hb_face_set_glyph_count' mangled-name='hb_face_set_glyph_count' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_glyph_count'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <parameter type-id='f0981eeb' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='hb_face_get_glyph_count' mangled-name='hb_face_get_glyph_count' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_glyph_count'>
      <parameter type-id='d4e35730' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <namespace-decl name='OT'>
      <class-decl name='TableRecord' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='55' column='1' id='767ae7db'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tag' type-id='d5381802' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='checkSum' type-id='bb4be765' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='offset' type-id='19911c50' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='length' type-id='19911c50' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='65' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='20f5f452' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='20f5f452' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='OffsetTable' size-in-bits='224' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='71' column='1' id='1efa9947'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='sfnt_version' type-id='d5381802' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='111' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='numTables' type-id='0f676950' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='112' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='48'>
          <var-decl name='searchRangeZ' type-id='0f676950' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='113' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='entrySelectorZ' type-id='0f676950' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='114' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='80'>
          <var-decl name='rangeShiftZ' type-id='0f676950' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='115' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='96'>
          <var-decl name='tables' type-id='b164f8c2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='116' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='20f5f452' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='118' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='OpenTypeFontFace' type-id='1efa9947' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='119' column='1' id='3891f6c3'/>
      <class-decl name='TTCHeaderVersion1' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='127' column='1' id='66944035'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='ttcTag' type-id='d5381802' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='139' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='version' type-id='f5cfcae8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='140' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='table' type-id='cd589039' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='143' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='20f5f452' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='146' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='TTCHeader' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='150' column='1' id='e46cf9da'>
        <member-type access='protected'>
          <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='183' column='1' id='004626db'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='184' column='1' id='431f3254'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='ttcTag' type-id='d5381802' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='185' column='1'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='32'>
                  <var-decl name='version' type-id='f5cfcae8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='186' column='1'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='header' type-id='431f3254' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='188' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='version1' type-id='66944035' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='189' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='u' type-id='004626db' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='190' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='OpenTypeFontFile' size-in-bits='224' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='199' column='1' id='47b5763d'>
        <member-type access='protected'>
          <union-decl name='__anonymous_union__' size-in-bits='224' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='250' column='1' id='f3038d2e'>
            <data-member access='public'>
              <var-decl name='tag' type-id='d5381802' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='251' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='fontFace' type-id='3891f6c3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='252' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='ttcHeader' type-id='e46cf9da' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='253' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='tableTag' type-id='fd26009e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='200' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='CFFTag' type-id='fd26009e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='202' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TrueTypeTag' type-id='fd26009e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='203' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TTCTag' type-id='fd26009e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='204' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TrueTag' type-id='fd26009e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='205' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='Typ1Tag' type-id='fd26009e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='206' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='u' type-id='f3038d2e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='254' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='20f5f452' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='256' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='hb_sanitize_context_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='178' column='1' id='316f4e21'>
        <member-type access='public'>
          <typedef-decl name='return_t' type-id='c894953d' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='181' column='1' id='c887e4af'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='max_debug_depth' type-id='20f5f452' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='180' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='debug_depth' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='280' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='start' type-id='80f4b756' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='end' type-id='80f4b756' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='writable' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='282' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='edit_count' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='283' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='blob' type-id='9d7b4d1e' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='284' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='ef9cbb77'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::maxp&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='e0877ec5'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::head&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='78d34d35'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::IntType&lt;unsigned int, 4u&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='facb203d'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTable&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='a1b4192e'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::FixedVersion&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='51d6f8e5'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='6e8ebede'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='3d41e552'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::SortedArrayOf&lt;OT::UnicodeValueRange, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='dd72c4a2'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::SortedArrayOf&lt;OT::UVSMapping, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='51e272fd'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::CmapSubtable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='edd44533'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::EncodingRecord, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='bfdc9df3'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::IntType&lt;short unsigned int, 2u&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='fb5cd625'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableFormat0&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='f452166d'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableFormat4&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='4c481399'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::USHORT, uint16_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='888d86bd'/>
            <parameter type-id='277d24aa'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='33424227'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableTrimmed&lt;OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='4a28cb55'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='a38ed457'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableTrimmed&lt;OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='59585fe5'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::CmapSubtableLongGroup, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='a1a247ff'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableLongSegmented&lt;OT::CmapSubtableFormat12&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='c65c59f2'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableLongSegmented&lt;OT::CmapSubtableFormat13&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='ace9d679'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::VariationSelectorRecord, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='22a54efe'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::UnicodeValueRange, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='bc8a6df2'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::SortedArrayOf&lt;OT::UnicodeValueRange, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='94c215ed'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::UVSMapping, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='c1250455'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::SortedArrayOf&lt;OT::UVSMapping, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='aa3cb92c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::VariationSelectorRecord&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='e8f7464e'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableFormat14&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='6d6b9e38'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::CmapSubtable, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='e46a86f4'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::EncodingRecord&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='e4f18d1b'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::cmap&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='ba1bc7c8'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::_hea&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='f8fba210'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::LangSys, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='5773fe83'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::FeatureParams, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='77e6c3b2'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Coverage, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='024f4052'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Device, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='dd7ca086'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::ClassDef, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='0d49d71f'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::AttachList, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='d2ff648d'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::LigCaretList, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='d8737847'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::MarkGlyphSets, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='7e72e95a'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::RecordListOf&lt;OT::Script&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='7327fcae'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::RecordListOf&lt;OT::Feature&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='d455fdf5'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::Lookup&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='fa89e5e3'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::SubstLookup&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='38d6477c'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Anchor, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='eca1d72d'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::MarkArray, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='d61eefa4'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::AnchorMatrix, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='38c0114c'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::AnchorMatrix&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='78d1b1cd'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::PosLookup&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='0cb53281'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::ArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='26056100'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::CaretValue, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='900f4540'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::LigGlyph, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='9693a816'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Coverage, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='bda39d2e'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Rule, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='42b61aba'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::RuleSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='e19ea9a0'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::ChainRule, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='99593209'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::ChainRuleSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='7704f9b1'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Sequence, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='db81ea35'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Ligature, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='9788830d'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::LigatureSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='648ec76d'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::SubstLookupSubTable, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='9c6a15c3'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::PairSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='008b93ce'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::PosLookupSubTable, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='f9bee81c'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Lookup, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='549fc37a'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::SubstLookup, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='1301c531'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::PosLookup, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='386ae5aa'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Script, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='5ac4d537'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Feature, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='9f1f53fc'/>
            <parameter type-id='6160e179'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::RangeRecord, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='dd4550eb'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Coverage, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='0b49d359'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::ArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='ca0555c7'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::ArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='b95415db'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::AttachList, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='ea4b9f52'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::LigGlyph, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='87fa6db9'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::CaretValue, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='fe5add87'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CaretValueFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='c0e53cb3'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CaretValueFormat2&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='e6e7b71c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::Device&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='246cf525'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Device, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='dc4eeaa1'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CaretValueFormat3&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='e0e9ec41'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::CaretValue, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='7c79b8ab'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::LigGlyph, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='2dc3d535'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::LigCaretList, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='11c38f60'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ClassDefFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='b5f39624'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::ClassDef, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='6a2eacc8'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::Coverage, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='49eb62c5'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Coverage, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='696872b1'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::MarkGlyphSets, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='18377a1b'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::Record&lt;OT::Script&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='7031231c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::Index, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='5c4ddea3'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::LangSys&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='5147206a'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::LangSys, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='637af08e'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::Record&lt;OT::LangSys&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='5b5cd536'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::Record&lt;OT::LangSys&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='d911e8ae'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Script, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='263a7874'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::Record&lt;OT::Script&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='3b99e3fa'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::RecordListOf&lt;OT::Script&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='aaf3d795'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::Record&lt;OT::Feature&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='dd099223'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::FeatureParamsSize&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='889258de'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::FeatureParamsStylisticSet&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='8d22ac4f'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::IntType&lt;unsigned int, 3u&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='e71d1742'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::FeatureParamsCharacterVariants&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='066d8808'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::FeatureParams, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='36ce0e23'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::Feature&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='a436fa43'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::FeatureParams, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::OffsetTo&lt;OT::FeatureParams, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='f7829ef9' is-artificial='yes'/>
            <parameter type-id='77e6c3b2'/>
            <parameter type-id='42ce2107'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Feature, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='b8c96b55'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::Record&lt;OT::Feature&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='49c139e1'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::RecordListOf&lt;OT::Feature&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='d83597cc'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::Lookup, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='1c79db09'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::Offset&lt;OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='99a1f907'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::Lookup&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='c6dcac21'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Lookup, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='c37e540d'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::Lookup&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='6e35fcf8'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::SubstLookup, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='fc9eed10'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::SubstLookupSubTable, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='144cb786'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::IntType&lt;short int, 2u&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='8eda9e5e'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::Sequence, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='d115591c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Sequence, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='3f644d46'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::LigatureSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='c931ba38'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::Ligature, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='4bd6fd58'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::HeadlessArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='6be0ab82'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Ligature, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='daf83062'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::LigatureSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='5814d138'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::RuleSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='16d35e3f'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::Rule, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='37772b49'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Rule, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='c5cb74dd'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::RuleSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='5f46519d'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ContextFormat3&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='62efc660'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::ChainRuleSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='1f67131c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::ChainRule, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='e190cc04'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::LookupRecord, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='4c460df4'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::ChainRule, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='4480a130'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::ChainRuleSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='c1f1a2a6'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::Coverage, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='3a6a7e91'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ExtensionFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='a0c7ed84'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::SubstLookupSubTable, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='9262f31a'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::SubstLookup, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='4f5366ac'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::SubstLookup&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='831597ad'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::PosLookup, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='90fd3735'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::PosLookupSubTable, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='ba52585b'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::PairSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='8269b385'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::PairSet&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='abea7135'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::PairSet, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='4bac2c1b'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::EntryExitRecord, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='58b417da'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::AnchorFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='3b04ec7a'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::AnchorFormat2&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='9d0c4285'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::AnchorFormat3&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='b30a2690'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::Anchor, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='85d62bc2'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::MarkRecord, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='9b81c457'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::MarkRecord&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='c94eeb07'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::MarkArray, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='ba6a9db1'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::AnchorMatrix&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='95df21b3'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::AnchorMatrix, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='547a86ff'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::MarkBasePosFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='7648deb3'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::AnchorMatrix, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='115a03b3'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::AnchorMatrix&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='2ba4c46a'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::MarkLigPosFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='877d6294'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::MarkMarkPosFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='91540f5f'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::SinglePosFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='f7217373'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::SinglePosFormat2&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='1d23eddc'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::PairPosFormat1&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='6b9317fb'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::PairPosFormat2&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='51952da4'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::PosLookupSubTable, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='cea7d759'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::PosLookup, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='12e0c923'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::PosLookup&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='c1ae9354' is-artificial='yes'/>
            <parameter type-id='3de2168c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Sanitizer&lt;OT::OpenTypeFontFile&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' id='fbd52e83'/>
      <class-decl name='Sanitizer&lt;OT::head&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' id='aaf7f0a8'/>
      <class-decl name='Sanitizer&lt;OT::maxp&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' id='c320dc78'/>
      <class-decl name='hb_serialize_context_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='377' column='1' id='61c89292'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='debug_depth' type-id='f0981eeb' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='start' type-id='26a90f95' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='end' type-id='26a90f95' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='head' type-id='26a90f95' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='ran_out_of_room' type-id='c894953d' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='482' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='hb_serialize_context_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e0d77320' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='f0981eeb'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='start_embed&lt;OT::Coverage&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e0d77320' is-artificial='yes'/>
            <return type-id='549ad36e'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='start_embed&lt;OT::Ligature&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e0d77320' is-artificial='yes'/>
            <return type-id='64c1202b'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='start_embed&lt;OT::LigatureSet&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e0d77320' is-artificial='yes'/>
            <return type-id='2f5d0c31'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='start_embed&lt;OT::SubstLookupSubTable&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e0d77320' is-artificial='yes'/>
            <return type-id='6e9f4733'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='start_embed&lt;OT::SubstLookup&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e0d77320' is-artificial='yes'/>
