<abi-corpus version='2.0' path='data/test-read-dwarf/test14-pr18893.so' soname='libGLU.so.1'>
  <elf-needed>
    <dependency name='libGL.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='gluBeginCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild1DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild1DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild2DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild2DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gluEndTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluErrorString' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetString' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluLoadSamplingMatrices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluLookAt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewNurbsRenderer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewQuadric' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewTess' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNextContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallbackData' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallbackDataEXT' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluOrtho2D' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPartialDisk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPerspective' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPickMatrix' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPwlCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricDrawStyle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricNormals' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricOrientation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricTexture' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluScaleImage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluSphere' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessBeginContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessEndContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessEndPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessNormal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessVertex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluUnProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluUnProject4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='libnurbs/interface/glcurveval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='5120' id='8ac42fbe'>
      <subrange length='160' type-id='7359adad' id='d20f9a26'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='1280' id='2ce43ee1'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <class-decl name='curveEvalMachine' size-in-bits='6592' is-struct='yes' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='55' column='1' id='39487693'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='k' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ustride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctlpoints' type-id='8ac42fbe' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ucoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='curveEvalMachine' type-id='39487693' filepath='libnurbs/interface/glcurveval.h' line='64' column='1' id='a7431a56'/>
    <class-decl name='CachingEvaluator' size-in-bits='64' visibility='default' filepath='libnurbs/internals/cachingeval.h' line='39' column='1' id='98511c0f'>
      <member-type access='private'>
        <enum-decl name='ServiceMode' filepath='libnurbs/internals/cachingeval.h' line='42' column='1' id='85ef429a'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='play' value='0'/>
          <enumerator name='record' value='1'/>
          <enumerator name='playAndRecord' value='2'/>
        </enum-decl>
      </member-type>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~CachingEvaluator' filepath='libnurbs/internals/cachingeval.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='canRecord' mangled-name='_ZN16CachingEvaluator9canRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='canPlayAndRecord' mangled-name='_ZN16CachingEvaluator16canPlayAndRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='createHandle' mangled-name='_ZN16CachingEvaluator12createHandleEi' filepath='libnurbs/internals/cachingeval.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='beginOutput' mangled-name='_ZN16CachingEvaluator11beginOutputENS_11ServiceModeEi' filepath='libnurbs/internals/cachingeval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='85ef429a'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <function-decl name='endOutput' mangled-name='_ZN16CachingEvaluator9endOutputEv' filepath='libnurbs/internals/cachingeval.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='7'>
        <function-decl name='discardRecording' mangled-name='_ZN16CachingEvaluator16discardRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='8'>
        <function-decl name='playRecording' mangled-name='_ZN16CachingEvaluator13playRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='REAL' type-id='a6c45d85' filepath='libnurbs/internals/types.h' line='41' column='1' id='234bc418'/>
    <pointer-type-def type-id='22b18ed5' size-in-bits='64' id='11a0d165'/>
    <pointer-type-def type-id='98511c0f' size-in-bits='64' id='d4b6ed87'/>
    <pointer-type-def type-id='6abc0132' size-in-bits='64' id='a3f18a30'/>
    <pointer-type-def type-id='8d4b0ae2' size-in-bits='64' id='83a254c0'/>
    <qualified-type-def type-id='83a254c0' const='yes' id='6f423093'/>
    <pointer-type-def type-id='234bc418' size-in-bits='64' id='c0eda015'/>
    <qualified-type-def type-id='46496ee3' const='yes' id='9d5e4f33'/>
    <pointer-type-def type-id='9d5e4f33' size-in-bits='64' id='d476845b'/>
    <pointer-type-def type-id='a7431a56' size-in-bits='64' id='8278cb23'/>
    <pointer-type-def type-id='6485bd28' size-in-bits='64' id='318ea842'/>
    <pointer-type-def type-id='f267cc92' size-in-bits='64' id='5a82918c'/>
    <class-decl name='CurveMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='6abc0132'/>
    <class-decl name='OpenGLCurveEvaluator' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='66' column='1' is-declaration-only='yes' id='8d4b0ae2'>
      <base-class access='public' layout-offset-in-bits='0' type-id='22b18ed5'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='em_vertex' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='102' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6656'>
        <var-decl name='em_normal' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='103' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13248'>
        <var-decl name='em_color' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='104' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19840'>
        <var-decl name='em_texcoord' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26432'>
        <var-decl name='vertex_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26464'>
        <var-decl name='normal_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26496'>
        <var-decl name='color_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26528'>
        <var-decl name='texcoord_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26560'>
        <var-decl name='global_grid_u0' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26592'>
        <var-decl name='global_grid_u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <var-decl name='global_grid_nu' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26688'>
        <var-decl name='beginCallBackN' type-id='30135957' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26752'>
        <var-decl name='endCallBackN' type-id='953b12f8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26816'>
        <var-decl name='vertexCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26880'>
        <var-decl name='normalCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26944'>
        <var-decl name='colorCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27008'>
        <var-decl name='texcoordCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27072'>
        <var-decl name='beginCallBackData' type-id='5f8a287b' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27136'>
        <var-decl name='endCallBackData' type-id='b7f9d8e6' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27200'>
        <var-decl name='vertexCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27264'>
        <var-decl name='normalCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27328'>
        <var-decl name='colorCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <var-decl name='texcoordCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <var-decl name='userData' type-id='eaa32e2f' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <var-decl name='output_triangles' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='154' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <function-decl name='domain1f' mangled-name='_ZN20OpenGLCurveEvaluator8domain1fEff' filepath='libnurbs/interface/glcurveval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <function-decl name='range1f' mangled-name='_ZN20OpenGLCurveEvaluator7range1fElPfS0_' filepath='libnurbs/interface/glcurveval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN20OpenGLCurveEvaluator6enableEl' filepath='libnurbs/interface/glcurveval.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN20OpenGLCurveEvaluator7disableEl' filepath='libnurbs/interface/glcurveval.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <function-decl name='bgnmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8bgnmap1fEl' filepath='libnurbs/interface/glcurveval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <function-decl name='map1f' mangled-name='_ZN20OpenGLCurveEvaluator5map1fElffllPf' filepath='libnurbs/interface/glcurveval.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <function-decl name='mapgrid1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapgrid1fElff' filepath='libnurbs/interface/glcurveval.cc' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <function-decl name='mapmesh1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapmesh1fElll' filepath='libnurbs/interface/glcurveval.cc' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <function-decl name='evalcoord1f' mangled-name='_ZN20OpenGLCurveEvaluator11evalcoord1fElf' filepath='libnurbs/interface/glcurveval.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <function-decl name='endmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8endmap1fEv' filepath='libnurbs/interface/glcurveval.cc' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <function-decl name='bgnline' mangled-name='_ZN20OpenGLCurveEvaluator7bgnlineEv' filepath='libnurbs/interface/glcurveval.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <function-decl name='endline' mangled-name='_ZN20OpenGLCurveEvaluator7endlineEv' filepath='libnurbs/interface/glcurveval.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='BasicCurveEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/internals/basiccrveval.h' line='43' column='1' is-declaration-only='yes' id='22b18ed5'>
      <base-class access='public' layout-offset-in-bits='0' type-id='98511c0f'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~BasicCurveEvaluator' filepath='libnurbs/internals/basiccrveval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='domain1f' mangled-name='_ZN19BasicCurveEvaluator8domain1fEff' filepath='libnurbs/internals/basiccrveval.cc' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='range1f' mangled-name='_ZN19BasicCurveEvaluator7range1fElPfS0_' filepath='libnurbs/internals/basiccrveval.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN19BasicCurveEvaluator6enableEl' filepath='libnurbs/internals/basiccrveval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN19BasicCurveEvaluator7disableEl' filepath='libnurbs/internals/basiccrveval.cc' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='bgnmap1f' mangled-name='_ZN19BasicCurveEvaluator8bgnmap1fEl' filepath='libnurbs/internals/basiccrveval.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='map1f' mangled-name='_ZN19BasicCurveEvaluator5map1fElffllPf' filepath='libnurbs/internals/basiccrveval.cc' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='mapgrid1f' mangled-name='_ZN19BasicCurveEvaluator9mapgrid1fElff' filepath='libnurbs/internals/basiccrveval.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='mapmesh1f' mangled-name='_ZN19BasicCurveEvaluator9mapmesh1fElll' filepath='libnurbs/internals/basiccrveval.cc' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='evalcoord1f' mangled-name='_ZN19BasicCurveEvaluator11evalcoord1fElf' filepath='libnurbs/internals/basiccrveval.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='endmap1f' mangled-name='_ZN19BasicCurveEvaluator8endmap1fEv' filepath='libnurbs/internals/basiccrveval.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='bgnline' mangled-name='_ZN19BasicCurveEvaluator7bgnlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='endline' mangled-name='_ZN19BasicCurveEvaluator7endlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <function-type size-in-bits='64' id='6485bd28'>
      <parameter type-id='d476845b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f267cc92'>
      <parameter type-id='d476845b'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glinterface.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='GLUnurbs' size-in-bits='1149440' is-struct='yes' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='49' column='1' id='e83497bd'>
      <base-class access='public' layout-offset-in-bits='0' type-id='5c7cffcb'/>
      <data-member access='public' layout-offset-in-bits='47616'>
        <var-decl name='errorCallback' type-id='c68de275' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='71' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47680'>
        <var-decl name='autoloadmode' type-id='e482d915' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47744'>
        <var-decl name='surfaceEvaluator' type-id='98206f26' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1121792'>
        <var-decl name='curveEvaluator' type-id='8d4b0ae2' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1149376'>
        <var-decl name='callbackFlag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='143' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='GLUnurbs' filepath='libnurbs/interface/glrenderer.cc' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='bgnrender' mangled-name='_ZN8GLUnurbs9bgnrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='endrender' mangled-name='_ZN8GLUnurbs9endrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='errorHandler' mangled-name='_ZN8GLUnurbs12errorHandlerEi' filepath='libnurbs/interface/glrenderer.cc' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='e83497bd' size-in-bits='64' id='129fea6d'/>
    <qualified-type-def type-id='129fea6d' const='yes' id='cdfd88c2'/>
    <pointer-type-def type-id='98206f26' size-in-bits='64' id='a8b7100c'/>
    <qualified-type-def type-id='a8b7100c' const='yes' id='39c23eb7'/>
    <pointer-type-def type-id='a6c45d85' size-in-bits='64' id='361f7a7d'/>
    <function-decl name='gluNewNurbsRenderer' mangled-name='gluNewNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNewNurbsRenderer'>
      <return type-id='129fea6d'/>
    </function-decl>
    <function-decl name='gluDeleteNurbsRenderer' mangled-name='gluDeleteNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluDeleteNurbsRenderer'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluBeginSurface' mangled-name='gluBeginSurface' filepath='libnurbs/interface/glinterface.cc' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginSurface'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluBeginCurve' mangled-name='gluBeginCurve' filepath='libnurbs/interface/glinterface.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginCurve'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluEndCurve' mangled-name='gluEndCurve' filepath='libnurbs/interface/glinterface.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndCurve'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluEndSurface' mangled-name='gluEndSurface' filepath='libnurbs/interface/glinterface.cc' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndSurface'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluBeginTrim' mangled-name='gluBeginTrim' filepath='libnurbs/interface/glinterface.cc' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginTrim'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluEndTrim' mangled-name='gluEndTrim' filepath='libnurbs/interface/glinterface.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndTrim'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluPwlCurve' mangled-name='gluPwlCurve' filepath='libnurbs/interface/glinterface.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluPwlCurve'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='82e13008' name='count' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='361f7a7d' name='array' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='82e13008' name='stride' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <parameter type-id='055aa60e' name='type' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsCurve' mangled-name='gluNurbsCurve' filepath='libnurbs/interface/glinterface.cc' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCurve'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='82e13008' name='nknots' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='361f7a7d' name='knot' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='82e13008' name='stride' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='361f7a7d' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <parameter type-id='82e13008' name='order' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <parameter type-id='055aa60e' name='type' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsSurface' mangled-name='gluNurbsSurface' filepath='libnurbs/interface/glinterface.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsSurface'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='82e13008' name='sknot_count' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='5d68ba5a' name='sknot' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='82e13008' name='tknot_count' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <parameter type-id='5d68ba5a' name='tknot' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <parameter type-id='82e13008' name='s_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <parameter type-id='82e13008' name='t_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <parameter type-id='5d68ba5a' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='82e13008' name='sorder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='82e13008' name='torder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='055aa60e' name='type' filepath='libnurbs/interface/glinterface.cc' line='203' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluLoadSamplingMatrices' mangled-name='gluLoadSamplingMatrices' filepath='libnurbs/interface/glinterface.cc' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluLoadSamplingMatrices'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <parameter type-id='d476845b' name='modelMatrix' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <parameter type-id='d476845b' name='projMatrix' filepath='libnurbs/interface/glinterface.cc' line='236' column='1'/>
      <parameter type-id='6b122b76' name='viewport' filepath='libnurbs/interface/glinterface.cc' line='237' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsProperty' mangled-name='gluNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsProperty'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <parameter type-id='055aa60e' name='property' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <parameter type-id='46496ee3' name='value' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluGetNurbsProperty' mangled-name='gluGetNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluGetNurbsProperty'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <parameter type-id='055aa60e' name='property' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <parameter type-id='5d68ba5a' name='value' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsCallback' mangled-name='gluNurbsCallback' filepath='libnurbs/interface/glinterface.cc' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallback'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <parameter type-id='055aa60e' name='which' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <parameter type-id='9fac4a53' name='fn' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsCallbackDataEXT' mangled-name='gluNurbsCallbackDataEXT' filepath='libnurbs/interface/glinterface.cc' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackDataEXT'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <parameter type-id='eaa32e2f' name='userData' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsCallbackData' mangled-name='gluNurbsCallbackData' filepath='libnurbs/interface/glinterface.cc' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackData'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <parameter type-id='eaa32e2f' name='userData' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='OpenGLSurfaceEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='100' column='1' is-declaration-only='yes' id='98206f26'>
      <base-class access='public' layout-offset-in-bits='0' type-id='f37336ad'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='vertexCache' type-id='25b51a5f' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='180' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='tmeshing' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='181' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <var-decl name='which' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='182' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='vcount' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='183' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='gl_polygon_mode' type-id='89ff3d35' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='185' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='global_bpm' type-id='8b4ddf21' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='output_triangles' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='beginCallBackN' type-id='30135957' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='endCallBackN' type-id='953b12f8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='vertexCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='normalCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='colorCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='texcoordCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='beginCallBackData' type-id='5f8a287b' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='200' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1024'>
        <var-decl name='endCallBackData' type-id='b7f9d8e6' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='201' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='vertexCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='normalCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <var-decl name='colorCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='204' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <var-decl name='texcoordCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='205' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <var-decl name='userData' type-id='eaa32e2f' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='LOD_eval_level' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1440'>
        <var-decl name='global_uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='231' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='global_vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1504'>
        <var-decl name='global_uprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='233' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='global_vprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='234' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1568'>
        <var-decl name='global_vprime_BV' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='235' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='global_uprime_BU' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1632'>
        <var-decl name='global_uorder_BV' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='global_vorder_BV' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='238' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1696'>
        <var-decl name='global_uorder_BU' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='239' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <var-decl name='global_vorder_BU' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='240' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1760'>
        <var-decl name='global_ucoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3040'>
        <var-decl name='global_vcoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='243' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4320'>
        <var-decl name='global_ucoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='244' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5600'>
        <var-decl name='global_vcoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6880'>
        <var-decl name='global_BV' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='247' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='12000'>
        <var-decl name='global_PBV' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='248' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='17120'>
        <var-decl name='global_BU' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='249' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='22240'>
        <var-decl name='global_PBU' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='250' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <var-decl name='global_baseData' type-id='c0eda015' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <var-decl name='global_ev_k' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='253' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27488'>
        <var-decl name='global_ev_u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='254' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <var-decl name='global_ev_u2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='255' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27552'>
        <var-decl name='global_ev_ustride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='256' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27584'>
        <var-decl name='global_ev_uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='257' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27616'>
        <var-decl name='global_ev_v1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='258' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27648'>
        <var-decl name='global_ev_v2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='259' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27680'>
        <var-decl name='global_ev_vstride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='260' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27712'>
        <var-decl name='global_ev_vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='261' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27744'>
        <var-decl name='global_ev_ctlPoints' type-id='65bb74af' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='262' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232544'>
        <var-decl name='global_grid_u0' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='264' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232576'>
        <var-decl name='global_grid_u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='265' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232608'>
        <var-decl name='global_grid_nu' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='266' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232640'>
        <var-decl name='global_grid_v0' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='267' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232672'>
        <var-decl name='global_grid_v1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='268' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232704'>
        <var-decl name='global_grid_nv' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='269' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232736'>
        <var-decl name='em_vertex' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='349' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='443008'>
        <var-decl name='em_normal' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='350' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='653280'>
        <var-decl name='em_color' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='351' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='863552'>
        <var-decl name='em_texcoord' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073824'>
        <var-decl name='auto_normal_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='354' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073856'>
        <var-decl name='callback_auto_normal' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='356' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073888'>
        <var-decl name='vertex_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073920'>
        <var-decl name='normal_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073952'>
        <var-decl name='color_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073984'>
        <var-decl name='texcoord_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='360' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='range2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/interface/glsurfeval.cc' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='domain2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8domain2fEffff' filepath='libnurbs/interface/glsurfeval.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN22OpenGLSurfaceEvaluator6enableEl' filepath='libnurbs/interface/glsurfeval.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN22OpenGLSurfaceEvaluator7disableEl' filepath='libnurbs/interface/glsurfeval.cc' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='bgnmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/interface/glsurfeval.cc' line='739' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='map2f' mangled-name='_ZN22OpenGLSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/interface/glsurfeval.cc' line='872' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='mapgrid2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/interface/glsurfeval.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='mapmesh2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/interface/glsurfeval.cc' line='946' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='evalcoord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/interface/glsurfeval.cc' line='1042' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='evalpoint2i' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/interface/glsurfeval.cc' line='1059' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='endmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8endmap2fEv' filepath='libnurbs/interface/glsurfeval.cc' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='polymode' mangled-name='_ZN22OpenGLSurfaceEvaluator8polymodeEl' filepath='libnurbs/interface/glsurfeval.cc' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='bgnline' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgnlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='endline' mangled-name='_ZN22OpenGLSurfaceEvaluator7endlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='bgnclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='endclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='bgntmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='swaptmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='endtmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8endtmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='bgnqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='712' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='endqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9endqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='725' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='bgntfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgntfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='endtfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7endtfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='evalUStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='evalVStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='530' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN22OpenGLSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='321' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glrenderer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='46496ee3' size-in-bits='128' id='d68dc862'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <typedef-decl name='errorCallbackType' type-id='30135957' filepath='libnurbs/interface/glrenderer.h' line='46' column='1' id='c68de275'/>
    <pointer-type-def type-id='d68dc862' size-in-bits='64' id='09324958'/>
    <class-decl name='NurbsTessellator' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='53' column='1' is-declaration-only='yes' id='5c7cffcb'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='renderhints' type-id='14066291' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='104' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='maplist' type-id='90b97905' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='105' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3008'>
        <var-decl name='backend' type-id='8abb1ec7' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3648'>
        <var-decl name='subdivider' type-id='62291dde' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24064'>
        <var-decl name='jumpbuffer' type-id='0e86d3eb' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24128'>
        <var-decl name='o_pwlcurvePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <var-decl name='o_nurbscurvePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='29120'>
        <var-decl name='o_curvePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='31616'>
        <var-decl name='o_trimPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='34112'>
        <var-decl name='o_surfacePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='36608'>
        <var-decl name='o_nurbssurfacePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='39104'>
        <var-decl name='propertyPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='41600'>
        <var-decl name='quiltPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='44096'>
        <var-decl name='extTrimVertexPool' type-id='95c1e8c1' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46720'>
        <var-decl name='inSurface' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='148' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46752'>
        <var-decl name='inCurve' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='149' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46784'>
        <var-decl name='inTrim' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46816'>
        <var-decl name='isCurveModified' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='151' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46848'>
        <var-decl name='isTrimModified' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='152' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46880'>
        <var-decl name='isSurfaceModified' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46912'>
        <var-decl name='isDataValid' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46944'>
        <var-decl name='numTrims' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='155' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46976'>
        <var-decl name='playBack' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='156' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47040'>
        <var-decl name='nextTrim' type-id='9b0953ab' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='158' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47104'>
        <var-decl name='nextCurve' type-id='051d3536' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47168'>
        <var-decl name='nextNurbscurve' type-id='8cd6e64e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47232'>
        <var-decl name='nextPwlcurve' type-id='5877a025' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='161' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47296'>
        <var-decl name='nextNurbssurface' type-id='6597deda' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47360'>
        <var-decl name='currentSurface' type-id='1d8fd45c' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='164' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47424'>
        <var-decl name='currentTrim' type-id='bc1314a3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='165' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47488'>
        <var-decl name='currentCurve' type-id='75b98f98' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='166' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47552'>
        <var-decl name='dl' type-id='7f27e761' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='168' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='15a0d7b1'/>
          <parameter type-id='e2ef5a99'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='bgnrender' mangled-name='_ZN16NurbsTessellator9bgnrenderEv' filepath='libnurbs/internals/nurbstess.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='endrender' mangled-name='_ZN16NurbsTessellator9endrenderEv' filepath='libnurbs/internals/nurbstess.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='makeobj' mangled-name='_ZN16NurbsTessellator7makeobjEi' filepath='libnurbs/internals/nurbstess.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='closeobj' mangled-name='_ZN16NurbsTessellator8closeobjEv' filepath='libnurbs/internals/nurbstess.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <function-decl name='errorHandler' mangled-name='_ZN16NurbsTessellator12errorHandlerEi' filepath='libnurbs/internals/nurbstess.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glsurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='82e13008' size-in-bits='64' id='89ff3d35'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='64' id='5df3d5e7'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='96' id='61f61aca'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='234bc418' size-in-bits='5120' id='f343e529'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='204800' id='65bb74af'>
      <subrange length='6400' type-id='7359adad' id='9685bc87'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='861154a2' size-in-bits='192' id='25b51a5f'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='128' id='6136feaa'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <class-decl name='bezierPatch' size-in-bits='384' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='36' column='1' id='d9a4bc34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='umin' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vmin' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='umax' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vmax' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dimension' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctlpoints' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bezierPatch' type-id='d9a4bc34' filepath='libnurbs/interface/bezierPatch.h' line='65' column='1' id='56988107'/>
    <class-decl name='bezierPatchMesh' size-in-bits='960' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='39' column='1' id='2b73b139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bpatch' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bpatch_normal' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bpatch_texcoord' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bpatch_color' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='UVarray' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='length_array' type-id='7292109c' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type_array' type-id='157c88ff' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='size_UVarray' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='index_UVarray' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size_length_array' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='index_length_array' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='counter' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='type' type-id='055aa60e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='vertex_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='normal_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='color_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='texcoord_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='next' type-id='8b4ddf21' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bezierPatchMesh' type-id='2b73b139' filepath='libnurbs/interface/bezierPatchMesh.h' line='66' column='1' id='bc89f3ba'/>
    <class-decl name='surfEvalMachine' size-in-bits='210272' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='63' column='1' id='30d622a0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='u2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ustride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='v1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='vstride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ctlPoints' type-id='65bb74af' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='205152'>
        <var-decl name='ucoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='206432'>
        <var-decl name='vcoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='207712'>
        <var-decl name='ucoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208992'>
        <var-decl name='vcoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='surfEvalMachine' type-id='30d622a0' filepath='libnurbs/interface/glsurfeval.h' line='80' column='1' id='a83411a7'/>
    <class-decl name='StoredVertex' size-in-bits='256' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='84' column='1' id='5c601ee4'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='coord' type-id='5df3d5e7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='96' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='point' type-id='6136feaa' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='97' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='861154a2' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='861154a2' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='f37336ad' size-in-bits='64' id='eeef6d7d'/>
    <pointer-type-def type-id='055aa60e' size-in-bits='64' id='157c88ff'/>
    <pointer-type-def type-id='61f61aca' size-in-bits='64' id='166c4ea0'/>
    <pointer-type-def type-id='5c601ee4' size-in-bits='64' id='861154a2'/>
    <qualified-type-def type-id='861154a2' const='yes' id='555b5dad'/>
    <pointer-type-def type-id='c260421a' size-in-bits='64' id='643ec8f8'/>
    <pointer-type-def type-id='d9a4bc34' size-in-bits='64' id='4dcc1bd2'/>
    <pointer-type-def type-id='2b73b139' size-in-bits='64' id='8b4ddf21'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='a83411a7' size-in-bits='64' id='6a947bf6'/>
    <class-decl name='SurfaceMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='c260421a'/>
    <class-decl name='BasicSurfaceEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/internals/basicsurfeval.h' line='43' column='1' is-declaration-only='yes' id='f37336ad'>
      <base-class access='public' layout-offset-in-bits='0' type-id='98511c0f'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~BasicSurfaceEvaluator' filepath='libnurbs/internals/basicsurfeval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='range2f' mangled-name='_ZN21BasicSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/internals/basicsurfeval.cc' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='domain2f' mangled-name='_ZN21BasicSurfaceEvaluator8domain2fEffff' filepath='libnurbs/internals/basicsurfeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN21BasicSurfaceEvaluator6enableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN21BasicSurfaceEvaluator7disableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='bgnmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/internals/basicsurfeval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='map2f' mangled-name='_ZN21BasicSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/internals/basicsurfeval.cc' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='mapgrid2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/internals/basicsurfeval.cc' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='mapmesh2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/internals/basicsurfeval.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='evalcoord2f' mangled-name='_ZN21BasicSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/internals/basicsurfeval.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='evalpoint2i' mangled-name='_ZN21BasicSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/internals/basicsurfeval.cc' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='endmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8endmap2fEv' filepath='libnurbs/internals/basicsurfeval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='polymode' mangled-name='_ZN21BasicSurfaceEvaluator8polymodeEl' filepath='libnurbs/internals/basicsurfeval.cc' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='bgnline' mangled-name='_ZN21BasicSurfaceEvaluator7bgnlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='endline' mangled-name='_ZN21BasicSurfaceEvaluator7endlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='bgnclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='endclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='bgntmesh' mangled-name='_ZN21BasicSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='swaptmesh' mangled-name='_ZN21BasicSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='endtmesh' mangled-name='_ZN21BasicSurfaceEvaluator8endtmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='bgnqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='endqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9endqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='bgntfan' mangled-name='_ZN21BasicSurfaceEvaluator7bgntfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='endtfan' mangled-name='_ZN21BasicSurfaceEvaluator7endtfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='evalUStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='evalVStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='34'>
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN21BasicSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='35'>
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='36'>
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='37'>
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='38'>
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/insurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='2048' id='2e646d82'>
      <subrange length='32' type-id='7359adad' id='ae5bde82'/>
    </array-type-def>
    <typedef-decl name='size_t' type-id='7359adad' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='b59d7dce'/>
    <typedef-decl name='Arc_ptr' type-id='70a74e83' filepath='libnurbs/internals/arc.h' line='50' column='1' id='c118b035'/>
    <enum-decl name='arc_side' filepath='libnurbs/internals/arc.h' line='52' column='1' id='45273cc6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='arc_none' value='0'/>
      <enumerator name='arc_right' value='1'/>
      <enumerator name='arc_top' value='2'/>
      <enumerator name='arc_left' value='3'/>
      <enumerator name='arc_bottom' value='4'/>
    </enum-decl>
    <class-decl name='Arc' size-in-bits='448' is-struct='yes' visibility='default' filepath='libnurbs/internals/arc.h' line='55' column='1' id='e4a01a13'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' static='yes'>
        <var-decl name='bezier_tag' type-id='2448a865' mangled-name='_ZN3Arc10bezier_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='arc_tag' type-id='2448a865' mangled-name='_ZN3Arc7arc_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='tail_tag' type-id='2448a865' mangled-name='_ZN3Arc8tail_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='c118b035' visibility='default' filepath='libnurbs/internals/arc.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='c118b035' visibility='default' filepath='libnurbs/internals/arc.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='link' type-id='c118b035' visibility='default' filepath='libnurbs/internals/arc.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bezierArc' type-id='26518268' visibility='default' filepath='libnurbs/internals/arc.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pwlArc' type-id='561d7e7a' visibility='default' filepath='libnurbs/internals/arc.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/arc.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nuid' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/arc.h' line='67' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <parameter type-id='70a74e83'/>
          <parameter type-id='561d7e7a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <parameter type-id='45273cc6'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Buffer' size-in-bits='64' visibility='default' filepath='libnurbs/internals/bufpool.h' line='45' column='1' id='036c0a83'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='2c9a42a3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Pool' size-in-bits='2496' visibility='default' filepath='libnurbs/internals/bufpool.h' line='50' column='1' id='1329513b'>
      <member-type access='protected'>
        <enum-decl name='Magic' filepath='libnurbs/internals/bufpool.h' line='70' column='1' id='ca454859'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='is_allocated' value='62369'/>
          <enumerator name='is_free' value='61858'/>
        </enum-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='freelist' type-id='2c9a42a3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='62' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='blocklist' type-id='2e646d82' visibility='default' filepath='libnurbs/internals/bufpool.h' line='63' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2112'>
        <var-decl name='nextblock' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='64' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2176'>
        <var-decl name='curblock' type-id='26a90f95' visibility='default' filepath='libnurbs/internals/bufpool.h' line='65' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2240'>
        <var-decl name='buffersize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='66' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2272'>
        <var-decl name='nextsize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='67' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2304'>
        <var-decl name='nextfree' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='68' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2336'>
        <var-decl name='initsize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='69' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2368'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='libnurbs/internals/bufpool.h' line='71' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2432'>
        <var-decl name='magic' type-id='ca454859' visibility='default' filepath='libnurbs/internals/bufpool.h' line='72' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PooledObj' size-in-bits='8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='118' column='1' id='1feb48e7'/>
    <class-decl name='PwlArc' size-in-bits='192' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='44' column='1' id='c60dfbac'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='48' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='561d7e7a' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='561d7e7a' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='86e0e963'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='561d7e7a' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='86e0e963'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TrimVertex' size-in-bits='128' is-struct='yes' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='43' column='1' id='a514a513'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='param' type-id='5df3d5e7' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nuid' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='e4a01a13' size-in-bits='64' id='70a74e83'/>
    <qualified-type-def type-id='70a74e83' const='yes' id='de7f6898'/>
    <pointer-type-def type-id='c118b035' size-in-bits='64' id='7d392e34'/>
    <pointer-type-def type-id='26d417ca' size-in-bits='64' id='26518268'/>
    <pointer-type-def type-id='036c0a83' size-in-bits='64' id='2c9a42a3'/>
    <reference-type-def kind='lvalue' type-id='1329513b' size-in-bits='64' id='16a1015f'/>
    <pointer-type-def type-id='1329513b' size-in-bits='64' id='1aa107ab'/>
    <pointer-type-def type-id='1feb48e7' size-in-bits='64' id='298506af'/>
    <pointer-type-def type-id='c60dfbac' size-in-bits='64' id='561d7e7a'/>
    <pointer-type-def type-id='a514a513' size-in-bits='64' id='86e0e963'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <class-decl name='BezierArc' is-struct='yes' visibility='default' is-declaration-only='yes' id='26d417ca'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arcsorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='128' id='a201b87d'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='3' type-id='234bc418' size-in-bits='infinite' id='1e6e1d59'>
      <subrange length='infinite' id='031f2035'/>
      <subrange length='24' type-id='7359adad' id='fdd3342b'/>
      <subrange length='24' type-id='7359adad' id='fdd3342b'/>
    </array-type-def>
    <class-decl name='ArcTessellator' size-in-bits='128' visibility='default' filepath='libnurbs/internals/arctess.h' line='47' column='1' id='96a897b1'>
      <data-member access='private' static='yes'>
        <var-decl name='gl_Bernstein' type-id='1e6e1d59' mangled-name='_ZN14ArcTessellator12gl_BernsteinE' visibility='default' filepath='libnurbs/internals/arctess.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pwlarcpool' type-id='16a10160' visibility='default' filepath='libnurbs/internals/arctess.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='trimvertexpool' type-id='7ba6b98d' visibility='default' filepath='libnurbs/internals/arctess.h' line='62' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTessellator' filepath='libnurbs/internals/arctess.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='7ba6b98e'/>
          <parameter type-id='16a1015f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ArcTessellator' filepath='libnurbs/internals/arctess.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Bin' size-in-bits='128' visibility='default' filepath='libnurbs/internals/bin.h' line='44' column='1' id='55730736'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='c118b035' visibility='default' filepath='libnurbs/internals/bin.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='current' type-id='c118b035' visibility='default' filepath='libnurbs/internals/bin.h' line='47' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Curvelist' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/curvelist.h' line='47' column='1' id='5d0beef4'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='curve' type-id='e5fec7ba' visibility='default' filepath='libnurbs/internals/curvelist.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='range' type-id='c723f882' visibility='default' filepath='libnurbs/internals/curvelist.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='needsSubdivision' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curvelist.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='stepsize' type-id='a6c45d85' visibility='default' filepath='libnurbs/internals/curvelist.h' line='60' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <parameter type-id='ad0c8abc'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <parameter type-id='d5ebc58e'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Curvelist' filepath='libnurbs/internals/curvelist.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Flist' size-in-bits='320' visibility='default' filepath='libnurbs/internals/flist.h' line='42' column='1' id='79b62e7d'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/flist.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/flist.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='start' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/flist.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='end' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/flist.h' line='47' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='sorter' type-id='3b7cb332' visibility='default' filepath='libnurbs/internals/flist.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='FlistSorter' size-in-bits='128' visibility='default' filepath='libnurbs/internals/flistsorter.h' line='42' column='1' id='3b7cb332'>
      <base-class access='public' layout-offset-in-bits='0' type-id='930e1102'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='FlistSorter' filepath='libnurbs/internals/flistsorter.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~FlistSorter' filepath='libnurbs/internals/flistsorter.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN11FlistSorter5qscmpEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN11FlistSorter5qsexcEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN11FlistSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/flistsorter.cc' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='JumpBuffer' size-in-bits='1600' is-struct='yes' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='56' column='1' id='46658fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='a3997015' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Patchlist' size-in-bits='640' is-struct='yes' visibility='default' filepath='libnurbs/internals/patchlist.h' line='45' column='1' id='48a81e9d'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='patch' type-id='049c92d9' visibility='default' filepath='libnurbs/internals/patchlist.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='notInBbox' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patchlist.h' line='64' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='needsSampling' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patchlist.h' line='65' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='pspec' type-id='e0a39484' visibility='default' filepath='libnurbs/internals/patchlist.h' line='66' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Patchlist' filepath='libnurbs/internals/patchlist.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <parameter type-id='ad0c8abc'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Patchlist' filepath='libnurbs/internals/patchlist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <parameter type-id='6a2f2849'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Patchlist' filepath='libnurbs/internals/patchlist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Quilt' size-in-bits='896' is-struct='yes' visibility='default' filepath='libnurbs/internals/quilt.h' line='64' column='1' id='fb679596'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mapdesc' type-id='4674ed22' visibility='default' filepath='libnurbs/internals/quilt.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cpts' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/quilt.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qspec' type-id='cebeb113' visibility='default' filepath='libnurbs/internals/quilt.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='eqspec' type-id='cbe067ff' visibility='default' filepath='libnurbs/internals/quilt.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='next' type-id='ad0c8abc' visibility='default' filepath='libnurbs/internals/quilt.h' line='71' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Quilt' filepath='libnurbs/internals/quilt.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='4674ed22'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Renderhints' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/renderhints.h' line='41' column='1' id='14066291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='display_method' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='errorchecking' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subdivisions' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tmp1' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='displaydomain' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='maxsubdivisions' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wiretris' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='wirequads' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='57' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Renderhints' filepath='libnurbs/internals/renderhints.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c204f909' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Subdivider' size-in-bits='20416' visibility='default' filepath='libnurbs/internals/subdivider.h' line='55' column='1' id='62291dde'>
      <member-type access='private'>
        <enum-decl name='dir' filepath='libnurbs/internals/subdivider.h' line='105' column='1' id='97aebf86'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='down' value='0'/>
          <enumerator name='same' value='1'/>
          <enumerator name='up' value='2'/>
          <enumerator name='none' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='slicer' type-id='588a6d01' visibility='default' filepath='libnurbs/internals/subdivider.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8064'>
        <var-decl name='arctessellator' type-id='96a897b1' visibility='default' filepath='libnurbs/internals/subdivider.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8192'>
        <var-decl name='arcpool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='114' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='10688'>
        <var-decl name='bezierarcpool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13184'>
        <var-decl name='pwlarcpool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='15680'>
        <var-decl name='trimvertexpool' type-id='95c1e8c1' visibility='default' filepath='libnurbs/internals/subdivider.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18304'>
        <var-decl name='jumpbuffer' type-id='0e86d3eb' visibility='default' filepath='libnurbs/internals/subdivider.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18368'>
        <var-decl name='renderhints' type-id='ce050bed' visibility='default' filepath='libnurbs/internals/subdivider.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18432'>
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18496'>
        <var-decl name='initialbin' type-id='55730736' visibility='default' filepath='libnurbs/internals/subdivider.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18624'>
        <var-decl name='pjarc' type-id='c118b035' visibility='default' filepath='libnurbs/internals/subdivider.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18688'>
        <var-decl name='s_index' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18720'>
        <var-decl name='t_index' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18752'>
        <var-decl name='qlist' type-id='ad0c8abc' visibility='default' filepath='libnurbs/internals/subdivider.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18816'>
        <var-decl name='spbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19136'>
        <var-decl name='tpbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19456'>
        <var-decl name='smbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19776'>
        <var-decl name='tmbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20096'>
        <var-decl name='stepsizes' type-id='a201b87d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20224'>
        <var-decl name='showDegenerate' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20256'>
        <var-decl name='isArcTypeBezier' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20288'>
        <var-decl name='domain_distance_u_rate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/subdivider.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20320'>
        <var-decl name='domain_distance_v_rate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/subdivider.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20352'>
        <var-decl name='is_domain_distance_sampling' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='190' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='ce050bee'/>
          <parameter type-id='6edb776c'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TrimVertexPool' size-in-bits='2624' is-struct='yes' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='45' column='1' id='95c1e8c1'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <var-decl name='vlist' type-id='9d0f3deb' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <var-decl name='nextvlistslot' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2592'>
        <var-decl name='vlistsize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='55' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6fa6a6a9' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~TrimVertexPool' filepath='libnurbs/internals/trimvertpool.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6fa6a6a9' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='70a74e83' size-in-bits='64' id='0060d40b'/>
    <pointer-type-def type-id='4263e7b4' size-in-bits='64' id='33212902'/>
    <pointer-type-def type-id='78634648' size-in-bits='64' id='92b77e5e'/>
    <qualified-type-def type-id='92b77e5e' const='yes' id='2eb3fb51'/>
    <pointer-type-def type-id='fc3a0aa7' size-in-bits='64' id='80f20a7f'/>
    <pointer-type-def type-id='96a897b1' size-in-bits='64' id='4a9e4f29'/>
    <qualified-type-def type-id='6edb776c' id='6edb776b'/>
    <reference-type-def kind='lvalue' type-id='8abb1ec7' size-in-bits='64' id='6edb776c'/>
    <reference-type-def kind='lvalue' type-id='55730736' size-in-bits='64' id='6eadc0e8'/>
    <pointer-type-def type-id='55730736' size-in-bits='64' id='6aadba9c'/>
    <reference-type-def kind='lvalue' type-id='5d0beef4' size-in-bits='64' id='d5ebc58e'/>
    <pointer-type-def type-id='79b62e7d' size-in-bits='64' id='6b4fa57d'/>
    <pointer-type-def type-id='46658fab' size-in-bits='64' id='0e86d3eb'/>
    <reference-type-def kind='lvalue' type-id='48a81e9d' size-in-bits='64' id='6a2f2849'/>
    <qualified-type-def type-id='16a1015f' id='16a10160'/>
    <pointer-type-def type-id='fb679596' size-in-bits='64' id='ad0c8abc'/>
    <qualified-type-def type-id='ce050bee' id='ce050bed'/>
    <reference-type-def kind='lvalue' type-id='14066291' size-in-bits='64' id='ce050bee'/>
    <pointer-type-def type-id='930e1102' size-in-bits='64' id='9e581de0'/>
    <qualified-type-def type-id='33c85970' id='33c85971'/>
    <reference-type-def kind='lvalue' type-id='62291dde' size-in-bits='64' id='33c85970'/>
    <pointer-type-def type-id='62291dde' size-in-bits='64' id='3fc86c54'/>
    <pointer-type-def type-id='86e0e963' size-in-bits='64' id='9d0f3deb'/>
    <qualified-type-def type-id='7ba6b98e' id='7ba6b98d'/>
    <reference-type-def kind='lvalue' type-id='95c1e8c1' size-in-bits='64' id='7ba6b98e'/>
    <pointer-type-def type-id='95c1e8c1' size-in-bits='64' id='6fa6a6a9'/>
    <qualified-type-def type-id='234bc418' const='yes' id='08485948'/>
    <pointer-type-def type-id='08485948' size-in-bits='64' id='6be4b546'/>
    <class-decl name='ArcSorter' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='44' column='1' is-declaration-only='yes' id='78634648'>
      <base-class access='private' layout-offset-in-bits='0' type-id='930e1102'/>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='subdivider' type-id='33c85971' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='50' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcSorter' filepath='libnurbs/internals/arcsorter.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92b77e5e' is-artificial='yes'/>
          <parameter type-id='33c85970'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN9ArcSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92b77e5e' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN9ArcSorter5qsexcEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92b77e5e' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN9ArcSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/arcsorter.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92b77e5e' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ArcSdirSorter' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='57' column='1' is-declaration-only='yes' id='4263e7b4'>
      <base-class access='public' layout-offset-in-bits='0' type-id='78634648'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcSdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='33212902' is-artificial='yes'/>
          <parameter type-id='33c85970'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN13ArcSdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='33212902' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ArcTdirSorter' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='65' column='1' is-declaration-only='yes' id='fc3a0aa7'>
      <base-class access='public' layout-offset-in-bits='0' type-id='78634648'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTdirSorter' filepath='libnurbs/internals/arcsorter.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='80f20a7f' is-artificial='yes'/>
          <parameter type-id='33c85970'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN13ArcTdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='80f20a7f' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Backend' is-struct='yes' visibility='default' filepath='libnurbs/internals/backend.h' line='46' column='1' is-declaration-only='yes' id='8abb1ec7'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='curveEvaluator' type-id='15a0d7b2' visibility='default' filepath='libnurbs/internals/backend.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='surfaceEvaluator' type-id='e2ef5a9a' visibility='default' filepath='libnurbs/internals/backend.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='wireframetris' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='wireframequads' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='mesh' type-id='2f738f98' visibility='default' filepath='libnurbs/internals/backend.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <var-decl name='meshindex' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='109' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Backend' filepath='libnurbs/internals/backend.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='15a0d7b1'/>
          <parameter type-id='e2ef5a99'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Slicer' visibility='default' filepath='libnurbs/internals/slicer.h' line='49' column='1' is-declaration-only='yes' id='588a6d01'>
      <base-class access='public' layout-offset-in-bits='0' type-id='732b9357'/>
      <base-class access='public' layout-offset-in-bits='128' type-id='43336373'/>
      <data-member access='private' layout-offset-in-bits='5248'>
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/slicer.h' line='72' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5312'>
        <var-decl name='oneOverDu' type-id='234bc418' visibility='default' filepath='libnurbs/internals/slicer.h' line='73' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5344'>
        <var-decl name='du' type-id='234bc418' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5376'>
        <var-decl name='dv' type-id='234bc418' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5408'>
        <var-decl name='isolines' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/slicer.h' line='75' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5440'>
        <var-decl name='ulinear' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/slicer.h' line='81' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5472'>
        <var-decl name='vlinear' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/slicer.h' line='82' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Slicer' filepath='libnurbs/internals/slicer.cc' line='1181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='054b4ce9' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <parameter type-id='63e171df' is-artificial='yes'/>
          <parameter type-id='6edb776c'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Slicer' filepath='libnurbs/internals/slicer.cc' line='1192' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='054b4ce9' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <parameter type-id='63e171df' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Sorter' visibility='default' filepath='libnurbs/internals/sorter.h' line='36' column='1' is-declaration-only='yes' id='930e1102'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='es' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/sorter.h' line='49' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Sorter' filepath='libnurbs/internals/sorter.cc' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~Sorter' filepath='libnurbs/internals/sorter.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN6Sorter5qscmpEPcS0_' filepath='libnurbs/internals/sorter.cc' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN6Sorter5qsexcEPcS0_' filepath='libnurbs/internals/sorter.cc' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN6Sorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/sorter.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9e581de0' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arctess.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='4a9e4f29' const='yes' id='b9dde446'/>
    <qualified-type-def type-id='1aa107ab' const='yes' id='99639ce0'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/backend.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='2' type-id='234bc418' size-in-bits='384' id='2f738f98'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <class-decl name='GridTrimVertex' size-in-bits='384' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='45' column='1' id='4f08619f'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='dummyt' type-id='a514a513' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='dummyg' type-id='3f2e4b5b' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='t' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='g' type-id='d96ed0fb' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='52' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='GridTrimVertex' filepath='libnurbs/internals/gridtrimvertex.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6ae24567' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='GridVertex' size-in-bits='128' is-struct='yes' visibility='default' filepath='libnurbs/internals/gridvertex.h' line='39' column='1' id='3f2e4b5b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gparam' type-id='6136feaa' visibility='default' filepath='libnurbs/internals/gridvertex.h' line='40' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='GridVertex' filepath='libnurbs/internals/gridvertex.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d96ed0fb' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='GridVertex' filepath='libnurbs/internals/gridvertex.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d96ed0fb' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='8abb1ec7' size-in-bits='64' id='6adb711f'/>
    <qualified-type-def type-id='6adb711f' const='yes' id='3c1186ac'/>
    <qualified-type-def type-id='15a0d7b1' id='15a0d7b2'/>
    <reference-type-def kind='lvalue' type-id='22b18ed5' size-in-bits='64' id='15a0d7b1'/>
    <qualified-type-def type-id='e2ef5a99' id='e2ef5a9a'/>
    <reference-type-def kind='lvalue' type-id='f37336ad' size-in-bits='64' id='e2ef5a99'/>
    <pointer-type-def type-id='4f08619f' size-in-bits='64' id='6ae24567'/>
    <qualified-type-def type-id='6ae24567' const='yes' id='7fbee4d4'/>
    <pointer-type-def type-id='3f2e4b5b' size-in-bits='64' id='d96ed0fb'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/bin.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='6aadba9c' const='yes' id='d04a6187'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/cachingeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/ccw.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='3fc86c54' const='yes' id='2d80381f'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/coveandtiler.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='CoveAndTiler' size-in-bits='2688' visibility='default' filepath='libnurbs/internals/coveandtiler.h' line='46' column='1' id='732b9357'>
      <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='48e5d3e9'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/coveandtiler.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='MAXSTRIPSIZE' type-id='2448a865' mangled-name='_ZN12CoveAndTiler12MAXSTRIPSIZEE' visibility='default' filepath='libnurbs/internals/coveandtiler.cc' line='50' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='CoveAndTiler' filepath='libnurbs/internals/coveandtiler.cc' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='de06809f' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <parameter type-id='63e171df' is-artificial='yes'/>
          <parameter type-id='6edb776c'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~CoveAndTiler' filepath='libnurbs/internals/coveandtiler.cc' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='de06809f' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <parameter type-id='63e171df' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Gridline' size-in-bits='320' is-struct='yes' visibility='default' filepath='libnurbs/internals/gridline.h' line='39' column='1' id='77f16233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/gridline.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vval' type-id='234bc418' visibility='default' filepath='libnurbs/internals/gridline.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vindex' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/gridline.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ustart' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/gridline.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uend' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/gridline.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Jarcloc' size-in-bits='192' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='41' column='1' id='e19a2b97'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='arc' type-id='c118b035' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='43' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='p' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='plast' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Trimline' size-in-bits='832' visibility='default' filepath='libnurbs/internals/trimline.h' line='46' column='1' id='0aec50eb'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='9d0f3deb' visibility='default' filepath='libnurbs/internals/trimline.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='numverts' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/trimline.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='i' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/trimline.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/trimline.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='jarcl' type-id='e19a2b97' visibility='default' filepath='libnurbs/internals/trimline.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='t' type-id='a514a513' visibility='default' filepath='libnurbs/internals/trimline.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='b' type-id='a514a513' visibility='default' filepath='libnurbs/internals/trimline.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='tinterp' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/trimline.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='binterp' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/trimline.h' line='54' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Trimline' filepath='libnurbs/internals/trimline.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='46568fdb' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Trimline' filepath='libnurbs/internals/trimline.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='46568fdb' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TrimRegion' size-in-bits='2560' visibility='default' filepath='libnurbs/internals/trimregion.h' line='46' column='1' id='48e5d3e9'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='0aec50eb' visibility='default' filepath='libnurbs/internals/trimregion.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='right' type-id='0aec50eb' visibility='default' filepath='libnurbs/internals/trimregion.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='top' type-id='77f16233' visibility='default' filepath='libnurbs/internals/trimregion.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1984'>
        <var-decl name='bot' type-id='77f16233' visibility='default' filepath='libnurbs/internals/trimregion.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <var-decl name='uarray' type-id='9147a9c5' visibility='default' filepath='libnurbs/internals/trimregion.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <var-decl name='oneOverDu' type-id='234bc418' visibility='default' filepath='libnurbs/internals/trimregion.h' line='65' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='TrimRegion' filepath='libnurbs/internals/trimregion.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c79084e1' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Uarray' size-in-bits='192' visibility='default' filepath='libnurbs/internals/uarray.h' line='44' column='1' id='9147a9c5'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/uarray.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='ulines' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/uarray.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='uarray' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/uarray.h' line='52' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Uarray' filepath='libnurbs/internals/uarray.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5ab658c5' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Uarray' filepath='libnurbs/internals/uarray.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5ab658c5' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='732b9357' size-in-bits='64' id='de06809f'/>
    <qualified-type-def type-id='de06809f' const='yes' id='f2681a2c'/>
    <qualified-type-def type-id='5ee23283' id='5ee23284'/>
    <reference-type-def kind='lvalue' type-id='4f08619f' size-in-bits='64' id='5ee23283'/>
    <qualified-type-def type-id='d56ecaaf' id='d56ecab0'/>
    <reference-type-def kind='lvalue' type-id='3f2e4b5b' size-in-bits='64' id='d56ecaaf'/>
    <qualified-type-def type-id='d96ed0fb' const='yes' id='8bc00470'/>
    <pointer-type-def type-id='e19a2b97' size-in-bits='64' id='8dd47cdf'/>
    <pointer-type-def type-id='48e5d3e9' size-in-bits='64' id='c79084e1'/>
    <pointer-type-def type-id='0aec50eb' size-in-bits='64' id='46568fdb'/>
    <qualified-type-def type-id='46568fdb' const='yes' id='0b1f4050'/>
    <pointer-type-def type-id='9147a9c5' size-in-bits='64' id='5ab658c5'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curve.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='2412cf51' size-in-bits='640' id='cebeb113'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='3840' id='172a38aa'>
      <subrange length='120' type-id='7359adad' id='1ec4f032'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='160' id='5e051f08'>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='234bc418' size-in-bits='800' id='a5d9526b'>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a6c45d85' size-in-bits='128' id='87305fb5'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='64' id='e4266c7e'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <class-decl name='Curve' size-in-bits='8128' visibility='default' filepath='libnurbs/internals/curve.h' line='46' column='1' id='218b0c8c'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='e5fec7ba' visibility='default' filepath='libnurbs/internals/curve.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mapdesc' type-id='4674ed22' visibility='default' filepath='libnurbs/internals/curve.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='stride' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curve.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='order' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curve.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='cullval' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curve.h' line='56' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='needsSampling' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curve.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='cpts' type-id='172a38aa' visibility='default' filepath='libnurbs/internals/curve.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4096'>
        <var-decl name='spts' type-id='172a38aa' visibility='default' filepath='libnurbs/internals/curve.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7936'>
        <var-decl name='stepsize' type-id='234bc418' visibility='default' filepath='libnurbs/internals/curve.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7968'>
        <var-decl name='minstepsize' type-id='234bc418' visibility='default' filepath='libnurbs/internals/curve.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8000'>
        <var-decl name='range' type-id='61f61aca' visibility='default' filepath='libnurbs/internals/curve.h' line='62' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Curve' filepath='libnurbs/internals/curve.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e5fec7ba' is-artificial='yes'/>
          <parameter type-id='ad0c8abc'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='e5fec7ba'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Curve' filepath='libnurbs/internals/curve.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e5fec7ba' is-artificial='yes'/>
          <parameter type-id='d9feb4d6'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='e5fec7ba'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Knotvector' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/knotvector.h' line='41' column='1' id='6954a4ec'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='order' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/knotvector.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='knotcount' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/knotvector.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stride' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/knotvector.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='knotlist' type-id='25406ea7' visibility='default' filepath='libnurbs/internals/knotvector.h' line='51' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Knotvector' filepath='libnurbs/internals/knotvector.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e61af16a' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Knotvector' filepath='libnurbs/internals/knotvector.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e61af16a' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='Maxmatrix' type-id='a5d9526b' filepath='libnurbs/internals/mapdesc.h' line='45' column='1' id='526a0547'/>
    <class-decl name='Mapdesc' size-in-bits='3392' is-struct='yes' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='49' column='1' id='ddf7c644'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pixel_tolerance' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='error_tolerance' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='object_space_error_tolerance' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='clampfactor' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='minsavings' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='maxrate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='maxsrate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='maxtrate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bboxsize' type-id='5e051f08' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='isrational' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='544'>
        <var-decl name='ncoords' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='hcoords' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='118' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <var-decl name='inhcoords' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='mask' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='672'>
        <var-decl name='bmat' type-id='526a0547' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='cmat' type-id='526a0547' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='122' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2272'>
        <var-decl name='smat' type-id='526a0547' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3072'>
        <var-decl name='s_steps' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3104'>
        <var-decl name='t_steps' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3136'>
        <var-decl name='sampling_method' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3168'>
        <var-decl name='culling_method' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3200'>
        <var-decl name='bbox_subdividing' type-id='234bc418' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3264'>
        <var-decl name='next' type-id='4674ed22' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3328'>
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='130' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Mapdesc' filepath='libnurbs/internals/mapdesc.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4674ed22' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='6edb776c'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Quiltspec' size-in-bits='320' is-struct='yes' visibility='default' filepath='libnurbs/internals/quilt.h' line='51' column='1' id='2412cf51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stride' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='width' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='order' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='index' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/quilt.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='bdry' type-id='e4266c7e' visibility='default' filepath='libnurbs/internals/quilt.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='step_size' type-id='234bc418' visibility='default' filepath='libnurbs/internals/quilt.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='breakpoints' type-id='25406ea7' visibility='default' filepath='libnurbs/internals/quilt.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Quiltspec_ptr' type-id='e8e13829' filepath='libnurbs/internals/quilt.h' line='62' column='1' id='cbe067ff'/>
    <typedef-decl name='Knot' type-id='234bc418' filepath='libnurbs/internals/types.h' line='45' column='1' id='aee318ca'/>
    <reference-type-def kind='lvalue' type-id='218b0c8c' size-in-bits='64' id='d9feb4d6'/>
    <pointer-type-def type-id='218b0c8c' size-in-bits='64' id='e5fec7ba'/>
    <qualified-type-def type-id='e5fec7ba' const='yes' id='d29c3a85'/>
    <reference-type-def kind='lvalue' type-id='79b62e7d' size-in-bits='64' id='5f4f9299'/>
    <pointer-type-def type-id='aee318ca' size-in-bits='64' id='25406ea7'/>
    <reference-type-def kind='lvalue' type-id='6954a4ec' size-in-bits='64' id='da1ade86'/>
    <pointer-type-def type-id='ddf7c644' size-in-bits='64' id='4674ed22'/>
    <qualified-type-def type-id='4674ed22' const='yes' id='30de322d'/>
    <pointer-type-def type-id='2412cf51' size-in-bits='64' id='e8e13829'/>
    <pointer-type-def type-id='5e051f08' size-in-bits='64' id='24100286'/>
    <pointer-type-def type-id='87305fb5' size-in-bits='64' id='7026874d'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curvelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='a6c45d85' size-in-bits='96' id='c723f882'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <pointer-type-def type-id='5d0beef4' size-in-bits='64' id='d1ebbf42'/>
    <qualified-type-def type-id='d1ebbf42' const='yes' id='a71deacd'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curvesub.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='d5ebc58e' id='d5ebc58f'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/displaylist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='bcada069' visibility='default' filepath='libnurbs/internals/displaylist.h' line='46' column='1' id='b0785859'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pfn' type-id='2c7b94d4' visibility='default' filepath='libnurbs/internals/displaylist.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__delta' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/displaylist.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PFVS' type-id='b0785859' filepath='libnurbs/internals/displaylist.h' line='46' column='1' id='bcada069'/>
    <class-decl name='Dlnode' size-in-bits='384' is-struct='yes' visibility='default' filepath='libnurbs/internals/displaylist.h' line='48' column='1' id='842084cd'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='work' type-id='bcada069' visibility='default' filepath='libnurbs/internals/displaylist.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default' filepath='libnurbs/internals/displaylist.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cleanup' type-id='bcada069' visibility='default' filepath='libnurbs/internals/displaylist.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='73b7bfcd' visibility='default' filepath='libnurbs/internals/displaylist.h' line='53' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Dlnode' filepath='libnurbs/internals/displaylist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='73b7bfcd' is-artificial='yes'/>
          <parameter type-id='bcada069'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='bcada069'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='DisplayList' size-in-bits='2688' visibility='default' filepath='libnurbs/internals/displaylist.h' line='65' column='1' id='ca1d1f59'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='nodes' type-id='73b7bfcd' visibility='default' filepath='libnurbs/internals/displaylist.h' line='73' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='dlnodePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/displaylist.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <var-decl name='lastNode' type-id='114318a5' visibility='default' filepath='libnurbs/internals/displaylist.h' line='75' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2624'>
        <var-decl name='nt' type-id='5139c56b' visibility='default' filepath='libnurbs/internals/displaylist.h' line='76' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='DisplayList' filepath='libnurbs/internals/displaylist.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7f27e761' is-artificial='yes'/>
          <parameter type-id='5139c56b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~DisplayList' filepath='libnurbs/internals/displaylist.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7f27e761' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='ca1d1f59' size-in-bits='64' id='7f27e761'/>
    <qualified-type-def type-id='7f27e761' const='yes' id='13785b3e'/>
    <pointer-type-def type-id='842084cd' size-in-bits='64' id='73b7bfcd'/>
    <pointer-type-def type-id='73b7bfcd' size-in-bits='64' id='114318a5'/>
    <pointer-type-def type-id='5c7cffcb' size-in-bits='64' id='5139c56b'/>
    <pointer-type-def type-id='d945ad82' size-in-bits='64' id='2c7b94d4'/>
    <function-type size-in-bits='64' id='d945ad82'>
      <parameter type-id='5139c56b' is-artificial='yes'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/flist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='6b4fa57d' const='yes' id='755fcf52'/>
    <pointer-type-def type-id='3b7cb332' size-in-bits='64' id='0456e320'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/flistsorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='0456e320' const='yes' id='b3ced473'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/hull.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Hull' size-in-bits='4800' visibility='default' filepath='libnurbs/internals/hull.h' line='47' column='1' id='f0de652e'>
      <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='48e5d3e9'/>
      <member-type access='private'>
        <class-decl name='Side' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/hull.h' line='55' column='1' id='46bb2581'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='left' type-id='46568fdb' visibility='default' filepath='libnurbs/internals/hull.h' line='56' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='line' type-id='001d2813' visibility='default' filepath='libnurbs/internals/hull.h' line='57' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='right' type-id='46568fdb' visibility='default' filepath='libnurbs/internals/hull.h' line='58' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='index' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/hull.h' line='59' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='lower' type-id='46bb2581' visibility='default' filepath='libnurbs/internals/hull.h' line='62' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='upper' type-id='46bb2581' visibility='default' filepath='libnurbs/internals/hull.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='fakeleft' type-id='0aec50eb' visibility='default' filepath='libnurbs/internals/hull.h' line='64' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='fakeright' type-id='0aec50eb' visibility='default' filepath='libnurbs/internals/hull.h' line='65' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Hull' filepath='libnurbs/internals/hull.cc' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eea618b4' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <parameter type-id='63e171df' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Hull' filepath='libnurbs/internals/hull.cc' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eea618b4' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <parameter type-id='63e171df' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='77f16233' size-in-bits='64' id='001d2813'/>
    <pointer-type-def type-id='f0de652e' size-in-bits='64' id='eea618b4'/>
    <qualified-type-def type-id='eea618b4' const='yes' id='52b546ff'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/intersect.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='6eadc0e8' id='6eadc0e9'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/knotvector.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='6954a4ec' size-in-bits='64' id='e61af16a'/>
    <qualified-type-def type-id='e61af16a' const='yes' id='2955d335'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/mapdesc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/mapdescv.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/maplist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Maplist' size-in-bits='2688' visibility='default' filepath='libnurbs/internals/maplist.h' line='46' column='1' id='90b97905'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mapdescPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/maplist.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <var-decl name='maps' type-id='4674ed22' visibility='default' filepath='libnurbs/internals/maplist.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <var-decl name='lastmap' type-id='f2112398' visibility='default' filepath='libnurbs/internals/maplist.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2624'>
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/maplist.h' line='61' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Maplist' filepath='libnurbs/internals/maplist.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='665022b5' is-artificial='yes'/>
          <parameter type-id='6edb776c'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='4674ed22' size-in-bits='64' id='f2112398'/>
    <pointer-type-def type-id='90b97905' size-in-bits='64' id='665022b5'/>
    <qualified-type-def type-id='665022b5' const='yes' id='dd50c1aa'/>
    <qualified-type-def type-id='298506af' const='yes' id='77cd86bc'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/mesher.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='6ae24567' size-in-bits='128' id='ab299dbd'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <class-decl name='Mesher' size-in-bits='7680' visibility='default' filepath='libnurbs/internals/mesher.h' line='47' column='1' id='43336373'>
      <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='48e5d3e9'/>
      <base-class access='public' layout-offset-in-bits='0' type-id='f0de652e'/>
      <data-member access='private' static='yes'>
        <var-decl name='ZERO' type-id='73f3791e' mangled-name='_ZN6Mesher4ZEROE' visibility='default' filepath='libnurbs/internals/mesher.cc' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2240'>
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/mesher.h' line='56' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <var-decl name='p' type-id='1329513b' visibility='default' filepath='libnurbs/internals/mesher.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4800'>
        <var-decl name='stacksize' type-id='f0981eeb' visibility='default' filepath='libnurbs/internals/mesher.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4864'>
        <var-decl name='vdata' type-id='8f331837' visibility='default' filepath='libnurbs/internals/mesher.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4928'>
        <var-decl name='last' type-id='ab299dbd' visibility='default' filepath='libnurbs/internals/mesher.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5056'>
        <var-decl name='itop' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mesher.h' line='62' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5088'>
        <var-decl name='lastedge' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/mesher.h' line='63' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Mesher' filepath='libnurbs/internals/mesher.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e701e7d3' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <parameter type-id='63e171df' is-artificial='yes'/>
          <parameter type-id='6edb776c'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Mesher' filepath='libnurbs/internals/mesher.cc' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e701e7d3' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <parameter type-id='63e171df' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='6ae24567' size-in-bits='64' id='8f331837'/>
    <pointer-type-def type-id='43336373' size-in-bits='64' id='e701e7d3'/>
    <qualified-type-def type-id='e701e7d3' const='yes' id='18ea76e8'/>
    <qualified-type-def type-id='a6c45d85' const='yes' id='73f3791e'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/monoTriangulationBackend.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='a802d838' size-in-bits='64' id='1118b547'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <typedef-decl name='Real' type-id='a6c45d85' filepath='libnurbs/nurbtess/definitions.h' line='36' column='1' id='a802d838'/>
    <typedef-decl name='Int' type-id='95e97e5e' filepath='libnurbs/nurbtess/definitions.h' line='37' column='1' id='32f25375'/>
    <typedef-decl name='Real2' type-id='1118b547' filepath='libnurbs/nurbtess/definitions.h' line='38' column='1' id='867a17be'/>
    <class-decl name='reflexChain' size-in-bits='192' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='43' column='1' id='fed1cadc'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='queue' type-id='36c64b55' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='isIncreasing' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='index_queue' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='size_queue' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='52' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='reflexChain' filepath='libnurbs/nurbtess/monoTriangulation.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7891e01a' is-artificial='yes'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='32f25375'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~reflexChain' filepath='libnurbs/nurbtess/monoTriangulation.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7891e01a' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='vertexArray' size-in-bits='128' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='77' column='1' id='4a6b02dc'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='array' type-id='36d9d30d' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='78' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='index' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='79' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='size' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='80' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='vertexArray' filepath='libnurbs/nurbtess/monoTriangulation.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='be5dbe2a' is-artificial='yes'/>
          <parameter type-id='32f25375'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='vertexArray' filepath='libnurbs/nurbtess/monoTriangulation.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='be5dbe2a' is-artificial='yes'/>
          <parameter type-id='56e59a97'/>
          <parameter type-id='32f25375'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~vertexArray' filepath='libnurbs/nurbtess/monoTriangulation.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='be5dbe2a' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='primStream' size-in-bits='384' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='44' column='1' id='5b685d1d'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='lengths' type-id='f2be5cbc' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='types' type-id='f2be5cbc' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='vertices' type-id='5ede3cf5' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='index_lengths' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='size_lengths' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='index_vertices' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <var-decl name='size_vertices' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='counter' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='59' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='primStream' filepath='libnurbs/nurbtess/primitiveStream.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e5e2105d' is-artificial='yes'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='32f25375'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~primStream' filepath='libnurbs/nurbtess/primitiveStream.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e5e2105d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='32f25375' size-in-bits='64' id='f2be5cbc'/>
    <pointer-type-def type-id='a802d838' size-in-bits='64' id='5ede3cf5'/>
    <pointer-type-def type-id='5ede3cf5' size-in-bits='64' id='36d9d30d'/>
    <pointer-type-def type-id='867a17be' size-in-bits='64' id='36c64b55'/>
    <pointer-type-def type-id='1118b547' size-in-bits='64' id='56e59a97'/>
    <pointer-type-def type-id='5b685d1d' size-in-bits='64' id='e5e2105d'/>
    <pointer-type-def type-id='fed1cadc' size-in-bits='64' id='7891e01a'/>
    <qualified-type-def type-id='7891e01a' const='yes' id='2cbf14e5'/>
    <pointer-type-def type-id='4a6b02dc' size-in-bits='64' id='be5dbe2a'/>
    <qualified-type-def type-id='be5dbe2a' const='yes' id='213dcd75'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/monotonizer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/nurbsinterfac.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <enum-decl name='Curvetype' filepath='libnurbs/internals/reader.h' line='42' column='1' id='3efca5a3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ct_nurbscurve' value='0'/>
      <enumerator name='ct_pwlcurve' value='1'/>
      <enumerator name='ct_none' value='2'/>
    </enum-decl>
    <class-decl name='O_curve' size-in-bits='384' is-struct='yes' visibility='default' filepath='libnurbs/internals/reader.h' line='55' column='1' id='6d93fd9a'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='libnurbs/internals/reader.h' line='56' column='1' id='99421386'>
          <data-member access='public'>
            <var-decl name='o_nurbscurve' type-id='d8d22910' visibility='default' filepath='libnurbs/internals/reader.h' line='57' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='o_pwlcurve' type-id='9683ca4d' visibility='default' filepath='libnurbs/internals/reader.h' line='58' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='curve' type-id='99421386' visibility='default' filepath='libnurbs/internals/reader.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='curvetype' type-id='3efca5a3' visibility='default' filepath='libnurbs/internals/reader.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='75b98f98' visibility='default' filepath='libnurbs/internals/reader.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='owner' type-id='1d8fd45c' visibility='default' filepath='libnurbs/internals/reader.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='used' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='save' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nuid' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/reader.h' line='65' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='O_curve' filepath='libnurbs/internals/reader.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='75b98f98' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='O_nurbscurve' size-in-bits='384' is-struct='yes' visibility='default' filepath='libnurbs/internals/reader.h' line='70' column='1' id='924cfbf2'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bezier_curves' type-id='ad0c8abc' visibility='default' filepath='libnurbs/internals/reader.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/reader.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tesselation' type-id='234bc418' visibility='default' filepath='libnurbs/internals/reader.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='method' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next' type-id='d8d22910' visibility='default' filepath='libnurbs/internals/reader.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='used' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='save' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='owner' type-id='75b98f98' visibility='default' filepath='libnurbs/internals/reader.h' line='78' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='O_nurbscurve' filepath='libnurbs/internals/reader.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d8d22910' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='O_pwlcurve' size-in-bits='320' is-struct='yes' visibility='default' filepath='libnurbs/internals/reader.h' line='83' column='1' id='88f6e8cd'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/reader.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='9683ca4d' visibility='default' filepath='libnurbs/internals/reader.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='used' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='save' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='owner' type-id='75b98f98' visibility='default' filepath='libnurbs/internals/reader.h' line='90' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='O_pwlcurve' filepath='libnurbs/internals/reader.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9683ca4d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='86e0e963'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='O_trim' size-in-bits='192' is-struct='yes' visibility='default' filepath='libnurbs/internals/reader.h' line='94' column='1' id='35855943'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='o_curve' type-id='75b98f98' visibility='default' filepath='libnurbs/internals/reader.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='bc1314a3' visibility='default' filepath='libnurbs/internals/reader.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='save' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='97' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='O_trim' filepath='libnurbs/internals/reader.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='bc1314a3' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='O_nurbssurface' size-in-bits='320' is-struct='yes' visibility='default' filepath='libnurbs/internals/reader.h' line='101' column='1' id='67d0cdae'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bezier_patches' type-id='ad0c8abc' visibility='default' filepath='libnurbs/internals/reader.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/reader.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='owner' type-id='1d8fd45c' visibility='default' filepath='libnurbs/internals/reader.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next' type-id='c8fdd5d4' visibility='default' filepath='libnurbs/internals/reader.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='save' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='used' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='107' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='O_nurbssurface' filepath='libnurbs/internals/reader.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c8fdd5d4' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='O_surface' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/reader.h' line='112' column='1' id='80cf1076'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='o_nurbssurface' type-id='c8fdd5d4' visibility='default' filepath='libnurbs/internals/reader.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='o_trim' type-id='bc1314a3' visibility='default' filepath='libnurbs/internals/reader.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='save' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nuid' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/reader.h' line='116' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='O_surface' filepath='libnurbs/internals/reader.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='1d8fd45c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Property' size-in-bits='192' is-struct='yes' visibility='default' filepath='libnurbs/internals/reader.h' line='120' column='1' id='22604890'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/reader.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/reader.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='234bc418' visibility='default' filepath='libnurbs/internals/reader.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='save' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/reader.h' line='124' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Property' filepath='libnurbs/internals/reader.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0d7c2c66' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='a6c45d85'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Property' filepath='libnurbs/internals/reader.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0d7c2c66' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='a6c45d85'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='5139c56b' const='yes' id='5cb6b520'/>
    <pointer-type-def type-id='6d93fd9a' size-in-bits='64' id='75b98f98'/>
    <pointer-type-def type-id='75b98f98' size-in-bits='64' id='051d3536'/>
    <pointer-type-def type-id='924cfbf2' size-in-bits='64' id='d8d22910'/>
    <pointer-type-def type-id='d8d22910' size-in-bits='64' id='8cd6e64e'/>
    <pointer-type-def type-id='67d0cdae' size-in-bits='64' id='c8fdd5d4'/>
    <pointer-type-def type-id='c8fdd5d4' size-in-bits='64' id='6597deda'/>
    <pointer-type-def type-id='88f6e8cd' size-in-bits='64' id='9683ca4d'/>
    <pointer-type-def type-id='9683ca4d' size-in-bits='64' id='5877a025'/>
    <pointer-type-def type-id='80cf1076' size-in-bits='64' id='1d8fd45c'/>
    <pointer-type-def type-id='35855943' size-in-bits='64' id='bc1314a3'/>
    <pointer-type-def type-id='bc1314a3' size-in-bits='64' id='9b0953ab'/>
    <pointer-type-def type-id='22604890' size-in-bits='64' id='0d7c2c66'/>
    <pointer-type-def type-id='14066291' size-in-bits='64' id='c204f909'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/patch.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='5a62dc52' size-in-bits='640' id='85fe00da'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='92160' id='e50de1e7'>
      <subrange length='2880' type-id='7359adad' id='f1725f7f'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='234bc418' size-in-bits='320' id='bc4b428a'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <class-decl name='Pspec' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/patch.h' line='46' column='1' id='1ce37a50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='range' type-id='61f61aca' visibility='default' filepath='libnurbs/internals/patch.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sidestep' type-id='5df3d5e7' visibility='default' filepath='libnurbs/internals/patch.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='stepsize' type-id='234bc418' visibility='default' filepath='libnurbs/internals/patch.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='minstepsize' type-id='234bc418' visibility='default' filepath='libnurbs/internals/patch.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='needsSubdivision' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patch.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Patchspec' size-in-bits='320' is-struct='yes' visibility='default' filepath='libnurbs/internals/patch.h' line='54' column='1' id='5a62dc52'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1ce37a50'/>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='order' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patch.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='stride' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patch.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Patch' size-in-bits='277696' visibility='default' filepath='libnurbs/internals/patch.h' line='62' column='1' id='8d171131'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mapdesc' type-id='4674ed22' visibility='default' filepath='libnurbs/internals/patch.h' line='82' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='049c92d9' visibility='default' filepath='libnurbs/internals/patch.h' line='83' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='cullval' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patch.h' line='84' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='notInBbox' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patch.h' line='85' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='needsSampling' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patch.h' line='86' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='cpts' type-id='e50de1e7' visibility='default' filepath='libnurbs/internals/patch.h' line='87' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='92384'>
        <var-decl name='spts' type-id='e50de1e7' visibility='default' filepath='libnurbs/internals/patch.h' line='88' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='184544'>
        <var-decl name='bpts' type-id='e50de1e7' visibility='default' filepath='libnurbs/internals/patch.h' line='89' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='276704'>
        <var-decl name='pspec' type-id='85fe00da' visibility='default' filepath='libnurbs/internals/patch.h' line='90' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='277344'>
        <var-decl name='bb' type-id='bc4b428a' visibility='default' filepath='libnurbs/internals/patch.h' line='92' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Patch' filepath='libnurbs/internals/patch.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='049c92d9' is-artificial='yes'/>
          <parameter type-id='ad0c8abc'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='049c92d9'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Patch' filepath='libnurbs/internals/patch.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='049c92d9' is-artificial='yes'/>
          <parameter type-id='109ca5bd'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='049c92d9'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <reference-type-def kind='lvalue' type-id='8d171131' size-in-bits='64' id='109ca5bd'/>
    <pointer-type-def type-id='8d171131' size-in-bits='64' id='049c92d9'/>
    <qualified-type-def type-id='049c92d9' const='yes' id='22d279f6'/>
    <pointer-type-def type-id='5a62dc52' size-in-bits='64' id='5c602a60'/>
    <qualified-type-def type-id='5c602a60' const='yes' id='beb97833'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/patchlist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='1ce37a50' size-in-bits='512' id='e0a39484'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <pointer-type-def type-id='48a81e9d' size-in-bits='64' id='762f3b2d'/>
    <qualified-type-def type-id='762f3b2d' const='yes' id='5f2baf02'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/quilt.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='5f4f9299' id='5f4f929a'/>
    <qualified-type-def type-id='ad0c8abc' const='yes' id='d68deea7'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/renderhints.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='c204f909' const='yes' id='2ff6e626'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/slicer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='gridWrap' size-in-bits='384' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='42' column='1' id='b1db0891'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='n_ulines' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='43' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='n_vlines' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='u_min' type-id='a802d838' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='u_max' type-id='a802d838' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='v_min' type-id='a802d838' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='v_max' type-id='a802d838' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='u_values' type-id='5ede3cf5' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='v_values' type-id='5ede3cf5' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='is_uniform' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='55' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='gridWrap' filepath='libnurbs/nurbtess/gridWrap.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c4e641e9' is-artificial='yes'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='a802d838'/>
          <parameter type-id='a802d838'/>
          <parameter type-id='a802d838'/>
          <parameter type-id='a802d838'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='gridWrap' filepath='libnurbs/nurbtess/gridWrap.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c4e641e9' is-artificial='yes'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='5ede3cf5'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='5ede3cf5'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~gridWrap' filepath='libnurbs/nurbtess/gridWrap.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c4e641e9' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='gridBoundaryChain' size-in-bits='320' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='96' column='1' id='79e57e10'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='grid' type-id='c4e641e9' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='97' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='firstVlineIndex' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='98' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='nVlines' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='99' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='ulineIndices' type-id='f2be5cbc' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='100' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='innerIndices' type-id='f2be5cbc' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='101' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='vertices' type-id='36c64b55' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='105' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='gridBoundaryChain' filepath='libnurbs/nurbtess/gridWrap.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0d810ce6' is-artificial='yes'/>
          <parameter type-id='c4e641e9'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='f2be5cbc'/>
          <parameter type-id='f2be5cbc'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~gridBoundaryChain' filepath='libnurbs/nurbtess/gridWrap.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0d810ce6' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='rectBlock' size-in-bits='192' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='39' column='1' id='0590eb00'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='upGridLineIndex' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='40' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='lowGridLineIndex' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='41' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='leftIndices' type-id='f2be5cbc' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='42' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='rightIndices' type-id='f2be5cbc' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='43' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='rectBlock' filepath='libnurbs/nurbtess/rectBlock.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='90375eb6' is-artificial='yes'/>
          <parameter type-id='0d810ce6'/>
          <parameter type-id='0d810ce6'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='32f25375'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~rectBlock' filepath='libnurbs/nurbtess/rectBlock.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='90375eb6' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='rectBlockArray' size-in-bits='128' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='61' column='1' id='b493db9d'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='array' type-id='a329ef94' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='62' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='n_elements' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='size' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='64' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='rectBlockArray' filepath='libnurbs/nurbtess/rectBlock.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='b575020d' is-artificial='yes'/>
          <parameter type-id='32f25375'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~rectBlockArray' filepath='libnurbs/nurbtess/rectBlock.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='b575020d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='588a6d01' size-in-bits='64' id='054b4ce9'/>
    <qualified-type-def type-id='054b4ce9' const='yes' id='4398f786'/>
    <qualified-type-def type-id='c79084e1' const='yes' id='bcb00cbe'/>
    <pointer-type-def type-id='79e57e10' size-in-bits='64' id='0d810ce6'/>
    <pointer-type-def type-id='b1db0891' size-in-bits='64' id='c4e641e9'/>
    <qualified-type-def type-id='c4e641e9' const='yes' id='7cb44486'/>
    <qualified-type-def type-id='e5e2105d' const='yes' id='4d401d32'/>
    <pointer-type-def type-id='0590eb00' size-in-bits='64' id='90375eb6'/>
    <qualified-type-def type-id='90375eb6' const='yes' id='245041a9'/>
    <pointer-type-def type-id='90375eb6' size-in-bits='64' id='a329ef94'/>
    <pointer-type-def type-id='b493db9d' size-in-bits='64' id='b575020d'/>
    <qualified-type-def type-id='b575020d' const='yes' id='077d5ae2'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/sorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='9e581de0' const='yes' id='fe55cfb3'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/subdivider.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='6a2f2849' id='6a2f284a'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/tobezier.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <typedef-decl name='Quilt_ptr' type-id='ad0c8abc' filepath='libnurbs/internals/quilt.h' line='90' column='1' id='ad3b3e48'/>
    <class-decl name='Breakpt' size-in-bits='96' is-struct='yes' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='48' column='1' id='c42a914c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='aee318ca' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='multi' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='def' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Knotspec' size-in-bits='1152' is-struct='yes' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='54' column='1' id='aa4dbef8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='order' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='inkbegin' type-id='23db448b' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='inkend' type-id='23db448b' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='outkbegin' type-id='23db448b' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='outkend' type-id='23db448b' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='kleft' type-id='23db448b' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='kright' type-id='23db448b' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='kfirst' type-id='23db448b' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='klast' type-id='23db448b' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sbegin' type-id='23db448b' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bbegin' type-id='a3d4330a' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='bend' type-id='a3d4330a' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ncoords' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='prestride' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='poststride' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='preoffset' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='postoffset' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='prewidth' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='postwidth' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='istransformed' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='next' type-id='39169d3e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='kspectotrans' type-id='39169d3e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='76' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Knotspec' filepath='libnurbs/internals/tobezier.cc' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='39169d3e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Knotspec' filepath='libnurbs/internals/tobezier.cc' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='39169d3e' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Splinespec' size-in-bits='192' is-struct='yes' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='95' column='1' id='53f4a207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kspec' type-id='39169d3e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dim' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='outcpts' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='100' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Splinespec' filepath='libnurbs/internals/tobezier.cc' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='327b9fdf' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Splinespec' filepath='libnurbs/internals/tobezier.cc' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='327b9fdf' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='Knot_ptr' type-id='c0eda015' filepath='libnurbs/internals/types.h' line='45' column='1' id='23db448b'/>
    <pointer-type-def type-id='c42a914c' size-in-bits='64' id='a3d4330a'/>
    <pointer-type-def type-id='aa4dbef8' size-in-bits='64' id='39169d3e'/>
    <qualified-type-def type-id='39169d3e' const='yes' id='9f9842b1'/>
    <qualified-type-def type-id='da1ade86' id='da1ade87'/>
    <pointer-type-def type-id='53f4a207' size-in-bits='64' id='327b9fdf'/>
    <qualified-type-def type-id='327b9fdf' const='yes' id='479fd5ec'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/trimline.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='8dd47cdf' const='yes' id='3f49caec'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/trimvertpool.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='6fa6a6a9' const='yes' id='d8e77fc6'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/uarray.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='5ab658c5' const='yes' id='11464fba'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/varray.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='32000' id='5d2d98da'>
      <subrange length='1000' type-id='7359adad' id='a4671b12'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='64000' id='a475163d'>
      <subrange length='1000' type-id='7359adad' id='a4671b12'/>
    </array-type-def>
    <class-decl name='Varray' size-in-bits='96192' visibility='default' filepath='libnurbs/internals/varray.h' line='43' column='1' id='7c8dc54a'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='varray' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/varray.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='vval' type-id='5d2d98da' visibility='default' filepath='libnurbs/internals/varray.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32064'>
        <var-decl name='voffset' type-id='a475163d' visibility='default' filepath='libnurbs/internals/varray.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96064'>
        <var-decl name='numquads' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/varray.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96128'>
        <var-decl name='size' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/varray.h' line='54' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Varray' filepath='libnurbs/internals/varray.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='bbfd82c8' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Varray' filepath='libnurbs/internals/varray.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='bbfd82c8' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='7c8dc54a' size-in-bits='64' id='bbfd82c8'/>
    <qualified-type-def type-id='bbfd82c8' const='yes' id='2d74eb1b'/>
    <pointer-type-def type-id='bd54fe1a' size-in-bits='64' id='3ccc2590'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/directedLine.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <class-decl name='directedLine' size-in-bits='448' visibility='default' filepath='libnurbs/nurbtess/directedLine.h' line='41' column='1' id='699d51a7'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='direction' type-id='a2185560' visibility='default' filepath='libnurbs/nurbtess/directedLine.h' line='42' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='sline' type-id='92047aeb' visibility='default' filepath='libnurbs/nurbtess/directedLine.h' line='43' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='9b78926f' visibility='default' filepath='libnurbs/nurbtess/directedLine.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='prev' type-id='9b78926f' visibility='default' filepath='libnurbs/nurbtess/directedLine.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='nextPolygon' type-id='9b78926f' visibility='default' filepath='libnurbs/nurbtess/directedLine.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='rootBit' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/directedLine.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='rootLink' type-id='9b78926f' visibility='default' filepath='libnurbs/nurbtess/directedLine.h' line='58' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='directedLine' filepath='libnurbs/nurbtess/directedLine.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9b78926f' is-artificial='yes'/>
          <parameter type-id='a2185560'/>
          <parameter type-id='92047aeb'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='directedLine' filepath='libnurbs/nurbtess/directedLine.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9b78926f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~directedLine' filepath='libnurbs/nurbtess/directedLine.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9b78926f' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='sampledLine' size-in-bits='192' visibility='default' filepath='libnurbs/nurbtess/sampledLine.h' line='38' column='1' id='ec9c640b'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='npoints' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/sampledLine.h' line='39' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='points' type-id='36c64b55' visibility='default' filepath='libnurbs/nurbtess/sampledLine.h' line='40' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='92047aeb' visibility='default' filepath='libnurbs/nurbtess/sampledLine.h' line='65' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='sampledLine' filepath='libnurbs/nurbtess/sampledLine.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92047aeb' is-artificial='yes'/>
          <parameter type-id='32f25375'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='sampledLine' filepath='libnurbs/nurbtess/sampledLine.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92047aeb' is-artificial='yes'/>
          <parameter type-id='32f25375'/>
          <parameter type-id='56e59a97'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='sampledLine' filepath='libnurbs/nurbtess/sampledLine.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92047aeb' is-artificial='yes'/>
          <parameter type-id='5ede3cf5'/>
          <parameter type-id='5ede3cf5'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='sampledLine' filepath='libnurbs/nurbtess/sampledLine.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92047aeb' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~sampledLine' filepath='libnurbs/nurbtess/sampledLine.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92047aeb' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='f6be6308' id='f6be6309'/>
    <reference-type-def kind='lvalue' type-id='32f25375' size-in-bits='64' id='f6be6308'/>
    <pointer-type-def type-id='699d51a7' size-in-bits='64' id='9b78926f'/>
    <qualified-type-def type-id='9b78926f' const='yes' id='64de02fc'/>
    <pointer-type-def type-id='9b78926f' size-in-bits='64' id='03ce429f'/>
    <qualified-type-def type-id='769216e8' id='769216e9'/>
    <reference-type-def kind='lvalue' type-id='95e97e5e' size-in-bits='64' id='769216e8'/>
    <pointer-type-def type-id='ec9c640b' size-in-bits='64' id='92047aeb'/>
    <qualified-type-def type-id='92047aeb' const='yes' id='3a7fbea0'/>
    <pointer-type-def type-id='92047aeb' size-in-bits='64' id='9e0d3dd3'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/gridWrap.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='0d810ce6' const='yes' id='d16fb519'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/monoChain.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='monoChain' size-in-bits='640' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='41' column='1' id='8dca786f'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='chainHead' type-id='9b78926f' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='42' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='chainTail' type-id='9b78926f' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='43' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='7ec1f7d7' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='prev' type-id='7ec1f7d7' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='nextPolygon' type-id='7ec1f7d7' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='minX' type-id='a802d838' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='maxX' type-id='a802d838' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='minY' type-id='a802d838' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='416'>
        <var-decl name='maxY' type-id='a802d838' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='isIncrease' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='current' type-id='9b78926f' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='isKey' type-id='32f25375' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='82' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <var-decl name='keyY' type-id='a802d838' visibility='default' filepath='libnurbs/nurbtess/monoChain.h' line='83' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='monoChain' filepath='libnurbs/nurbtess/monoChain.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7ec1f7d7' is-artificial='yes'/>
          <parameter type-id='9b78926f'/>
          <parameter type-id='9b78926f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~monoChain' filepath='libnurbs/nurbtess/monoChain.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7ec1f7d7' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='8dca786f' size-in-bits='64' id='7ec1f7d7'/>
    <qualified-type-def type-id='7ec1f7d7' const='yes' id='335d5584'/>
    <pointer-type-def type-id='7ec1f7d7' size-in-bits='64' id='88596347'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/monoTriangulation.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/polyDBG.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/sampleComp.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/sampleCompBot.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/sampleCompRight.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/sampleCompTop.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/sampleMonoPoly.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/nurbtess/sampledLine.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libtess/tess.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='1a63ff54' size-in-bits='25600' id='e5cb374c'>
      <subrange length='100' type-id='7359adad' id='4196563c'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='aa631dda' size-in-bits='192' id='cc65a194'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='95989dcf' size-in-bits='1600' id='092da536'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='512' id='5d4efd44'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='1024' id='d2baa450'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <typedef-decl name='GLfloat' type-id='a6c45d85' filepath='../../../include/GL/gl.h' line='160' column='1' id='46496ee3'/>
    <typedef-decl name='GLUtesselator' type-id='d304340d' filepath='../../../include/GL/glu.h' line='276' column='1' id='d3eb229a'/>
    <typedef-decl name='__jmp_buf' type-id='5d4efd44' filepath='/usr/include/bits/setjmp.h' line='32' column='1' id='379a1ab7'/>
