<abi-corpus version='2.1' path='data/test-read-dwarf/test16-pr18904.so' soname='liboffloadmic_host.so.5'>
  <elf-needed>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='ORSLRelease' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReservePartial' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLTryReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_find_associated_mic_memory' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_physical_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_number_of_devices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='omp_init_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_init_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_default_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_dynamic_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_nested_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_num_threads_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_schedule_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_test_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_test_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_unset_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_unset_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZN3COI13EngineGetInfoE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI18PipelineSetCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI20PipelineClearCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI21EventRegisterCallbackE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine12m_func_namesE' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine14c_signal_namesE' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream11all_streamsE' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream13m_stream_lockE' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream15m_streams_countE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_major_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_minor_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_is_attached' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_exe_name' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_id' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_so_pid' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_func_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_init_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_var_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_vtable_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../../gcc/liboffloadmic/runtime/cean_util.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../../gcc/liboffloadmic/runtime/coi/coi_client.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='32768' id='b08f29c6'>
      <subrange length='1024' type-id='4c87fef4' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='128' id='f05e8e77'>
      <subrange length='2' type-id='4c87fef4' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='c523b9f1' size-in-bits='8160' id='0c731b2d'>
      <subrange length='255' type-id='4c87fef4' id='36e7f891'/>
    </array-type-def>
    <class-decl name='coievent' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='63' column='1' id='8622c6fe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opaque' type-id='f05e8e77' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='COIPROCESS' type-id='d209b1a7' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='65' column='1' id='0336cae2'/>
    <typedef-decl name='COIPIPELINE' type-id='3742b05a' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='66' column='1' id='d4fe1d0b'/>
    <typedef-decl name='COIFUNCTION' type-id='f8477a1c' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='67' column='1' id='54033ff1'/>
    <typedef-decl name='COIENGINE' type-id='1de968ee' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='68' column='1' id='28c4cd33'/>
    <typedef-decl name='COIEVENT' type-id='8622c6fe' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='69' column='1' id='f0260387'/>
    <typedef-decl name='COIBUFFER' type-id='e2bf2e3a' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='70' column='1' id='96c561e3'/>
    <typedef-decl name='COILIBRARY' type-id='1862b925' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='71' column='1' id='6ecc5b18'/>
    <typedef-decl name='COIMAPINSTANCE' type-id='8a39605a' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='72' column='1' id='57a116c6'/>
    <enum-decl name='COI_ISA_TYPE' naming-typedef-id='b3e2e7da' linkage-name='12COI_ISA_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIEngine_common.h' line='70' column='1' id='2fda71c6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='COI_ISA_INVALID' value='0'/>
      <enumerator name='COI_ISA_x86_64' value='1'/>
      <enumerator name='COI_ISA_MIC' value='2'/>
      <enumerator name='COI_ISA_KNF' value='3'/>
      <enumerator name='COI_ISA_KNC' value='4'/>
    </enum-decl>
    <typedef-decl name='COI_ISA_TYPE' type-id='2fda71c6' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIEngine_common.h' line='78' column='1' id='b3e2e7da'/>
    <enum-decl name='COIRESULT' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIResult_common.h' line='57' column='1' id='bd011ba0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='COI_SUCCESS' value='0'/>
      <enumerator name='COI_ERROR' value='1'/>
      <enumerator name='COI_NOT_INITIALIZED' value='2'/>
      <enumerator name='COI_ALREADY_INITIALIZED' value='3'/>
      <enumerator name='COI_ALREADY_EXISTS' value='4'/>
      <enumerator name='COI_DOES_NOT_EXIST' value='5'/>
      <enumerator name='COI_INVALID_POINTER' value='6'/>
      <enumerator name='COI_OUT_OF_RANGE' value='7'/>
      <enumerator name='COI_NOT_SUPPORTED' value='8'/>
      <enumerator name='COI_TIME_OUT_REACHED' value='9'/>
      <enumerator name='COI_MEMORY_OVERLAP' value='10'/>
      <enumerator name='COI_ARGUMENT_MISMATCH' value='11'/>
      <enumerator name='COI_SIZE_MISMATCH' value='12'/>
      <enumerator name='COI_OUT_OF_MEMORY' value='13'/>
      <enumerator name='COI_INVALID_HANDLE' value='14'/>
      <enumerator name='COI_RETRY' value='15'/>
      <enumerator name='COI_RESOURCE_EXHAUSTED' value='16'/>
      <enumerator name='COI_ALREADY_LOCKED' value='17'/>
      <enumerator name='COI_NOT_LOCKED' value='18'/>
      <enumerator name='COI_MISSING_DEPENDENCY' value='19'/>
      <enumerator name='COI_UNDEFINED_SYMBOL' value='20'/>
      <enumerator name='COI_PENDING' value='21'/>
      <enumerator name='COI_BINARY_AND_HARDWARE_MISMATCH' value='22'/>
      <enumerator name='COI_PROCESS_DIED' value='23'/>
      <enumerator name='COI_INVALID_FILE' value='24'/>
      <enumerator name='COI_EVENT_CANCELED' value='25'/>
      <enumerator name='COI_VERSION_MISMATCH' value='26'/>
      <enumerator name='COI_BAD_PORT' value='27'/>
      <enumerator name='COI_AUTHENTICATION_FAILURE' value='28'/>
      <enumerator name='COI_NUM_RESULTS' value='29'/>
    </enum-decl>
    <typedef-decl name='COIRESULT' type-id='bd011ba0' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIResult_common.h' line='122' column='1' id='113a42bc'/>
    <enum-decl name='COI_BUFFER_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='65' column='1' id='c2512a19'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='COI_BUFFER_NORMAL' value='1'/>
      <enumerator name='COI_BUFFER_RESERVED_1' value='2'/>
      <enumerator name='COI_BUFFER_RESERVED_2' value='3'/>
      <enumerator name='COI_BUFFER_PINNED' value='4'/>
      <enumerator name='COI_BUFFER_OPENCL' value='5'/>
    </enum-decl>
    <typedef-decl name='COI_BUFFER_TYPE' type-id='c2512a19' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='87' column='1' id='bb73a705'/>
    <enum-decl name='COI_MAP_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='183' column='1' id='e7a4c9d9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='COI_MAP_READ_WRITE' value='1'/>
      <enumerator name='COI_MAP_READ_ONLY' value='2'/>
      <enumerator name='COI_MAP_WRITE_ENTIRE_BUFFER' value='3'/>
    </enum-decl>
    <typedef-decl name='COI_MAP_TYPE' type-id='e7a4c9d9' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='204' column='1' id='b31227d5'/>
    <enum-decl name='COI_COPY_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='240' column='1' id='ed52e370'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='COI_COPY_UNSPECIFIED' value='0'/>
      <enumerator name='COI_COPY_USE_DMA' value='1'/>
      <enumerator name='COI_COPY_USE_CPU' value='2'/>
      <enumerator name='COI_COPY_UNSPECIFIED_MOVE_ENTIRE' value='3'/>
      <enumerator name='COI_COPY_USE_DMA_MOVE_ENTIRE' value='4'/>
      <enumerator name='COI_COPY_USE_CPU_MOVE_ENTIRE' value='5'/>
    </enum-decl>
    <typedef-decl name='COI_COPY_TYPE' type-id='ed52e370' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='265' column='1' id='b9f23514'/>
    <enum-decl name='COI_BUFFER_STATE' naming-typedef-id='ab04ca8e' linkage-name='16COI_BUFFER_STATE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='335' column='1' id='2b5bf282'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='COI_BUFFER_VALID' value='0'/>
      <enumerator name='COI_BUFFER_INVALID' value='1'/>
      <enumerator name='COI_BUFFER_VALID_MAY_DROP' value='2'/>
      <enumerator name='COI_BUFFER_RESERVED' value='3'/>
    </enum-decl>
    <typedef-decl name='COI_BUFFER_STATE' type-id='2b5bf282' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='342' column='1' id='ab04ca8e'/>
    <enum-decl name='COI_BUFFER_MOVE_FLAG' naming-typedef-id='56f4a0c3' linkage-name='20COI_BUFFER_MOVE_FLAG' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='359' column='1' id='d1c3747f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='COI_BUFFER_MOVE' value='0'/>
      <enumerator name='COI_BUFFER_NO_MOVE' value='1'/>
    </enum-decl>
    <typedef-decl name='COI_BUFFER_MOVE_FLAG' type-id='d1c3747f' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='362' column='1' id='56f4a0c3'/>
    <enum-decl name='coi_eng_misc' naming-typedef-id='62e2999f' linkage-name='12coi_eng_misc' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='70' column='1' id='e2516ccb'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='COI_ENG_ECC_DISABLED' value='0'/>
      <enumerator name='COI_ENG_ECC_ENABLED' value='1'/>
      <enumerator name='COI_ENG_ECC_UNKNOWN' value='2'/>
    </enum-decl>
    <typedef-decl name='coi_eng_misc' type-id='e2516ccb' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='74' column='1' id='62e2999f'/>
    <class-decl name='COI_ENGINE_INFO' size-in-bits='41472' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='83' column='1' id='65ae6f0a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='DriverVersion' type-id='0c731b2d' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8160'>
        <var-decl name='ISA' type-id='b3e2e7da' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='NumCores' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8224'>
        <var-decl name='MiscFlags' type-id='62e2999f' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='NumThreads' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8288'>
        <var-decl name='CoreMaxFrequency' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='Load' type-id='b08f29c6' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41088'>
        <var-decl name='PhysicalMemory' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41152'>
        <var-decl name='PhysicalMemoryFree' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41216'>
        <var-decl name='SwapMemory' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41280'>
        <var-decl name='SwapMemoryFree' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41344'>
        <var-decl name='VendorId' type-id='149c6638' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41360'>
        <var-decl name='DeviceId' type-id='149c6638' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41376'>
        <var-decl name='SubSystemId' type-id='149c6638' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41392'>
        <var-decl name='BoardStepping' type-id='149c6638' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41408'>
        <var-decl name='BoardSKU' type-id='149c6638' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='COI_ENGINE_INFO' type-id='65ae6f0a' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='133' column='1' id='3b683959'/>
    <enum-decl name='COI_ACCESS_FLAGS' filepath='../../../gcc/liboffloadmic/include/coi/source/COIPipeline_source.h' line='69' column='1' id='f3408120'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='COI_SINK_READ' value='1'/>
      <enumerator name='COI_SINK_WRITE' value='2'/>
      <enumerator name='COI_SINK_WRITE_ENTIRE' value='3'/>
      <enumerator name='COI_SINK_READ_ADDREF' value='4'/>
      <enumerator name='COI_SINK_WRITE_ADDREF' value='5'/>
      <enumerator name='COI_SINK_WRITE_ENTIRE_ADDREF' value='6'/>
    </enum-decl>
    <typedef-decl name='COI_ACCESS_FLAGS' type-id='f3408120' filepath='../../../gcc/liboffloadmic/include/coi/source/COIPipeline_source.h' line='97' column='1' id='d962ac64'/>
    <typedef-decl name='int8_t' type-id='28577a57' filepath='/usr/include/stdint.h' line='36' column='1' id='ee31ee44'/>
    <typedef-decl name='int32_t' type-id='95e97e5e' filepath='/usr/include/stdint.h' line='38' column='1' id='3ff5601b'/>
    <typedef-decl name='uint8_t' type-id='002ac4a6' filepath='/usr/include/stdint.h' line='48' column='1' id='b96825af'/>
    <typedef-decl name='uint16_t' type-id='8efea9e5' filepath='/usr/include/stdint.h' line='49' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='f0981eeb' filepath='/usr/include/stdint.h' line='51' column='1' id='8f92235e'/>
    <pointer-type-def type-id='96c561e3' size-in-bits='64' id='0dbb6ada'/>
    <pointer-type-def type-id='28c4cd33' size-in-bits='64' id='3d53b28e'/>
    <pointer-type-def type-id='f0260387' size-in-bits='64' id='3e2f4144'/>
    <pointer-type-def type-id='54033ff1' size-in-bits='64' id='e94ebbfc'/>
    <pointer-type-def type-id='6ecc5b18' size-in-bits='64' id='4ab6c265'/>
    <pointer-type-def type-id='57a116c6' size-in-bits='64' id='71c8349f'/>
    <pointer-type-def type-id='d4fe1d0b' size-in-bits='64' id='fd88d4fa'/>
    <pointer-type-def type-id='0336cae2' size-in-bits='64' id='0a2c9427'/>
    <pointer-type-def type-id='3b683959' size-in-bits='64' id='f06490a8'/>
    <pointer-type-def type-id='0432330c' size-in-bits='64' id='e2bf2e3a'/>
    <pointer-type-def type-id='6cbeab78' size-in-bits='64' id='1de968ee'/>
    <pointer-type-def type-id='b1b393b6' size-in-bits='64' id='f8477a1c'/>
    <pointer-type-def type-id='13de2145' size-in-bits='64' id='1862b925'/>
    <pointer-type-def type-id='61ac90cc' size-in-bits='64' id='8a39605a'/>
    <pointer-type-def type-id='0541718c' size-in-bits='64' id='3742b05a'/>
    <pointer-type-def type-id='899c5b0f' size-in-bits='64' id='d209b1a7'/>
    <qualified-type-def type-id='96c561e3' const='yes' id='ceb72bd3'/>
    <pointer-type-def type-id='ceb72bd3' size-in-bits='64' id='635a38fb'/>
    <qualified-type-def type-id='f0260387' const='yes' id='276f9f17'/>
    <pointer-type-def type-id='276f9f17' size-in-bits='64' id='51b7ad07'/>
    <qualified-type-def type-id='0336cae2' const='yes' id='85505272'/>
    <pointer-type-def type-id='85505272' size-in-bits='64' id='3571a088'/>
    <qualified-type-def type-id='d962ac64' const='yes' id='83b4c9d4'/>
    <pointer-type-def type-id='83b4c9d4' size-in-bits='64' id='5399fada'/>
    <qualified-type-def type-id='9c313c2d' const='yes' id='c3b7ba7d'/>
    <pointer-type-def type-id='c3b7ba7d' size-in-bits='64' id='713a56f5'/>
    <pointer-type-def type-id='ee31ee44' size-in-bits='64' id='256d5229'/>
    <pointer-type-def type-id='7b2089bf' size-in-bits='64' id='0060486b'/>
    <pointer-type-def type-id='28a8137e' size-in-bits='64' id='e0d2ad98'/>
    <pointer-type-def type-id='f592dd85' size-in-bits='64' id='0475c1a9'/>
    <pointer-type-def type-id='8d3051e9' size-in-bits='64' id='8bf1447d'/>
    <pointer-type-def type-id='1270e629' size-in-bits='64' id='e5d86585'/>
    <pointer-type-def type-id='e387a0b6' size-in-bits='64' id='bce99d90'/>
    <pointer-type-def type-id='703ccb9e' size-in-bits='64' id='2414f908'/>
    <pointer-type-def type-id='4993ac50' size-in-bits='64' id='88f75fe2'/>
    <pointer-type-def type-id='1e9cbe55' size-in-bits='64' id='dadabc89'/>
    <pointer-type-def type-id='dafcac4e' size-in-bits='64' id='1bae1de8'/>
    <pointer-type-def type-id='33f3390d' size-in-bits='64' id='231c66a1'/>
    <pointer-type-def type-id='d1c95cd3' size-in-bits='64' id='2829be57'/>
    <pointer-type-def type-id='ff890b3e' size-in-bits='64' id='60b94b08'/>
    <pointer-type-def type-id='8f53afbf' size-in-bits='64' id='33219eab'/>
    <pointer-type-def type-id='fb44cb75' size-in-bits='64' id='17dc9dd9'/>
    <pointer-type-def type-id='903c82f5' size-in-bits='64' id='a9803911'/>
    <pointer-type-def type-id='e3c73b94' size-in-bits='64' id='e863dc6e'/>
    <pointer-type-def type-id='903dbdb3' size-in-bits='64' id='e0f2e567'/>
    <pointer-type-def type-id='80654fa0' size-in-bits='64' id='a8c994b2'/>
    <pointer-type-def type-id='b86e5542' size-in-bits='64' id='5642e4ec'/>
    <pointer-type-def type-id='249369d7' size-in-bits='64' id='2ce1816b'/>
    <pointer-type-def type-id='e1b4d83a' size-in-bits='64' id='bb4f3d7c'/>
    <pointer-type-def type-id='f8f835d2' size-in-bits='64' id='be26a56c'/>
    <pointer-type-def type-id='0cc77090' size-in-bits='64' id='e4da2b5a'/>
    <pointer-type-def type-id='914073e6' size-in-bits='64' id='7d375ec0'/>
    <pointer-type-def type-id='e3310c41' size-in-bits='64' id='bbacea15'/>
    <pointer-type-def type-id='976e783c' size-in-bits='64' id='867b8fb6'/>
    <pointer-type-def type-id='450b574f' size-in-bits='64' id='989bc91b'/>
    <pointer-type-def type-id='1526c5c0' size-in-bits='64' id='01cd51e2'/>
    <pointer-type-def type-id='87c73498' size-in-bits='64' id='3de02472'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='18078553' size-in-bits='64' id='0ac6469f'/>
    <class-decl name='coibuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='0432330c'/>
    <class-decl name='coiengine' is-struct='yes' visibility='default' is-declaration-only='yes' id='6cbeab78'/>
    <class-decl name='coifunction' is-struct='yes' visibility='default' is-declaration-only='yes' id='b1b393b6'/>
    <class-decl name='coilibrary' is-struct='yes' visibility='default' is-declaration-only='yes' id='13de2145'/>
    <class-decl name='coimapinst' is-struct='yes' visibility='default' is-declaration-only='yes' id='61ac90cc'/>
    <class-decl name='coipipeline' is-struct='yes' visibility='default' is-declaration-only='yes' id='0541718c'/>
    <class-decl name='coiprocess' is-struct='yes' visibility='default' is-declaration-only='yes' id='899c5b0f'/>
    <namespace-decl name='COI'>
      <var-decl name='is_available' type-id='c894953d' mangled-name='_ZN3COI12is_availableE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='60' column='1'/>
      <var-decl name='EngineGetCount' type-id='e4da2b5a' mangled-name='_ZN3COI14EngineGetCountE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='63' column='1'/>
      <var-decl name='EngineGetHandle' type-id='be26a56c' mangled-name='_ZN3COI15EngineGetHandleE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='64' column='1'/>
      <var-decl name='ProcessCreateFromMemory' type-id='1bae1de8' mangled-name='_ZN3COI23ProcessCreateFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='66' column='1'/>
      <var-decl name='ProcessCreateFromFile' type-id='dadabc89' mangled-name='_ZN3COI21ProcessCreateFromFileE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='74' column='1'/>
      <var-decl name='ProcessSetCacheSize' type-id='5642e4ec' mangled-name='_ZN3COI19ProcessSetCacheSizeE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='82' column='1'/>
      <var-decl name='ProcessDestroy' type-id='e863dc6e' mangled-name='_ZN3COI14ProcessDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='85' column='1'/>
      <var-decl name='ProcessGetFunctionHandles' type-id='e0f2e567' mangled-name='_ZN3COI25ProcessGetFunctionHandlesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='87' column='1'/>
      <var-decl name='ProcessLoadLibraryFromMemory' type-id='bb4f3d7c' mangled-name='_ZN3COI28ProcessLoadLibraryFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='90' column='1'/>
      <var-decl name='ProcessUnloadLibrary' type-id='a9803911' mangled-name='_ZN3COI20ProcessUnloadLibraryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='100' column='1'/>
      <var-decl name='ProcessRegisterLibraries' type-id='bbacea15' mangled-name='_ZN3COI24ProcessRegisterLibrariesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='103' column='1'/>
      <var-decl name='PipelineCreate' type-id='2ce1816b' mangled-name='_ZN3COI14PipelineCreateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='109' column='1'/>
      <var-decl name='PipelineDestroy' type-id='33219eab' mangled-name='_ZN3COI15PipelineDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='111' column='1'/>
      <var-decl name='PipelineRunFunction' type-id='17dc9dd9' mangled-name='_ZN3COI19PipelineRunFunctionE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='112' column='1'/>
      <var-decl name='BufferCreate' type-id='989bc91b' mangled-name='_ZN3COI12BufferCreateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='119' column='1'/>
      <var-decl name='BufferCreateFromMemory' type-id='989bc91b' mangled-name='_ZN3COI22BufferCreateFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='122' column='1'/>
      <var-decl name='BufferDestroy' type-id='0060486b' mangled-name='_ZN3COI13BufferDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='126' column='1'/>
      <var-decl name='BufferMap' type-id='e5d86585' mangled-name='_ZN3COI9BufferMapE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='127' column='1'/>
      <var-decl name='BufferUnmap' type-id='60b94b08' mangled-name='_ZN3COI11BufferUnmapE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='130' column='1'/>
      <var-decl name='BufferWrite' type-id='bce99d90' mangled-name='_ZN3COI11BufferWriteE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='132' column='1'/>
      <var-decl name='BufferRead' type-id='bce99d90' mangled-name='_ZN3COI10BufferReadE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='135' column='1'/>
      <var-decl name='BufferReadMultiD' type-id='2414f908' mangled-name='_ZN3COI16BufferReadMultiDE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='138' column='1'/>
      <var-decl name='BufferWriteMultiD' type-id='8bf1447d' mangled-name='_ZN3COI17BufferWriteMultiDE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='141' column='1'/>
      <var-decl name='BufferCopy' type-id='e0d2ad98' mangled-name='_ZN3COI10BufferCopyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='145' column='1'/>
      <var-decl name='BufferGetSinkAddress' type-id='88f75fe2' mangled-name='_ZN3COI20BufferGetSinkAddressE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='148' column='1'/>
      <var-decl name='BufferSetState' type-id='0475c1a9' mangled-name='_ZN3COI14BufferSetStateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='149' column='1'/>
      <var-decl name='EventWait' type-id='7d375ec0' mangled-name='_ZN3COI9EventWaitE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='153' column='1'/>
      <var-decl name='PerfGetCycleFrequency' type-id='3de02472' mangled-name='_ZN3COI21PerfGetCycleFrequencyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='156' column='1'/>
      <var-decl name='ProcessConfigureDMA' type-id='867b8fb6' mangled-name='_ZN3COI19ProcessConfigureDMAE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='158' column='1'/>
      <var-decl name='PipelineClearCPUMask' type-id='01cd51e2' mangled-name='_ZN3COI20PipelineClearCPUMaskE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='160' column='1' elf-symbol-id='_ZN3COI20PipelineClearCPUMaskE'/>
      <var-decl name='PipelineSetCPUMask' type-id='a8c994b2' mangled-name='_ZN3COI18PipelineSetCPUMaskE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='162' column='1' elf-symbol-id='_ZN3COI18PipelineSetCPUMaskE'/>
      <var-decl name='EngineGetInfo' type-id='231c66a1' mangled-name='_ZN3COI13EngineGetInfoE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='164' column='1' elf-symbol-id='_ZN3COI13EngineGetInfoE'/>
      <var-decl name='EventRegisterCallback' type-id='2829be57' mangled-name='_ZN3COI21EventRegisterCallbackE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='166' column='1' elf-symbol-id='_ZN3COI21EventRegisterCallbackE'/>
    </namespace-decl>
    <function-type size-in-bits='64' id='7b2089bf'>
      <parameter type-id='96c561e3'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='28a8137e'>
      <parameter type-id='96c561e3'/>
      <parameter type-id='96c561e3'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='b9f23514'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='3e2f4144'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='f592dd85'>
      <parameter type-id='96c561e3'/>
      <parameter type-id='0336cae2'/>
      <parameter type-id='ab04ca8e'/>
      <parameter type-id='56f4a0c3'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='3e2f4144'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='8d3051e9'>
      <parameter type-id='96c561e3'/>
      <parameter type-id='0336cae2'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b9f23514'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='3e2f4144'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='1270e629'>
      <parameter type-id='96c561e3'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='b31227d5'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='3e2f4144'/>
      <parameter type-id='71c8349f'/>
      <parameter type-id='63e171df'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='e387a0b6'>
      <parameter type-id='96c561e3'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='b9f23514'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='3e2f4144'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='703ccb9e'>
      <parameter type-id='96c561e3'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b9f23514'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='3e2f4144'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='4993ac50'>
      <parameter type-id='96c561e3'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='1e9cbe55'>
      <parameter type-id='28c4cd33'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='0a2c9427'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='dafcac4e'>
      <parameter type-id='28c4cd33'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='0a2c9427'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='33f3390d'>
      <parameter type-id='28c4cd33'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='f06490a8'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='d1c95cd3'>
      <parameter type-id='f0260387'/>
      <parameter type-id='0ac6469f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='ff890b3e'>
      <parameter type-id='57a116c6'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='3e2f4144'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='8f53afbf'>
      <parameter type-id='d4fe1d0b'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='fb44cb75'>
      <parameter type-id='d4fe1d0b'/>
      <parameter type-id='54033ff1'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='635a38fb'/>
      <parameter type-id='5399fada'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='3e2f4144'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='903c82f5'>
      <parameter type-id='0336cae2'/>
      <parameter type-id='6ecc5b18'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='e3c73b94'>
      <parameter type-id='0336cae2'/>
      <parameter type-id='3ff5601b'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='256d5229'/>
      <parameter type-id='90421557'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='903dbdb3'>
      <parameter type-id='0336cae2'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='e94ebbfc'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='80654fa0'>
      <parameter type-id='0336cae2'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='b86e5542'>
      <parameter type-id='0336cae2'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='3e2f4144'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='249369d7'>
      <parameter type-id='0336cae2'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='fd88d4fa'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='e1b4d83a'>
      <parameter type-id='0336cae2'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='4ab6c265'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='f8f835d2'>
      <parameter type-id='b3e2e7da'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='3d53b28e'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='0cc77090'>
      <parameter type-id='b3e2e7da'/>
      <parameter type-id='90421557'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='914073e6'>
      <parameter type-id='149c6638'/>
      <parameter type-id='51b7ad07'/>
      <parameter type-id='3ff5601b'/>
      <parameter type-id='b96825af'/>
      <parameter type-id='90421557'/>
      <parameter type-id='90421557'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='e3310c41'>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='713a56f5'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='713a56f5'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='976e783c'>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='450b574f'>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='bb73a705'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='3571a088'/>
      <parameter type-id='0dbb6ada'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='1526c5c0'>
      <parameter type-id='5d6479ae'/>
      <return type-id='113a42bc'/>
    </function-type>
    <function-type size-in-bits='64' id='87c73498'>
      <return type-id='9c313c2d'/>
    </function-type>
    <function-type size-in-bits='64' id='18078553'>
      <parameter type-id='f0260387'/>
      <parameter type-id='113a42bc'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../../gcc/liboffloadmic/runtime/compiler_if_host.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='a1efbab0' size-in-bits='128' id='f3fa850f'>
      <subrange length='1' type-id='4c87fef4' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='506c7f8b' size-in-bits='320' id='885e55a2'>
      <subrange length='1' type-id='4c87fef4' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e7f43f72' size-in-bits='2560' id='a028658c'>
      <subrange length='20' type-id='4c87fef4' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e7f43f72' size-in-bits='1152' id='fbd51a59'>
      <subrange length='9' type-id='4c87fef4' id='12e4273c'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='infinite' id='e84913bd'>
      <subrange length='infinite' type-id='4c87fef4' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='f8477a1c' size-in-bits='448' id='28a98631'>
      <subrange length='7' type-id='4c87fef4' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='80f4b756' size-in-bits='2048' id='610ed245'>
      <subrange length='32' type-id='4c87fef4' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='80f4b756' size-in-bits='448' id='31d53427'>
      <subrange length='7' type-id='4c87fef4' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='832' id='4c2148e1'>
      <subrange length='104' type-id='4c87fef4' id='419f5098'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='128' id='92a46553'>
      <subrange length='16' type-id='4c87fef4' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='192' id='25108e54'>
      <subrange length='24' type-id='4c87fef4' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='320' id='8feb6012'>
      <subrange length='40' type-id='4c87fef4' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='64' id='491d0410'>
      <subrange length='8' type-id='4c87fef4' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='1024' id='d2baa450'>
      <subrange length='16' type-id='4c87fef4' id='848d0938'/>
    </array-type-def>
    <class-decl name='Dim_Desc' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='38' column='1' id='506c7f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lindex' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lower' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='upper' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='stride' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Arr_Desc' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='46' column='1' id='b57c8818'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rank' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dim' type-id='885e55a2' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='CeanReadDim' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='52' column='1' id='a1efbab0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='CeanReadRanges' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='58' column='1' id='b651c6c0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arr_desc' type-id='d5d002fe' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ptr' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='current_number' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='range_max_number' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='range_size' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='last_noncont_ind' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='init_offset' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='Dim' type-id='f3fa850f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='error_types' naming-typedef-id='c9cdbfbc' linkage-name='11error_types' filepath='../../../gcc/liboffloadmic/runtime/liboffload_error_codes.h' line='38' column='1' id='00e6d0b0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='c_device_is_not_available' value='0'/>
      <enumerator name='c_invalid_device_number' value='1'/>
      <enumerator name='c_offload1' value='2'/>
      <enumerator name='c_unknown_var_type' value='3'/>
      <enumerator name='c_send_func_ptr' value='4'/>
      <enumerator name='c_receive_func_ptr' value='5'/>
      <enumerator name='c_malloc' value='6'/>
      <enumerator name='c_offload_malloc' value='7'/>
      <enumerator name='c_invalid_env_var_value' value='8'/>
      <enumerator name='c_invalid_env_var_int_value' value='9'/>
      <enumerator name='c_invalid_env_report_value' value='10'/>
      <enumerator name='c_offload_signaled1' value='11'/>
      <enumerator name='c_offload_signaled2' value='12'/>
      <enumerator name='c_myotarget_checkresult' value='13'/>
      <enumerator name='c_myowrapper_checkresult' value='14'/>
      <enumerator name='c_offload_descriptor_offload' value='15'/>
      <enumerator name='c_merge_var_descs1' value='16'/>
      <enumerator name='c_merge_var_descs2' value='17'/>
      <enumerator name='c_mic_parse_env_var_list1' value='18'/>
      <enumerator name='c_mic_parse_env_var_list2' value='19'/>
      <enumerator name='c_mic_process_exit_ret' value='20'/>
      <enumerator name='c_mic_process_exit_sig' value='21'/>
      <enumerator name='c_mic_process_exit' value='22'/>
      <enumerator name='c_mic_init3' value='23'/>
      <enumerator name='c_mic_init4' value='24'/>
      <enumerator name='c_mic_init5' value='25'/>
      <enumerator name='c_mic_init6' value='26'/>
      <enumerator name='c_no_static_var_data' value='27'/>
      <enumerator name='c_no_ptr_data' value='28'/>
      <enumerator name='c_get_engine_handle' value='29'/>
      <enumerator name='c_get_engine_index' value='30'/>
      <enumerator name='c_process_create' value='31'/>
      <enumerator name='c_process_set_cache_size' value='32'/>
      <enumerator name='c_process_get_func_handles' value='33'/>
      <enumerator name='c_process_wait_shutdown' value='34'/>
      <enumerator name='c_process_proxy_flush' value='35'/>
      <enumerator name='c_load_library' value='36'/>
      <enumerator name='c_pipeline_create' value='37'/>
      <enumerator name='c_pipeline_run_func' value='38'/>
      <enumerator name='c_pipeline_start_run_funcs' value='39'/>
      <enumerator name='c_buf_create' value='40'/>
      <enumerator name='c_buf_create_out_of_mem' value='41'/>
      <enumerator name='c_buf_create_from_mem' value='42'/>
      <enumerator name='c_buf_destroy' value='43'/>
      <enumerator name='c_buf_map' value='44'/>
      <enumerator name='c_buf_unmap' value='45'/>
      <enumerator name='c_buf_read' value='46'/>
      <enumerator name='c_buf_write' value='47'/>
      <enumerator name='c_buf_copy' value='48'/>
      <enumerator name='c_buf_get_address' value='49'/>
      <enumerator name='c_buf_add_ref' value='50'/>
      <enumerator name='c_buf_release_ref' value='51'/>
      <enumerator name='c_buf_set_state' value='52'/>
      <enumerator name='c_event_wait' value='53'/>
      <enumerator name='c_zero_or_neg_ptr_len' value='54'/>
      <enumerator name='c_zero_or_neg_transfer_size' value='55'/>
      <enumerator name='c_bad_ptr_mem_alloc' value='56'/>
      <enumerator name='c_bad_ptr_mem_range' value='57'/>
      <enumerator name='c_different_src_and_dstn_sizes' value='58'/>
      <enumerator name='c_ranges_dont_match' value='59'/>
      <enumerator name='c_destination_is_over' value='60'/>
      <enumerator name='c_slice_of_noncont_array' value='61'/>
      <enumerator name='c_non_contiguous_dope_vector' value='62'/>
      <enumerator name='c_pointer_array_mismatch' value='63'/>
      <enumerator name='c_omp_invalid_device_num_env' value='64'/>
      <enumerator name='c_omp_invalid_device_num' value='65'/>
      <enumerator name='c_unknown_binary_type' value='66'/>
      <enumerator name='c_multiple_target_exes' value='67'/>
      <enumerator name='c_no_target_exe' value='68'/>
      <enumerator name='c_incorrect_affinity' value='69'/>
      <enumerator name='c_cannot_set_affinity' value='70'/>
      <enumerator name='c_report_host' value='71'/>
      <enumerator name='c_report_target' value='72'/>
      <enumerator name='c_report_title' value='73'/>
      <enumerator name='c_report_from_file' value='74'/>
      <enumerator name='c_report_file' value='75'/>
      <enumerator name='c_report_line' value='76'/>
      <enumerator name='c_report_tag' value='77'/>
      <enumerator name='c_report_seconds' value='78'/>
      <enumerator name='c_report_bytes' value='79'/>
      <enumerator name='c_report_mic' value='80'/>
      <enumerator name='c_report_cpu_time' value='81'/>
      <enumerator name='c_report_cpu_to_mic_data' value='82'/>
      <enumerator name='c_report_mic_time' value='83'/>
      <enumerator name='c_report_mic_to_cpu_data' value='84'/>
      <enumerator name='c_report_unknown_timer_node' value='85'/>
      <enumerator name='c_report_unknown_trace_node' value='86'/>
      <enumerator name='c_report_offload' value='87'/>
      <enumerator name='c_report_w_tag' value='88'/>
      <enumerator name='c_report_state' value='89'/>
      <enumerator name='c_report_start' value='90'/>
      <enumerator name='c_report_init' value='91'/>
      <enumerator name='c_report_logical_card' value='92'/>
      <enumerator name='c_report_physical_card' value='93'/>
      <enumerator name='c_report_register' value='94'/>
      <enumerator name='c_report_init_func' value='95'/>
      <enumerator name='c_report_create_buf_host' value='96'/>
      <enumerator name='c_report_create_buf_mic' value='97'/>
      <enumerator name='c_report_send_pointer_data' value='98'/>
      <enumerator name='c_report_sent_pointer_data' value='99'/>
      <enumerator name='c_report_gather_copyin_data' value='100'/>
      <enumerator name='c_report_copyin_data' value='101'/>
      <enumerator name='c_report_state_signal' value='102'/>
      <enumerator name='c_report_signal' value='103'/>
      <enumerator name='c_report_wait' value='104'/>
      <enumerator name='c_report_compute' value='105'/>
      <enumerator name='c_report_receive_pointer_data' value='106'/>
      <enumerator name='c_report_received_pointer_data' value='107'/>
      <enumerator name='c_report_start_target_func' value='108'/>
      <enumerator name='c_report_var' value='109'/>
      <enumerator name='c_report_scatter_copyin_data' value='110'/>
      <enumerator name='c_report_gather_copyout_data' value='111'/>
      <enumerator name='c_report_scatter_copyout_data' value='112'/>
      <enumerator name='c_report_copyout_data' value='113'/>
      <enumerator name='c_report_unregister' value='114'/>
      <enumerator name='c_report_destroy' value='115'/>
      <enumerator name='c_report_myoinit' value='116'/>
      <enumerator name='c_report_myoregister' value='117'/>
      <enumerator name='c_report_myofini' value='118'/>
      <enumerator name='c_report_mic_myo_shared' value='119'/>
      <enumerator name='c_report_mic_myo_fptr' value='120'/>
      <enumerator name='c_report_myosharedmalloc' value='121'/>
      <enumerator name='c_report_myosharedfree' value='122'/>
      <enumerator name='c_report_myosharedalignedmalloc' value='123'/>
      <enumerator name='c_report_myosharedalignedfree' value='124'/>
      <enumerator name='c_report_myoacquire' value='125'/>
      <enumerator name='c_report_myorelease' value='126'/>
      <enumerator name='c_report_myosupportsfeature' value='127'/>
      <enumerator name='c_report_myosharedarenacreate' value='128'/>
      <enumerator name='c_report_myosharedalignedarenamalloc' value='129'/>
      <enumerator name='c_report_myosharedalignedarenafree' value='130'/>
      <enumerator name='c_report_myoarenaacquire' value='131'/>
      <enumerator name='c_report_myoarenarelease' value='132'/>
      <enumerator name='c_coipipe_max_number' value='133'/>
      <enumerator name='c_in_with_preallocated' value='134'/>
      <enumerator name='c_report_no_host_exe' value='135'/>
      <enumerator name='c_report_path_buff_overflow' value='136'/>
      <enumerator name='c_create_pipeline_for_stream' value='137'/>
      <enumerator name='c_offload_no_stream' value='138'/>
      <enumerator name='c_get_engine_info' value='139'/>
      <enumerator name='c_clear_cpu_mask' value='140'/>
      <enumerator name='c_set_cpu_mask' value='141'/>
      <enumerator name='c_report_state_stream' value='142'/>
      <enumerator name='c_report_stream' value='143'/>
      <enumerator name='c_unload_library' value='144'/>
    </enum-decl>
    <typedef-decl name='error_types' type-id='00e6d0b0' filepath='../../../gcc/liboffloadmic/runtime/liboffload_error_codes.h' line='184' column='1' id='c9cdbfbc'/>
    <enum-decl name='TARGET_TYPE' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='61' column='1' id='25847d92'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='TARGET_NONE' value='0'/>
      <enumerator name='TARGET_HOST' value='1'/>
      <enumerator name='TARGET_MIC' value='2'/>
    </enum-decl>
    <typedef-decl name='TARGET_TYPE' type-id='25847d92' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='65' column='1' id='aceb63be'/>
    <enum-decl name='_Offload_result' naming-typedef-id='4345f96a' linkage-name='15_Offload_result' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='80' column='1' id='2f565896'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='OFFLOAD_SUCCESS' value='0'/>
      <enumerator name='OFFLOAD_DISABLED' value='1'/>
      <enumerator name='OFFLOAD_UNAVAILABLE' value='2'/>
      <enumerator name='OFFLOAD_OUT_OF_MEMORY' value='3'/>
      <enumerator name='OFFLOAD_PROCESS_DIED' value='4'/>
      <enumerator name='OFFLOAD_ERROR' value='5'/>
    </enum-decl>
    <typedef-decl name='_Offload_result' type-id='2f565896' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='87' column='1' id='4345f96a'/>
    <class-decl name='_Offload_status' size-in-bits='192' is-struct='yes' naming-typedef-id='bb1b04b5' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='89' column='1' id='d29cadee'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='result' type-id='4345f96a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_number' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data_sent' type-id='b59d7dce' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_received' type-id='b59d7dce' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Offload_status' type-id='d29cadee' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='94' column='1' id='bb1b04b5'/>
    <typedef-decl name='_Offload_stream' type-id='9c313c2d' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='96' column='1' id='39f5b78b'/>
    <union-decl name='OffloadFlags' size-in-bits='32' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='160' column='1' id='f0445b64'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='162' column='1' id='e7f43f73'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='fortran_traceback' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='163' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='1'>
            <var-decl name='omp_async' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='161' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f73' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='165' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='varDescFlags' size-in-bits='32' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='217' column='1' id='f64ec3bb'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='218' column='1' id='e7f43f74'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='is_static' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='220' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='1'>
            <var-decl name='is_static_dstn' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='222' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2'>
            <var-decl name='has_length' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='224' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='3'>
            <var-decl name='is_stack_buf' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='226' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='4'>
            <var-decl name='targetptr' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='228' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='5'>
            <var-decl name='preallocated' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='230' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='6'>
            <var-decl name='is_pointer' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='232' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='7'>
            <var-decl name='sink_addr' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='8'>
            <var-decl name='alloc_disp' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='237' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='9'>
            <var-decl name='is_noncont_src' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='239' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='10'>
            <var-decl name='is_noncont_dst' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='241' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='11'>
            <var-decl name='always_copy' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='244' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='12'>
            <var-decl name='always_delete' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='246' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='13'>
            <var-decl name='pin' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='248' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='250' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='VarDesc' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='254' column='1' id='3f6b24d7'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='256' column='1' id='ac5ab595'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='257' column='1' id='e7f43f75'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='dst' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='258' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='4'>
                <var-decl name='src' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='259' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='' type-id='e7f43f75' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='bits' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='261' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__1' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='265' column='1' id='ac5ab596'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='266' column='1' id='e7f43f76'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='in' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='267' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='1'>
                <var-decl name='out' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='268' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='' type-id='e7f43f76' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='bits' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='270' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='287' column='1' id='ac5ab597'>
          <data-member access='public'>
            <var-decl name='count' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='291' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='disp' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='293' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='298' column='1' id='ac5ab598'>
          <data-member access='public'>
            <var-decl name='alloc' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='299' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='ptr_arr_offset' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='300' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='ac5ab595' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='direction' type-id='ac5ab596' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='alloc_if' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='free_if' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='align' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mic_offset' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='f64ec3bb' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='into' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ptr' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='314' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='VarDesc2' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='318' column='1' id='baab147f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sname' type-id='80f4b756' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dname' type-id='80f4b756' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='320' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FunctionDescriptor' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='467' column='1' id='e40da81c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='in_datalen' type-id='1eb56b1e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='out_datalen' type-id='1eb56b1e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='console_enabled' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='timer_enabled' type-id='b96825af' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='offload_report_level' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offload_number' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='vars_num' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_offset' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data' type-id='e84913bd' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='495' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='OFFLOAD' type-id='66b23e57' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='500' column='1' id='86e9fe0d'/>
    <class-decl name='MemRange' size-in-bits='128' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='46' column='1' id='6383a3e3'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_start' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='76' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_length' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='77' column='1'/>
      </data-member>
      <member-function access='private' const='yes'>
        <function-decl name='overlaps' mangled-name='_ZNK8MemRange8overlapsERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange8overlapsERKS_'>
          <parameter type-id='f35acd10' is-artificial='yes'/>
          <parameter type-id='ff5adff4'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='end' mangled-name='_ZNK8MemRange3endEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange3endEv'>
          <parameter type-id='f35acd10' is-artificial='yes'/>
          <return type-id='eaa32e2f'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='start' mangled-name='_ZNK8MemRange5startEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange5startEv'>
          <parameter type-id='f35acd10' is-artificial='yes'/>
          <return type-id='eaa32e2f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='718a6773' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8MemRangeC2EPKvm'>
          <parameter type-id='718a6773' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='contains' mangled-name='_ZNK8MemRange8containsERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange8containsERKS_'>
          <parameter type-id='f35acd10' is-artificial='yes'/>
          <parameter type-id='ff5adff4'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='length' mangled-name='_ZNK8MemRange6lengthEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange6lengthEv'>
          <parameter type-id='f35acd10' is-artificial='yes'/>
          <return type-id='9c313c2d'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8MemRangeC2EPKvm'>
          <parameter type-id='718a6773' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PtrData' size-in-bits='832' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='81' column='1' id='5f55c5d1'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='cpu_addr' type-id='bc32689a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='cpu_buf' type-id='96c561e3' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='mic_buf' type-id='96c561e3' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='mic_addr' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='alloc_disp' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='mic_offset' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='416'>
        <var-decl name='is_static' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='alloc_ptr_data_lock' type-id='23be0237' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='ref_count' type-id='bd54fe1a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='158' column='1'/>
      </data-member>
      <member-function access='private' const='yes'>
        <function-decl name='operator&lt;' mangled-name='_ZNK7PtrDataltERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK7PtrDataltERKS_'>
          <parameter type-id='05ad5d44' is-artificial='yes'/>
          <parameter type-id='f9ad4a60'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC4ERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='8967de09' is-artificial='yes'/>
          <parameter type-id='f9ad4a60'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2ERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC2ERKS_'>
          <parameter type-id='8967de09' is-artificial='yes'/>
          <parameter type-id='f9ad4a60'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='8967de09' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC2EPKvm'>
          <parameter type-id='8967de09' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='get_reference' mangled-name='_ZNK7PtrData13get_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK7PtrData13get_referenceEv'>
          <parameter type-id='05ad5d44' is-artificial='yes'/>
          <return type-id='bd54fe1a'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_reference' mangled-name='_ZN7PtrData16remove_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrData16remove_referenceEv'>
          <parameter type-id='8967de09' is-artificial='yes'/>
          <return type-id='bd54fe1a'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_reference' mangled-name='_ZN7PtrData13add_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrData13add_referenceEv'>
          <parameter type-id='8967de09' is-artificial='yes'/>
          <return type-id='bd54fe1a'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2ERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC2ERKS_'>
          <parameter type-id='8967de09' is-artificial='yes'/>
          <parameter type-id='f9ad4a60'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC2EPKvm'>
          <parameter type-id='8967de09' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='PtrDataList' type-id='f25f4ef3' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='161' column='1' id='98c83082'/>
    <class-decl name='PtrDataTable' size-in-bits='704' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='163' column='1' id='66ea038b'>
      <member-type access='private'>
        <typedef-decl name='PtrSet' type-id='944498cc' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='165' column='1' id='cfb16958'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='list' type-id='cfb16958' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_ptr_lock' type-id='23be0237' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='204' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='insert_ptr_data' mangled-name='_ZN12PtrDataTable15insert_ptr_dataEPKvmRb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12PtrDataTable15insert_ptr_dataEPKvmRb'>
          <parameter type-id='a5c11e9b' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='dce6b981'/>
          <return type-id='8967de09'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_ptr_data' mangled-name='_ZN12PtrDataTable15remove_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12PtrDataTable15remove_ptr_dataEPKv'>
          <parameter type-id='a5c11e9b' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='find_ptr_data' mangled-name='_ZN12PtrDataTable13find_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12PtrDataTable13find_ptr_dataEPKv'>
          <parameter type-id='a5c11e9b' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='8967de09'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AutoData' size-in-bits='192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='208' column='1' id='b3d378ee'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='cpu_addr' type-id='bc32689a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='ref_count' type-id='bd54fe1a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='255' column='1'/>
      </data-member>
      <member-function access='private' const='yes'>
        <function-decl name='get_reference' mangled-name='_ZNK8AutoData13get_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8AutoData13get_referenceEv'>
          <parameter type-id='6bfcdf1b' is-artificial='yes'/>
          <return type-id='bd54fe1a'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nullify_reference' mangled-name='_ZN8AutoData17nullify_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData17nullify_referenceEv'>
          <parameter type-id='dcb4f314' is-artificial='yes'/>
          <return type-id='bd54fe1a'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_reference' mangled-name='_ZN8AutoData16remove_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData16remove_referenceEv'>
          <parameter type-id='dcb4f314' is-artificial='yes'/>
          <return type-id='bd54fe1a'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_reference' mangled-name='_ZN8AutoData13add_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData13add_referenceEv'>
          <parameter type-id='dcb4f314' is-artificial='yes'/>
          <return type-id='bd54fe1a'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='operator&lt;' mangled-name='_ZNK8AutoDataltERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8AutoDataltERKS_'>
          <parameter type-id='6bfcdf1b' is-artificial='yes'/>
          <parameter type-id='67fcd8cf'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='AutoData' mangled-name='_ZN8AutoDataC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='dcb4f314' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='AutoData' mangled-name='_ZN8AutoDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoDataC2EPKvm'>
          <parameter type-id='dcb4f314' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='AutoSet' type-id='058b4023' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='259' column='1' id='a3c53da9'/>
    <class-decl name='TargetImage' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='262' column='1' id='c2e5e0cd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='origin' type-id='80f4b756' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='279' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='TargetImage' mangled-name='_ZN11TargetImageC4EPKcPKvmS1_m' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d3471dad' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='TargetImage' mangled-name='_ZN11TargetImageC2EPKcPKvmS1_m' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11TargetImageC2EPKcPKvmS1_m'>
          <parameter type-id='d3471dad' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='TargetImageList' type-id='e4634a23' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='282' column='1' id='ea212d06'/>
    <class-decl name='DynLib' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='285' column='1' id='ef061f07'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lib' type-id='6ecc5b18' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='297' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='DynLib' mangled-name='_ZN6DynLibC4EPKcPKvP10coilibrary' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5ff777cf' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='6ecc5b18'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='DynLib' mangled-name='_ZN6DynLibC2EPKcPKvP10coilibrary' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6DynLibC2EPKcPKvP10coilibrary'>
          <parameter type-id='5ff777cf' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='6ecc5b18'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='DynLibList' type-id='e4c0d167' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='299' column='1' id='ffc6790a'/>
    <class-decl name='PersistData' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='302' column='1' id='5ba9ee93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stack_cpu_addr' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='routine_id' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='thread_id' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stack_ptr_data' type-id='8967de09' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cpu_stack_addr' type-id='26a90f95' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='320' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='PersistData' mangled-name='_ZN11PersistDataC4EPKvmmm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='b996b313' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='PersistData' mangled-name='_ZN11PersistDataC2EPKvmmm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11PersistDataC2EPKvmmm'>
          <parameter type-id='b996b313' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='PersistDataList' type-id='ba760a37' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='323' column='1' id='291624b4'/>
    <class-decl name='Stream' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='326' column='1' id='54d739dd'>
      <member-type access='public'>
        <typedef-decl name='StreamMap' type-id='559b5d54' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='371' column='1' id='907ca266'/>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='m_streams_count' type-id='9c313c2d' mangled-name='_ZN6Stream15m_streams_countE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='373' column='1' elf-symbol-id='_ZN6Stream15m_streams_countE'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='all_streams' type-id='907ca266' mangled-name='_ZN6Stream11all_streamsE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='374' column='1' elf-symbol-id='_ZN6Stream11all_streamsE'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='m_stream_lock' type-id='23be0237' mangled-name='_ZN6Stream13m_stream_lockE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='375' column='1' elf-symbol-id='_ZN6Stream13m_stream_lockE'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_device' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_number_of_cpus' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_pipeline' type-id='d4fe1d0b' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_last_offload' type-id='66b23e57' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_stream_cpus' type-id='072a65bb' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='389' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='get_device' mangled-name='_ZN6Stream10get_deviceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream10get_deviceEv'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='find_stream' mangled-name='_ZN6Stream11find_streamEmb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream11find_streamEmb'>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='c894953d'/>
          <return type-id='3c12b87d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_pipeline' mangled-name='_ZN6Stream12set_pipelineEP11coipipeline' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream12set_pipelineEP11coipipeline'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <parameter type-id='d4fe1d0b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_cpu_number' mangled-name='_ZN6Stream14get_cpu_numberEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream14get_cpu_numberEv'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_pipeline' mangled-name='_ZN6Stream12get_pipelineEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream12get_pipelineEv'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <return type-id='d4fe1d0b'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Stream' mangled-name='_ZN6StreamD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Stream' mangled-name='_ZN6StreamD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6StreamD2Ev'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='add_stream' mangled-name='_ZN6Stream10add_streamEii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream10add_streamEii'>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='39f5b78b'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_last_offload' mangled-name='_ZN6Stream16set_last_offloadEP17OffloadDescriptor' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream16set_last_offloadEP17OffloadDescriptor'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <parameter type-id='66b23e57'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_last_offload' mangled-name='_ZN6Stream16get_last_offloadEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream16get_last_offloadEv'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <return type-id='66b23e57'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Stream' mangled-name='_ZN6StreamD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6StreamD2Ev'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Stream' mangled-name='_ZN6StreamC4Eii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Stream' mangled-name='_ZN6StreamC2Eii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6StreamC2Eii'>
          <parameter type-id='3c12b87d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='StreamMap' type-id='559b5d54' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='392' column='1' id='513e1fda'/>
    <class-decl name='Engine' size-in-bits='5504' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='395' column='1' id='c2a282d3'>
      <member-type access='private'>
        <typedef-decl name='SignalMap' type-id='d8b17029' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='608' column='1' id='fae90e74'/>
      </member-type>
      <member-type access='private'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='647' column='1' id='08f5ca17'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='c_func_compute' value='0'/>
          <enumerator name='c_func_myo_init' value='1'/>
          <enumerator name='c_func_myo_fini' value='2'/>
          <enumerator name='c_func_init' value='3'/>
          <enumerator name='c_func_var_table_size' value='4'/>
          <enumerator name='c_func_var_table_copy' value='5'/>
          <enumerator name='c_func_set_stream_affinity' value='6'/>
          <enumerator name='c_funcs_total' value='7'/>
        </enum-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_persist_list' type-id='291624b4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='563' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_index' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='611' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='m_physical_index' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='612' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_proc_number' type-id='bd54fe1a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='615' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_process' type-id='0336cae2' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='618' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_ready' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='622' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_lock' type-id='23be0237' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='623' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_images' type-id='ea212d06' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='626' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='m_ptr_set' type-id='66ea038b' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='629' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='m_targetptr_set' type-id='66ea038b' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='630' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2368'>
        <var-decl name='m_signal_map' type-id='fae90e74' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='633' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2752'>
        <var-decl name='m_signal_lock' type-id='23be0237' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='634' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3072'>
        <var-decl name='m_stream_map' type-id='513e1fda' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='637' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3456'>
        <var-decl name='m_stream_lock' type-id='23be0237' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='638' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3776'>
        <var-decl name='m_num_cores' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='639' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3808'>
        <var-decl name='m_num_threads' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='640' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3840'>
        <var-decl name='m_cpus' type-id='072a65bb' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='641' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4864'>
        <var-decl name='m_dyn_libs' type-id='ffc6790a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='644' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='m_func_names' type-id='31d53427' mangled-name='_ZN6Engine12m_func_namesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='659' column='1' elf-symbol-id='_ZN6Engine12m_func_namesE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5056'>
        <var-decl name='m_funcs' type-id='28a98631' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='662' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='c_signal_max' type-id='2448a865' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='665' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='c_signal_names' type-id='610ed245' mangled-name='_ZN6Engine14c_signal_namesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='666' column='1' elf-symbol-id='_ZN6Engine14c_signal_namesE'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='destroy_thread_data' mangled-name='_ZN6Engine19destroy_thread_dataEPv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine19destroy_thread_dataEPv'>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_auto_vars' mangled-name='_ZN6Engine13get_auto_varsEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13get_auto_varsEv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='24bb2658'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_thread_id' mangled-name='_ZN6Engine13get_thread_idEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13get_thread_idEv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='9c313c2d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='stream_destroy' mangled-name='_ZN6Engine14stream_destroyEm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14stream_destroyEm'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='39f5b78b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_pipeline' mangled-name='_ZN6Engine12get_pipelineEm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12get_pipelineEm'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='39f5b78b'/>
          <return type-id='d4fe1d0b'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_pipeline' mangled-name='_ZN6Engine12get_pipelineEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12get_pipelineEv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='d4fe1d0b'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_device' mangled-name='_ZN6Engine11init_deviceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine11init_deviceEv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='587f89d2'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='compute' mangled-name='_ZN6Engine7computeEmRKNSt7__cxx114listIP9coibufferSaIS3_EEEPKvtPvtjPK8coieventPSB_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine7computeEmRKNSt7__cxx114listIP9coibufferSaIS3_EEEPKvtPvtjPK8coieventPSB_'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='39f5b78b'/>
          <parameter type-id='283a754c'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='149c6638'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='149c6638'/>
          <parameter type-id='8f92235e'/>
          <parameter type-id='51b7ad07'/>
          <parameter type-id='3e2f4144'/>
          <return type-id='113a42bc'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_ptr_data' mangled-name='_ZN6Engine13init_ptr_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13init_ptr_dataEv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='unload_library' mangled-name='_ZN6Engine14unload_libraryEPKvPKc' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14unload_libraryEPKvPKc'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='load_libraries' mangled-name='_ZN6Engine14load_librariesEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14load_librariesEv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='fini_process' mangled-name='_ZN6Engine12fini_processEb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12fini_processEb'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='c894953d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_process' mangled-name='_ZN6Engine12init_processEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12init_processEv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN6Engine4initEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine4initEv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='insert_ptr_data' mangled-name='_ZN6Engine15insert_ptr_dataEPKvmRb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine15insert_ptr_dataEPKvmRb'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='dce6b981'/>
          <return type-id='8967de09'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_indexes' mangled-name='_ZN6Engine11set_indexesEii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine11set_indexesEii'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Engine' mangled-name='_ZN6EngineD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Engine' mangled-name='_ZN6EngineD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6EngineD2Ev'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Engine' mangled-name='_ZN6EngineC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Engine' mangled-name='_ZN6EngineC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6EngineC2Ev'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_signal' mangled-name='_ZN6Engine11find_signalEPKvb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine11find_signalEPKvb'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='c894953d'/>
          <return type-id='66b23e57'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_signal' mangled-name='_ZN6Engine10add_signalEPKvP17OffloadDescriptor' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine10add_signalEPKvP17OffloadDescriptor'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='66b23e57'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_auto_data' mangled-name='_ZN6Engine16remove_auto_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine16remove_auto_dataEPKv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='insert_auto_data' mangled-name='_ZN6Engine16insert_auto_dataEPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine16insert_auto_dataEPKvm'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='dcb4f314'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_auto_data' mangled-name='_ZN6Engine14find_auto_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='504' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14find_auto_dataEPKv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='dcb4f314'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_targetptr_data' mangled-name='_ZN6Engine21remove_targetptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine21remove_targetptr_dataEPKv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_ptr_data' mangled-name='_ZN6Engine15remove_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine15remove_ptr_dataEPKv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='insert_targetptr_data' mangled-name='_ZN6Engine21insert_targetptr_dataEPKvmRb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine21insert_targetptr_dataEPKvmRb'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9c313c2d'/>
          <parameter type-id='dce6b981'/>
          <return type-id='8967de09'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_targetptr_data' mangled-name='_ZN6Engine19find_targetptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine19find_targetptr_dataEPKv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='8967de09'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_ptr_data' mangled-name='_ZN6Engine13find_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13find_ptr_dataEPKv'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='8967de09'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_lib' mangled-name='_ZN6Engine7add_libERK11TargetImage' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine7add_libERK11TargetImage'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='b277f014'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_process' mangled-name='_ZNK6Engine11get_processEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK6Engine11get_processEv'>
          <parameter type-id='58ece774' is-artificial='yes'/>
          <return type-id='31719a3c'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_logical_index' mangled-name='_ZNK6Engine17get_logical_indexEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK6Engine17get_logical_indexEv'>
          <parameter type-id='58ece774' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='fini_myo' mangled-name='_ZN6Engine8fini_myoEP8coievent' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine8fini_myoEP8coievent'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='3e2f4144'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init_myo' mangled-name='_ZN6Engine8init_myoEP8coievent' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine8init_myoEP8coievent'>
          <parameter type-id='cad4c0e3' is-artificial='yes'/>
          <parameter type-id='3e2f4144'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_physical_index' mangled-name='_ZNK6Engine18get_physical_indexEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK6Engine18get_physical_indexEv'>
          <parameter type-id='58ece774' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='OffloadDescriptor' size-in-bits='2368' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='68' column='1' id='cdbeaa4f'>
      <member-type access='public'>
        <enum-decl name='OmpAsyncLastEventType' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='71' column='1' id='bc8bef04'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='c_last_not' value='0'/>
          <enumerator name='c_last_write' value='1'/>
          <enumerator name='c_last_read' value='2'/>
          <enumerator name='c_last_runfunc' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='BufferList' type-id='ebcac9bd' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='213' column='1' id='dd95770a'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='VarExtra' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='216' column='1' id='6c040472'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='src_data' type-id='8967de09' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='dst_data' type-id='8967de09' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='218' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='auto_data' type-id='dcb4f314' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='219' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='cpu_disp' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='220' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='cpu_offset' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='221' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='alloc' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='222' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='read_rng_src' type-id='481e1d36' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='223' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='read_rng_dst' type-id='481e1d36' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='224' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='ptr_arr_offset' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='225' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='is_arr_ptr_el' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='226' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='608'>
            <var-decl name='omp_last_event_type' type-id='bc8bef04' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='227' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ReadArrElements&lt;long int&gt;' size-in-bits='512' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='230' column='1' id='7930b594'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='ranges' type-id='481e1d36' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='269' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='val' type-id='bd54fe1a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='270' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='el_size' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='271' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='size' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='272' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='offset' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='273' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='320'>
            <var-decl name='length_cur' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='274' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='384'>
            <var-decl name='is_empty' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='275' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='416'>
            <var-decl name='count' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='276' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='base' type-id='26a90f95' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='277' column='1'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='read_next' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlE9read_nextEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIlE9read_nextEb'>
              <parameter type-id='b4f22c82' is-artificial='yes'/>
              <parameter type-id='c894953d'/>
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlEC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='b4f22c82' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlEC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIlEC2Ev'>
              <parameter type-id='b4f22c82' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ReadArrElements&lt;void*&gt;' size-in-bits='512' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='230' column='1' id='1ba6b6fb'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='ranges' type-id='481e1d36' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='269' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='val' type-id='eaa32e2f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='270' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='el_size' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='271' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='size' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='272' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='offset' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='273' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='320'>
            <var-decl name='length_cur' type-id='9da381c4' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='274' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='384'>
            <var-decl name='is_empty' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='275' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='416'>
            <var-decl name='count' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='276' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='base' type-id='26a90f95' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='277' column='1'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='read_next' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvE9read_nextEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIPvE9read_nextEb'>
              <parameter type-id='fb365c3b' is-artificial='yes'/>
              <parameter type-id='c894953d'/>
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvEC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='fb365c3b' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvEC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIPvEC2Ev'>
              <parameter type-id='fb365c3b' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_stack_ptr_data' type-id='8967de09' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='281' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_destroy_stack' type-id='98c83082' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='282' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_device' type-id='d6d4d3c7' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='285' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_wait_all_devices' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='288' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='328'>
        <var-decl name='m_is_mandatory' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='291' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='336'>
        <var-decl name='m_is_openmp' type-id='4ab96a04' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='294' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_in' type-id='1b4f31b8' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='297' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='m_out' type-id='1b4f31b8' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='300' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='m_compute_buffers' type-id='dd95770a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='303' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_destroy_buffers' type-id='dd95770a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='306' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <var-decl name='m_vars' type-id='fd12dc4f' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='309' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <var-decl name='m_vars_extra' type-id='202ad9b0' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='310' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='m_vars_total' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='311' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_status' type-id='b9b16924' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='314' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='m_func_desc' type-id='d88d911a' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='317' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='m_func_desc_size' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='318' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='m_inout_buf' type-id='96c561e3' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='321' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <var-decl name='m_in_deps' type-id='3e2f4144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='324' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1792'>
        <var-decl name='m_in_deps_total' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1824'>
        <var-decl name='m_in_deps_allocated' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1856'>
        <var-decl name='m_out_deps' type-id='3e2f4144' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='327' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1920'>
        <var-decl name='m_out_deps_total' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='328' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1952'>
        <var-decl name='m_out_deps_allocated' type-id='8f92235e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='329' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1984'>
        <var-decl name='m_stream' type-id='39f5b78b' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2048'>
        <var-decl name='m_timer_data' type-id='bd68d245' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='335' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2112'>
        <var-decl name='m_in_datalen' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2176'>
        <var-decl name='m_out_datalen' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2240'>
        <var-decl name='m_need_runfunction' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='343' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2248'>
        <var-decl name='m_initial_need_runfunction' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='347' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2256'>
        <var-decl name='m_out_with_preallocated' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2264'>
        <var-decl name='m_preallocated_alloc' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2272'>
        <var-decl name='m_traceback_called' type-id='c894953d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='360' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <var-decl name='m_omp_async_last_event_type' type-id='bc8bef04' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='362' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='get_stream' mangled-name='_ZN17OffloadDescriptor10get_streamEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor10get_streamEv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <return type-id='39f5b78b'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_stream' mangled-name='_ZN17OffloadDescriptor10set_streamEm' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor10set_streamEm'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='39f5b78b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorD2Ev'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorC4EiP15_Offload_statusbbP20OffloadHostTimerData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='b9b16924'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='bd68d245'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorC2EiP15_Offload_statusbbP20OffloadHostTimerData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorC2EiP15_Offload_statusbbP20OffloadHostTimerData'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='b9b16924'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='bd68d245'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_stream_in_dependencies' mangled-name='_ZN17OffloadDescriptor26get_stream_in_dependenciesERjRP8coievent' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor26get_stream_in_dependenciesERjRP8coievent'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='84420273'/>
          <parameter type-id='4663ed46'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='gen_var_descs_for_pointer_array' mangled-name='_ZN17OffloadDescriptor31gen_var_descs_for_pointer_arrayEi' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor31gen_var_descs_for_pointer_arrayEi'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='scatter_copyout_data' mangled-name='_ZN17OffloadDescriptor20scatter_copyout_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20scatter_copyout_dataEv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='receive_pointer_data' mangled-name='_ZN17OffloadDescriptor20receive_pointer_dataEbbPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20receive_pointer_dataEbbPv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='receive_noncontiguous_pointer_data' mangled-name='_ZN17OffloadDescriptor34receive_noncontiguous_pointer_dataEiP9coibufferP8coieventRmjS3_' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor34receive_noncontiguous_pointer_dataEiP9coibufferP8coieventRmjS3_'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='96c561e3'/>
          <parameter type-id='3e2f4144'/>
          <parameter type-id='59647362'/>
          <parameter type-id='8f92235e'/>
          <parameter type-id='3e2f4144'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='compute' mangled-name='_ZN17OffloadDescriptor7computeEPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor7computeEPv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='gather_copyin_data' mangled-name='_ZN17OffloadDescriptor18gather_copyin_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor18gather_copyin_dataEv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='send_pointer_data' mangled-name='_ZN17OffloadDescriptor17send_pointer_dataEbPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor17send_pointer_dataEbPv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='send_noncontiguous_pointer_data' mangled-name='_ZN17OffloadDescriptor31send_noncontiguous_pointer_dataEiP7PtrDataS1_P8coieventRmjS3_' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor31send_noncontiguous_pointer_dataEiP7PtrDataS1_P8coieventRmjS3_'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='8967de09'/>
          <parameter type-id='8967de09'/>
          <parameter type-id='3e2f4144'/>
          <parameter type-id='59647362'/>
          <parameter type-id='8f92235e'/>
          <parameter type-id='3e2f4144'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='is_signaled' mangled-name='_ZN17OffloadDescriptor11is_signaledEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor11is_signaledEv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='cleanup' mangled-name='_ZN17OffloadDescriptor7cleanupEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor7cleanupEv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='offload_finish' mangled-name='_ZN17OffloadDescriptor14offload_finishEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor14offload_finishEb'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='c894953d'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='offload' mangled-name='_ZN17OffloadDescriptor7offloadEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor7offloadEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='fd12dc4f'/>
          <parameter type-id='699cd427'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='63e171df'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='63e171df'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='f0445b64'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='offload_wrap' mangled-name='_ZN17OffloadDescriptor12offload_wrapEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor12offload_wrapEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='fd12dc4f'/>
          <parameter type-id='699cd427'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='63e171df'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='63e171df'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='f0445b64'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='wait_dependencies' mangled-name='_ZN17OffloadDescriptor17wait_dependenciesEPPKvim' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor17wait_dependenciesEPPKvim'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='63e171df'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='39f5b78b'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='register_omp_event_call_back' mangled-name='_ZN17OffloadDescriptor28register_omp_event_call_backEPK8coieventPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor28register_omp_event_call_backEPK8coieventPKv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='51b7ad07'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setup_omp_async_info' mangled-name='_ZN17OffloadDescriptor20setup_omp_async_infoEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20setup_omp_async_infoEv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setup_misc_data' mangled-name='_ZN17OffloadDescriptor15setup_misc_dataEPKc' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15setup_misc_dataEPKc'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setup_descriptors' mangled-name='_ZN17OffloadDescriptor17setup_descriptorsEP7VarDescP8VarDesc2iiPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor17setup_descriptorsEP7VarDescP8VarDesc2iiPKv'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='fd12dc4f'/>
          <parameter type-id='699cd427'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='offload_stack_memory_manager' mangled-name='_ZN17OffloadDescriptor28offload_stack_memory_managerEPKviiiPb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor28offload_stack_memory_managerEPKviiiPb'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='d8e6b335'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nullify_target_stack' mangled-name='_ZN17OffloadDescriptor20nullify_target_stackEP9coibufferm' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20nullify_target_stackEP9coibufferm'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='96c561e3'/>
          <parameter type-id='9c313c2d'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_mic_address' mangled-name='_ZN17OffloadDescriptor16init_mic_addressEP7PtrData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor16init_mic_addressEP7PtrData'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='8967de09'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_static_ptr_data' mangled-name='_ZN17OffloadDescriptor20init_static_ptr_dataEP7PtrData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20init_static_ptr_dataEP7PtrData'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='8967de09'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='find_ptr_data' mangled-name='_ZN17OffloadDescriptor13find_ptr_dataERP7PtrDataPvllbb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor13find_ptr_dataERP7PtrDataPvllbb'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='7d82c3fd'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9da381c4'/>
          <parameter type-id='9da381c4'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='c894953d'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='alloc_ptr_data' mangled-name='_ZN17OffloadDescriptor14alloc_ptr_dataERP7PtrDataPvlllibbb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor14alloc_ptr_dataERP7PtrDataPvlllibbb'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='7d82c3fd'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='9da381c4'/>
          <parameter type-id='9da381c4'/>
          <parameter type-id='9da381c4'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='c894953d'/>
          <parameter type-id='c894953d'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='translate_coi_error' mangled-name='_ZNK17OffloadDescriptor19translate_coi_errorE9COIRESULT' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17OffloadDescriptor19translate_coi_errorE9COIRESULT'>
          <parameter type-id='d21ac756' is-artificial='yes'/>
          <parameter type-id='113a42bc'/>
          <return type-id='4345f96a'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='report_coi_error' mangled-name='_ZN17OffloadDescriptor16report_coi_errorE11error_types9COIRESULT' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor16report_coi_errorE11error_types9COIRESULT'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='c9cdbfbc'/>
          <parameter type-id='113a42bc'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_timer_data' mangled-name='_ZNK17OffloadDescriptor14get_timer_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17OffloadDescriptor14get_timer_dataEv'>
          <parameter type-id='d21ac756' is-artificial='yes'/>
          <return type-id='bd68d245'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorD2Ev'>
          <parameter type-id='66b23e57' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='OffloadTargetTimerData' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='43' column='1' id='11c16278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='frequency' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='phases' type-id='fbd51a59' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='OffloadHostTimerData' size-in-bits='4160' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='51' column='1' id='770a2da5'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='57' column='1' id='e7f43f72'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='58' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='total' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='59' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='80f4b756' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='phases' type-id='a028658c' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='sent_bytes' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='received_bytes' type-id='9c313c2d' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='card_number' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='offload_number' type-id='95e97e5e' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='target' type-id='11c16278' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='next' type-id='bd68d245' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pid_t' type-id='95e97e5e' filepath='/usr/include/bits/types.h' line='133' column='1' id='3629bad8'/>
    <typedef-decl name='pid_t' type-id='3629bad8' filepath='/usr/include/unistd.h' line='260' column='1' id='587f89d2'/>
    <pointer-type-def type-id='b57c8818' size-in-bits='64' id='d5d002fe'/>
    <reference-type-def kind='lvalue' type-id='b3d378ee' size-in-bits='64' id='d0b4e030'/>
    <pointer-type-def type-id='b3d378ee' size-in-bits='64' id='dcb4f314'/>
    <reference-type-def kind='lvalue' type-id='a3c53da9' size-in-bits='64' id='24bb2658'/>
    <reference-type-def kind='lvalue' type-id='3e2f4144' size-in-bits='64' id='4663ed46'/>
    <pointer-type-def type-id='b651c6c0' size-in-bits='64' id='481e1d36'/>
    <reference-type-def kind='lvalue' type-id='ef061f07' size-in-bits='64' id='63f77e1b'/>
    <pointer-type-def type-id='ef061f07' size-in-bits='64' id='5ff777cf'/>
    <reference-type-def kind='lvalue' type-id='c2a282d3' size-in-bits='64' id='d6d4d3c7'/>
    <pointer-type-def type-id='c2a282d3' size-in-bits='64' id='cad4c0e3'/>
    <pointer-type-def type-id='e40da81c' size-in-bits='64' id='d88d911a'/>
    <pointer-type-def type-id='6383a3e3' size-in-bits='64' id='718a6773'/>
    <pointer-type-def type-id='cdbeaa4f' size-in-bits='64' id='66b23e57'/>
    <pointer-type-def type-id='6c040472' size-in-bits='64' id='202ad9b0'/>
    <pointer-type-def type-id='770a2da5' size-in-bits='64' id='bd68d245'/>
    <reference-type-def kind='lvalue' type-id='5ba9ee93' size-in-bits='64' id='c596c5f7'/>
    <pointer-type-def type-id='5ba9ee93' size-in-bits='64' id='b996b313'/>
    <reference-type-def kind='lvalue' type-id='5f55c5d1' size-in-bits='64' id='9567f0ed'/>
    <pointer-type-def type-id='5f55c5d1' size-in-bits='64' id='8967de09'/>
    <qualified-type-def type-id='8967de09' const='yes' id='931aa326'/>
    <reference-type-def kind='lvalue' type-id='931aa326' size-in-bits='64' id='92ee9900'/>
    <pointer-type-def type-id='931aa326' size-in-bits='64' id='9eeeabe4'/>
    <reference-type-def kind='lvalue' type-id='8967de09' size-in-bits='64' id='7d82c3fd'/>
    <pointer-type-def type-id='8967de09' size-in-bits='64' id='7182b119'/>
    <pointer-type-def type-id='66ea038b' size-in-bits='64' id='a5c11e9b'/>
    <pointer-type-def type-id='54d739dd' size-in-bits='64' id='3c12b87d'/>
    <reference-type-def kind='lvalue' type-id='c2e5e0cd' size-in-bits='64' id='c7470ac9'/>
    <pointer-type-def type-id='c2e5e0cd' size-in-bits='64' id='d3471dad'/>
    <pointer-type-def type-id='3f6b24d7' size-in-bits='64' id='fd12dc4f'/>
    <pointer-type-def type-id='baab147f' size-in-bits='64' id='699cd427'/>
    <pointer-type-def type-id='bb1b04b5' size-in-bits='64' id='b9b16924'/>
    <pointer-type-def type-id='dd349f19' size-in-bits='64' id='766a7461'/>
    <pointer-type-def type-id='817137be' size-in-bits='64' id='8d358364'/>
    <pointer-type-def type-id='d2b773bc' size-in-bits='64' id='38767c8a'/>
    <pointer-type-def type-id='1d3eaccc' size-in-bits='64' id='77f78bca'/>
    <pointer-type-def type-id='cf28b03e' size-in-bits='64' id='79397ff4'/>
    <pointer-type-def type-id='78c4d382' size-in-bits='64' id='92a2ead0'/>
    <pointer-type-def type-id='8e3d69c1' size-in-bits='64' id='76ff6c09'/>
    <pointer-type-def type-id='35a7114c' size-in-bits='64' id='81ba408a'/>
    <pointer-type-def type-id='43510e02' size-in-bits='64' id='a2858340'/>
    <pointer-type-def type-id='b770f381' size-in-bits='64' id='38766b99'/>
    <reference-type-def kind='lvalue' type-id='6689c5c5' size-in-bits='64' id='4e85235e'/>
    <reference-type-def kind='lvalue' type-id='483618e1' size-in-bits='64' id='82015538'/>
    <reference-type-def kind='lvalue' type-id='847d8f1b' size-in-bits='64' id='bda37bd0'/>
    <reference-type-def kind='lvalue' type-id='83f41a97' size-in-bits='64' id='ab171322'/>
    <reference-type-def kind='lvalue' type-id='1d55bb6e' size-in-bits='64' id='fcf5fee3'/>
    <pointer-type-def type-id='01668b4e' size-in-bits='64' id='e4297214'/>
    <pointer-type-def type-id='3239da4d' size-in-bits='64' id='22cc277d'/>
    <pointer-type-def type-id='b3c054a9' size-in-bits='64' id='f619e991'/>
    <pointer-type-def type-id='8305bfbf' size-in-bits='64' id='4606ccf7'/>
    <pointer-type-def type-id='32cdc1b7' size-in-bits='64' id='51f5c00f'/>
    <pointer-type-def type-id='0f1bdf4b' size-in-bits='64' id='acec87bb'/>
    <pointer-type-def type-id='88864972' size-in-bits='64' id='e185f890'/>
    <pointer-type-def type-id='6b657558' size-in-bits='64' id='422fee0e'/>
    <pointer-type-def type-id='7a5d406a' size-in-bits='64' id='c20556b8'/>
    <pointer-type-def type-id='362adeaa' size-in-bits='64' id='56149f08'/>
    <pointer-type-def type-id='9606f9bc' size-in-bits='64' id='6d8fd66a'/>
    <pointer-type-def type-id='a28c8c93' size-in-bits='64' id='be956923'/>
    <pointer-type-def type-id='cff7fc9e' size-in-bits='64' id='bf75d744'/>
    <pointer-type-def type-id='66c8b507' size-in-bits='64' id='c36ce43f'/>
    <pointer-type-def type-id='d385ac55' size-in-bits='64' id='2d330e05'/>
    <pointer-type-def type-id='9d620264' size-in-bits='64' id='89486762'/>
    <pointer-type-def type-id='ed1c5a19' size-in-bits='64' id='a76487c1'/>
    <pointer-type-def type-id='49dbf710' size-in-bits='64' id='b9ac8b06'/>
    <reference-type-def kind='lvalue' type-id='c894953d' size-in-bits='64' id='dce6b981'/>
    <pointer-type-def type-id='c894953d' size-in-bits='64' id='d8e6b335'/>
    <qualified-type-def type-id='e2bf2e3a' const='yes' id='55256d05'/>
    <reference-type-def kind='lvalue' type-id='55256d05' size-in-bits='64' id='2ceace19'/>
    <pointer-type-def type-id='55256d05' size-in-bits='64' id='38eae0fd'/>
    <reference-type-def kind='lvalue' type-id='e2bf2e3a' size-in-bits='64' id='0ef59614'/>
    <pointer-type-def type-id='e2bf2e3a' size-in-bits='64' id='02f58330'/>
    <qualified-type-def type-id='b3d378ee' const='yes' id='18d24173'/>
    <reference-type-def kind='lvalue' type-id='18d24173' size-in-bits='64' id='67fcd8cf'/>
    <pointer-type-def type-id='18d24173' size-in-bits='64' id='6bfcdf1b'/>
    <reference-type-def kind='lvalue' type-id='85505272' size-in-bits='64' id='31719a3c'/>
    <qualified-type-def type-id='ef061f07' const='yes' id='e2b1ee0e'/>
    <reference-type-def kind='lvalue' type-id='e2b1ee0e' size-in-bits='64' id='0619e8f8'/>
    <pointer-type-def type-id='e2b1ee0e' size-in-bits='64' id='0219e2ac'/>
    <qualified-type-def type-id='c2a282d3' const='yes' id='d39af316'/>
    <pointer-type-def type-id='d39af316' size-in-bits='64' id='58ece774'/>
    <qualified-type-def type-id='6383a3e3' const='yes' id='bc32689a'/>
    <reference-type-def kind='lvalue' type-id='bc32689a' size-in-bits='64' id='ff5adff4'/>
    <pointer-type-def type-id='bc32689a' size-in-bits='64' id='f35acd10'/>
    <qualified-type-def type-id='cdbeaa4f' const='yes' id='99918938'/>
    <pointer-type-def type-id='99918938' size-in-bits='64' id='d21ac756'/>
    <qualified-type-def type-id='5ba9ee93' const='yes' id='42e458dc'/>
    <reference-type-def kind='lvalue' type-id='42e458dc' size-in-bits='64' id='4778118e'/>
    <pointer-type-def type-id='42e458dc' size-in-bits='64' id='43780b42'/>
    <qualified-type-def type-id='5f55c5d1' const='yes' id='662d8806'/>
    <reference-type-def kind='lvalue' type-id='662d8806' size-in-bits='64' id='f9ad4a60'/>
    <pointer-type-def type-id='662d8806' size-in-bits='64' id='05ad5d44'/>
    <qualified-type-def type-id='c2e5e0cd' const='yes' id='5a93ac3a'/>
    <reference-type-def kind='lvalue' type-id='5a93ac3a' size-in-bits='64' id='b277f014'/>
    <pointer-type-def type-id='5a93ac3a' size-in-bits='64' id='a677dd30'/>
    <qualified-type-def type-id='dd349f19' const='yes' id='dc11819a'/>
    <pointer-type-def type-id='dc11819a' size-in-bits='64' id='1f8f2810'/>
    <qualified-type-def type-id='817137be' const='yes' id='40ab01e9'/>
    <pointer-type-def type-id='40ab01e9' size-in-bits='64' id='9033c5f9'/>
    <qualified-type-def type-id='d2b773bc' const='yes' id='15e70c55'/>
    <pointer-type-def type-id='15e70c55' size-in-bits='64' id='f9b8abed'/>
    <qualified-type-def type-id='1d3eaccc' const='yes' id='5faf257b'/>
    <pointer-type-def type-id='5faf257b' size-in-bits='64' id='f1b7be83'/>
    <qualified-type-def type-id='cf28b03e' const='yes' id='aef43dcb'/>
    <pointer-type-def type-id='aef43dcb' size-in-bits='64' id='4b7d6933'/>
    <qualified-type-def type-id='78c4d382' const='yes' id='4f9cb96f'/>
    <pointer-type-def type-id='4f9cb96f' size-in-bits='64' id='98b7a79f'/>
    <qualified-type-def type-id='8e3d69c1' const='yes' id='34c3197e'/>
    <pointer-type-def type-id='34c3197e' size-in-bits='64' id='6320df3c'/>
    <qualified-type-def type-id='35a7114c' const='yes' id='6f0bf5ed'/>
    <pointer-type-def type-id='6f0bf5ed' size-in-bits='64' id='96d3e845'/>
    <qualified-type-def type-id='43510e02' const='yes' id='e0a25875'/>
    <pointer-type-def type-id='e0a25875' size-in-bits='64' id='fe911d8d'/>
    <qualified-type-def type-id='b770f381' const='yes' id='efd0c19c'/>
    <pointer-type-def type-id='efd0c19c' size-in-bits='64' id='3ba0f182'/>
    <qualified-type-def type-id='6689c5c5' const='yes' id='5cd3a615'/>
    <reference-type-def kind='lvalue' type-id='5cd3a615' size-in-bits='64' id='542ea249'/>
    <qualified-type-def type-id='483618e1' const='yes' id='c2bde171'/>
    <reference-type-def kind='lvalue' type-id='c2bde171' size-in-bits='64' id='e7e9bbf5'/>
    <qualified-type-def type-id='847d8f1b' const='yes' id='774f154b'/>
    <reference-type-def kind='lvalue' type-id='774f154b' size-in-bits='64' id='3e7eba97'/>
    <qualified-type-def type-id='83f41a97' const='yes' id='ef7f9207'/>
    <reference-type-def kind='lvalue' type-id='ef7f9207' size-in-bits='64' id='26d309f3'/>
    <qualified-type-def type-id='1d55bb6e' const='yes' id='3a62259e'/>
    <reference-type-def kind='lvalue' type-id='3a62259e' size-in-bits='64' id='a08160a8'/>
    <qualified-type-def type-id='01668b4e' const='yes' id='c495364b'/>
    <reference-type-def kind='lvalue' type-id='c495364b' size-in-bits='64' id='e3e4ad97'/>
    <pointer-type-def type-id='c495364b' size-in-bits='64' id='d7e49ab3'/>
    <qualified-type-def type-id='3239da4d' const='yes' id='ae785fb4'/>
    <reference-type-def kind='lvalue' type-id='ae785fb4' size-in-bits='64' id='397e72d6'/>
    <pointer-type-def type-id='ae785fb4' size-in-bits='64' id='457e85ba'/>
    <qualified-type-def type-id='b3c054a9' const='yes' id='e65a02ba'/>
    <reference-type-def kind='lvalue' type-id='e65a02ba' size-in-bits='64' id='3bb21b94'/>
    <pointer-type-def type-id='e65a02ba' size-in-bits='64' id='2fb208b0'/>
    <qualified-type-def type-id='8305bfbf' const='yes' id='2d6fcf22'/>
    <reference-type-def kind='lvalue' type-id='2d6fcf22' size-in-bits='64' id='8b02e34c'/>
    <pointer-type-def type-id='2d6fcf22' size-in-bits='64' id='8f02e998'/>
    <qualified-type-def type-id='32cdc1b7' const='yes' id='6c6f5ec4'/>
    <reference-type-def kind='lvalue' type-id='6c6f5ec4' size-in-bits='64' id='95525dc6'/>
    <pointer-type-def type-id='6c6f5ec4' size-in-bits='64' id='a15270aa'/>
    <qualified-type-def type-id='0f1bdf4b' const='yes' id='cf558678'/>
    <reference-type-def kind='lvalue' type-id='cf558678' size-in-bits='64' id='c1a285fa'/>
    <pointer-type-def type-id='cf558678' size-in-bits='64' id='b5a27316'/>
    <qualified-type-def type-id='88864972' const='yes' id='6abd99d3'/>
    <reference-type-def kind='lvalue' type-id='6abd99d3' size-in-bits='64' id='fd795caf'/>
    <pointer-type-def type-id='6abd99d3' size-in-bits='64' id='017962fb'/>
    <qualified-type-def type-id='6b657558' const='yes' id='9262cf55'/>
    <reference-type-def kind='lvalue' type-id='9262cf55' size-in-bits='64' id='e48c9209'/>
    <pointer-type-def type-id='9262cf55' size-in-bits='64' id='f08ca4ed'/>
    <qualified-type-def type-id='7a5d406a' const='yes' id='d59e3939'/>
    <reference-type-def kind='lvalue' type-id='d59e3939' size-in-bits='64' id='6713ebcd'/>
    <pointer-type-def type-id='d59e3939' size-in-bits='64' id='5b13d8e9'/>
    <qualified-type-def type-id='362adeaa' const='yes' id='e253fe43'/>
    <reference-type-def kind='lvalue' type-id='e253fe43' size-in-bits='64' id='af3978ff'/>
    <pointer-type-def type-id='e253fe43' size-in-bits='64' id='b3397f4b'/>
    <qualified-type-def type-id='9606f9bc' const='yes' id='16317407'/>
    <reference-type-def kind='lvalue' type-id='16317407' size-in-bits='64' id='10d9cff3'/>
    <pointer-type-def type-id='16317407' size-in-bits='64' id='1cd9e2d7'/>
    <qualified-type-def type-id='a28c8c93' const='yes' id='62ae028e'/>
    <reference-type-def kind='lvalue' type-id='62ae028e' size-in-bits='64' id='ffee2e78'/>
    <pointer-type-def type-id='62ae028e' size-in-bits='64' id='fbee282c'/>
    <qualified-type-def type-id='cff7fc9e' const='yes' id='5b852bd5'/>
    <reference-type-def kind='lvalue' type-id='5b852bd5' size-in-bits='64' id='05a42f89'/>
    <pointer-type-def type-id='5b852bd5' size-in-bits='64' id='11a4426d'/>
    <qualified-type-def type-id='66c8b507' const='yes' id='0f6ebd8e'/>
    <reference-type-def kind='lvalue' type-id='0f6ebd8e' size-in-bits='64' id='f3548f78'/>
    <pointer-type-def type-id='0f6ebd8e' size-in-bits='64' id='ef54892c'/>
    <qualified-type-def type-id='d385ac55' const='yes' id='fec33db2'/>
    <reference-type-def kind='lvalue' type-id='fec33db2' size-in-bits='64' id='a159effc'/>
    <pointer-type-def type-id='fec33db2' size-in-bits='64' id='a559f648'/>
    <qualified-type-def type-id='9d620264' const='yes' id='5fafdca5'/>
    <reference-type-def kind='lvalue' type-id='5fafdca5' size-in-bits='64' id='24d82239'/>
    <pointer-type-def type-id='5fafdca5' size-in-bits='64' id='30d8351d'/>
    <qualified-type-def type-id='ed1c5a19' const='yes' id='761a9950'/>
    <reference-type-def kind='lvalue' type-id='761a9950' size-in-bits='64' id='61df94c2'/>
    <pointer-type-def type-id='761a9950' size-in-bits='64' id='65df9b0e'/>
    <qualified-type-def type-id='49dbf710' const='yes' id='7eff2a0b'/>
    <reference-type-def kind='lvalue' type-id='7eff2a0b' size-in-bits='64' id='18af64d7'/>
    <pointer-type-def type-id='7eff2a0b' size-in-bits='64' id='0caf51f3'/>
    <pointer-type-def type-id='2448a865' size-in-bits='64' id='6d60f45d'/>
    <qualified-type-def type-id='ab1af04a' const='yes' id='12760a05'/>
    <reference-type-def kind='lvalue' type-id='12760a05' size-in-bits='64' id='32d1f519'/>
    <pointer-type-def type-id='12760a05' size-in-bits='64' id='3ed207fd'/>
    <qualified-type-def type-id='e2ea29ba' const='yes' id='1f9826ca'/>
    <pointer-type-def type-id='1f9826ca' size-in-bits='64' id='9c8532a0'/>
    <qualified-type-def type-id='1aff39ce' const='yes' id='068977af'/>
    <pointer-type-def type-id='068977af' size-in-bits='64' id='cf67265f'/>
    <qualified-type-def type-id='0e6df23a' const='yes' id='77cba28a'/>
    <reference-type-def kind='lvalue' type-id='77cba28a' size-in-bits='64' id='419114c4'/>
    <qualified-type-def type-id='601112f0' const='yes' id='ba1dc5e7'/>
    <reference-type-def kind='lvalue' type-id='ba1dc5e7' size-in-bits='64' id='bdde4ed3'/>
    <pointer-type-def type-id='ba1dc5e7' size-in-bits='64' id='c9de61b7'/>
    <qualified-type-def type-id='f4910e26' const='yes' id='fa744ca3'/>
    <reference-type-def kind='lvalue' type-id='fa744ca3' size-in-bits='64' id='ca14755f'/>
    <pointer-type-def type-id='fa744ca3' size-in-bits='64' id='ce147bab'/>
    <qualified-type-def type-id='d006b1ee' const='yes' id='34cb7319'/>
    <reference-type-def kind='lvalue' type-id='34cb7319' size-in-bits='64' id='5b466c2d'/>
    <pointer-type-def type-id='34cb7319' size-in-bits='64' id='4f465949'/>
    <qualified-type-def type-id='2dfd06ac' const='yes' id='bb80e02d'/>
    <reference-type-def kind='lvalue' type-id='bb80e02d' size-in-bits='64' id='36e0b151'/>
    <pointer-type-def type-id='bb80e02d' size-in-bits='64' id='32e0ab05'/>
    <qualified-type-def type-id='fa10109f' const='yes' id='ec27f9b0'/>
    <reference-type-def kind='lvalue' type-id='ec27f9b0' size-in-bits='64' id='58ede722'/>
    <pointer-type-def type-id='ec27f9b0' size-in-bits='64' id='5ceded6e'/>
    <qualified-type-def type-id='7e04d7d2' const='yes' id='2d0e8777'/>
    <pointer-type-def type-id='2d0e8777' size-in-bits='64' id='4adf1767'/>
    <qualified-type-def type-id='0c05c1dd' const='yes' id='b58610a2'/>
    <reference-type-def kind='lvalue' type-id='b58610a2' size-in-bits='64' id='460bffcc'/>
    <pointer-type-def type-id='b58610a2' size-in-bits='64' id='4a0c0618'/>
    <qualified-type-def type-id='c25f07c1' const='yes' id='aaf60391'/>
    <reference-type-def kind='lvalue' type-id='aaf60391' size-in-bits='64' id='d847d915'/>
    <qualified-type-def type-id='1c60d458' const='yes' id='e40f4708'/>
    <reference-type-def kind='lvalue' type-id='e40f4708' size-in-bits='64' id='320d0d6a'/>
    <qualified-type-def type-id='389bf496' const='yes' id='91309de6'/>
    <reference-type-def kind='lvalue' type-id='91309de6' size-in-bits='64' id='4f885540'/>
    <qualified-type-def type-id='7452fd00' const='yes' id='4b1e87b0'/>
    <reference-type-def kind='lvalue' type-id='4b1e87b0' size-in-bits='64' id='d70f7122'/>
    <qualified-type-def type-id='1bcd6548' const='yes' id='f8c27979'/>
    <reference-type-def kind='lvalue' type-id='f8c27979' size-in-bits='64' id='f925108d'/>
    <pointer-type-def type-id='f8c27979' size-in-bits='64' id='ed24fda9'/>
    <qualified-type-def type-id='4306cd8c' const='yes' id='2a57eb1c'/>
    <reference-type-def kind='lvalue' type-id='2a57eb1c' size-in-bits='64' id='e2674c4e'/>
    <qualified-type-def type-id='cbe77963' const='yes' id='bd640e13'/>
    <reference-type-def kind='lvalue' type-id='bd640e13' size-in-bits='64' id='59825d6f'/>
    <qualified-type-def type-id='46193ee5' const='yes' id='79ba9735'/>
    <reference-type-def kind='lvalue' type-id='79ba9735' size-in-bits='64' id='b3bbd2e9'/>
    <qualified-type-def type-id='b5f8e313' const='yes' id='85cfe203'/>
    <reference-type-def kind='lvalue' type-id='85cfe203' size-in-bits='64' id='cb41003f'/>
    <qualified-type-def type-id='5bf9f966' const='yes' id='bd8cb111'/>
    <reference-type-def kind='lvalue' type-id='bd8cb111' size-in-bits='64' id='9b7af995'/>
    <pointer-type-def type-id='bd8cb111' size-in-bits='64' id='9f7affe1'/>
    <qualified-type-def type-id='c434c394' const='yes' id='39be9ac4'/>
    <reference-type-def kind='lvalue' type-id='39be9ac4' size-in-bits='64' id='c90dd1c6'/>
    <qualified-type-def type-id='628d83db' const='yes' id='56408a6b'/>
    <reference-type-def kind='lvalue' type-id='56408a6b' size-in-bits='64' id='1499b737'/>
    <qualified-type-def type-id='1404285d' const='yes' id='0d24da8d'/>
    <reference-type-def kind='lvalue' type-id='0d24da8d' size-in-bits='64' id='5c043b31'/>
    <qualified-type-def type-id='363e3adb' const='yes' id='3d84686b'/>
    <reference-type-def kind='lvalue' type-id='3d84686b' size-in-bits='64' id='24703137'/>
    <qualified-type-def type-id='21f5ffdb' const='yes' id='54b7fc86'/>
    <reference-type-def kind='lvalue' type-id='54b7fc86' size-in-bits='64' id='fda2afe0'/>
    <pointer-type-def type-id='54b7fc86' size-in-bits='64' id='09a2c2c4'/>
    <qualified-type-def type-id='7bff1605' const='yes' id='e27b4fd5'/>
    <reference-type-def kind='lvalue' type-id='e27b4fd5' size-in-bits='64' id='7b1edb89'/>
    <qualified-type-def type-id='ca09a79c' const='yes' id='29166f0c'/>
    <reference-type-def kind='lvalue' type-id='29166f0c' size-in-bits='64' id='d850ff1e'/>
    <qualified-type-def type-id='19ee4eaa' const='yes' id='c89ee9fa'/>
    <reference-type-def kind='lvalue' type-id='c89ee9fa' size-in-bits='64' id='ae2a2554'/>
    <qualified-type-def type-id='20a6551c' const='yes' id='a74cfa4c'/>
    <reference-type-def kind='lvalue' type-id='a74cfa4c' size-in-bits='64' id='c82e34de'/>
    <qualified-type-def type-id='ca8f5e2c' const='yes' id='9bf05c71'/>
    <pointer-type-def type-id='9bf05c71' size-in-bits='64' id='d6616341'/>
    <qualified-type-def type-id='3dc69e9c' const='yes' id='4b70ddcc'/>
    <reference-type-def kind='lvalue' type-id='4b70ddcc' size-in-bits='64' id='acad575e'/>
    <qualified-type-def type-id='3ad02a9b' const='yes' id='3f0ac22b'/>
    <reference-type-def kind='lvalue' type-id='3f0ac22b' size-in-bits='64' id='4aef7a77'/>
    <qualified-type-def type-id='7c3c0fe1' const='yes' id='849de1f6'/>
    <pointer-type-def type-id='849de1f6' size-in-bits='64' id='a08a8d54'/>
    <qualified-type-def type-id='3ffb5a41' const='yes' id='ee0f9b31'/>
    <reference-type-def kind='lvalue' type-id='ee0f9b31' size-in-bits='64' id='d9912535'/>
    <qualified-type-def type-id='e3e9fdf0' const='yes' id='01fb3800'/>
    <reference-type-def kind='lvalue' type-id='01fb3800' size-in-bits='64' id='447963d2'/>
    <qualified-type-def type-id='48a38263' const='yes' id='4a0fce0a'/>
    <pointer-type-def type-id='4a0fce0a' size-in-bits='64' id='b6e17c60'/>
    <qualified-type-def type-id='7e61558d' const='yes' id='3ac2801d'/>
    <reference-type-def kind='lvalue' type-id='3ac2801d' size-in-bits='64' id='bb2fdce1'/>
    <qualified-type-def type-id='1640ce04' const='yes' id='9046b934'/>
    <reference-type-def kind='lvalue' type-id='9046b934' size-in-bits='64' id='31555756'/>
    <qualified-type-def type-id='f4949dd6' const='yes' id='1e1bd0e9'/>
    <pointer-type-def type-id='1e1bd0e9' size-in-bits='64' id='28c9a2f9'/>
    <qualified-type-def type-id='b04d0584' const='yes' id='ef9438f4'/>
    <reference-type-def kind='lvalue' type-id='ef9438f4' size-in-bits='64' id='f8557296'/>
    <qualified-type-def type-id='b7d5b813' const='yes' id='a0612be3'/>
    <reference-type-def kind='lvalue' type-id='a0612be3' size-in-bits='64' id='3df7e71f'/>
    <qualified-type-def type-id='41163438' const='yes' id='a6d31e95'/>
    <pointer-type-def type-id='a6d31e95' size-in-bits='64' id='5d5966ad'/>
    <qualified-type-def type-id='03a83b58' const='yes' id='492a70e8'/>
    <reference-type-def kind='lvalue' type-id='492a70e8' size-in-bits='64' id='fbcf944a'/>
    <qualified-type-def type-id='4e95d0c5' const='yes' id='ba1ec8b2'/>
    <pointer-type-def type-id='ba1ec8b2' size-in-bits='64' id='9675c748'/>
    <qualified-type-def type-id='77993625' const='yes' id='7968e1b5'/>
    <reference-type-def kind='lvalue' type-id='7968e1b5' size-in-bits='64' id='b31b1a69'/>
    <qualified-type-def type-id='d749159f' const='yes' id='4ff9f22e'/>
    <pointer-type-def type-id='4ff9f22e' size-in-bits='64' id='ea77fc4c'/>
    <qualified-type-def type-id='2f626509' const='yes' id='f35b2c39'/>
    <reference-type-def kind='lvalue' type-id='f35b2c39' size-in-bits='64' id='378674cd'/>
    <qualified-type-def type-id='60f7c662' const='yes' id='bbb83c8d'/>
    <pointer-type-def type-id='bbb83c8d' size-in-bits='64' id='2a077ae5'/>
    <qualified-type-def type-id='cb8e50a0' const='yes' id='d49c0eb0'/>
    <reference-type-def kind='lvalue' type-id='d49c0eb0' size-in-bits='64' id='47aaf622'/>
    <qualified-type-def type-id='fc48170e' const='yes' id='da27eabf'/>
    <reference-type-def kind='lvalue' type-id='da27eabf' size-in-bits='64' id='05d64edb'/>
    <pointer-type-def type-id='da27eabf' size-in-bits='64' id='01d6488f'/>
    <qualified-type-def type-id='83371577' const='yes' id='f0b9f8d0'/>
    <reference-type-def kind='lvalue' type-id='f0b9f8d0' size-in-bits='64' id='eac2eb42'/>
    <pointer-type-def type-id='f0b9f8d0' size-in-bits='64' id='eec2f18e'/>
    <qualified-type-def type-id='bef4d559' const='yes' id='2bc603e4'/>
    <reference-type-def kind='lvalue' type-id='2bc603e4' size-in-bits='64' id='aab7ea66'/>
    <pointer-type-def type-id='2bc603e4' size-in-bits='64' id='b6b7fd4a'/>
    <qualified-type-def type-id='a9207050' const='yes' id='a62915df'/>
    <reference-type-def kind='lvalue' type-id='a62915df' size-in-bits='64' id='8bad96fb'/>
    <pointer-type-def type-id='a62915df' size-in-bits='64' id='87ad90af'/>
    <qualified-type-def type-id='2ca858ff' const='yes' id='2704f2e0'/>
    <pointer-type-def type-id='2704f2e0' size-in-bits='64' id='36ca33fe'/>
    <qualified-type-def type-id='dcda34fe' const='yes' id='fed8359d'/>
    <pointer-type-def type-id='fed8359d' size-in-bits='64' id='e55c8f15'/>
    <qualified-type-def type-id='a4477481' const='yes' id='a1e99d91'/>
    <reference-type-def kind='lvalue' type-id='a1e99d91' size-in-bits='64' id='99c34715'/>
    <qualified-type-def type-id='9509476a' const='yes' id='34d20d1d'/>
    <pointer-type-def type-id='34d20d1d' size-in-bits='64' id='5daacd95'/>
    <qualified-type-def type-id='8aa94201' const='yes' id='3935e111'/>
    <reference-type-def kind='lvalue' type-id='3935e111' size-in-bits='64' id='46d18995'/>
    <qualified-type-def type-id='e95c0bc2' const='yes' id='ccc2c4d1'/>
    <pointer-type-def type-id='ccc2c4d1' size-in-bits='64' id='519c1721'/>
    <qualified-type-def type-id='f2d8abf5' const='yes' id='893fea05'/>
    <reference-type-def kind='lvalue' type-id='893fea05' size-in-bits='64' id='329d9519'/>
    <qualified-type-def type-id='862caace' const='yes' id='28a36e61'/>
    <pointer-type-def type-id='28a36e61' size-in-bits='64' id='4446a011'/>
    <qualified-type-def type-id='1a909a45' const='yes' id='8bb04695'/>
    <reference-type-def kind='lvalue' type-id='8bb04695' size-in-bits='64' id='997f4bc9'/>
    <qualified-type-def type-id='c39e145c' const='yes' id='1f4b5b63'/>
    <pointer-type-def type-id='1f4b5b63' size-in-bits='64' id='8ca0b3eb'/>
    <qualified-type-def type-id='e89d29fb' const='yes' id='28eb198b'/>
    <reference-type-def kind='lvalue' type-id='28eb198b' size-in-bits='64' id='17196b57'/>
    <qualified-type-def type-id='e4c0d167' const='yes' id='3c6147dc'/>
    <reference-type-def kind='lvalue' type-id='3c6147dc' size-in-bits='64' id='07244e8e'/>
    <pointer-type-def type-id='3c6147dc' size-in-bits='64' id='03244842'/>
    <qualified-type-def type-id='e1fb5776' const='yes' id='a6ad0a66'/>
    <reference-type-def kind='lvalue' type-id='a6ad0a66' size-in-bits='64' id='a26722c0'/>
    <qualified-type-def type-id='7da10ac2' const='yes' id='d26f34b2'/>
    <reference-type-def kind='lvalue' type-id='d26f34b2' size-in-bits='64' id='d90fc4fc'/>
    <qualified-type-def type-id='ba760a37' const='yes' id='52a026c0'/>
    <reference-type-def kind='lvalue' type-id='52a026c0' size-in-bits='64' id='f81d3c12'/>
    <pointer-type-def type-id='52a026c0' size-in-bits='64' id='fc1d425e'/>
    <qualified-type-def type-id='4134136a' const='yes' id='c5ea6e1a'/>
    <reference-type-def kind='lvalue' type-id='c5ea6e1a' size-in-bits='64' id='cc0b8874'/>
    <qualified-type-def type-id='51b7bbce' const='yes' id='7f2bc27e'/>
    <reference-type-def kind='lvalue' type-id='7f2bc27e' size-in-bits='64' id='89e2f088'/>
    <qualified-type-def type-id='f25f4ef3' const='yes' id='13624c88'/>
    <reference-type-def kind='lvalue' type-id='13624c88' size-in-bits='64' id='31beb5ea'/>
    <pointer-type-def type-id='13624c88' size-in-bits='64' id='25bea306'/>
    <qualified-type-def type-id='7af4ce12' const='yes' id='ad912d42'/>
    <reference-type-def kind='lvalue' type-id='ad912d42' size-in-bits='64' id='9f8a746c'/>
    <qualified-type-def type-id='a05aa2c6' const='yes' id='b3c8b036'/>
    <reference-type-def kind='lvalue' type-id='b3c8b036' size-in-bits='64' id='14ed2930'/>
    <qualified-type-def type-id='e4634a23' const='yes' id='6d3d908c'/>
    <reference-type-def kind='lvalue' type-id='6d3d908c' size-in-bits='64' id='a1eabb9e'/>
    <pointer-type-def type-id='6d3d908c' size-in-bits='64' id='9deab552'/>
    <qualified-type-def type-id='c3477fa6' const='yes' id='814c4296'/>
    <reference-type-def kind='lvalue' type-id='814c4296' size-in-bits='64' id='3b0cfb10'/>
    <qualified-type-def type-id='55e74bf2' const='yes' id='0b15e0e2'/>
    <reference-type-def kind='lvalue' type-id='0b15e0e2' size-in-bits='64' id='3770d48c'/>
    <qualified-type-def type-id='ebcac9bd' const='yes' id='18dd3522'/>
    <reference-type-def kind='lvalue' type-id='18dd3522' size-in-bits='64' id='283a754c'/>
    <pointer-type-def type-id='18dd3522' size-in-bits='64' id='2c3a7b98'/>
    <qualified-type-def type-id='c1ac0e18' const='yes' id='57388b88'/>
    <reference-type-def kind='lvalue' type-id='57388b88' size-in-bits='64' id='fc03e2ea'/>
    <qualified-type-def type-id='68fecac0' const='yes' id='e4c48430'/>
    <reference-type-def kind='lvalue' type-id='e4c48430' size-in-bits='64' id='375beea2'/>
    <qualified-type-def type-id='c3d55545' const='yes' id='a586ff98'/>
    <pointer-type-def type-id='a586ff98' size-in-bits='64' id='45848536'/>
    <qualified-type-def type-id='79621b1c' const='yes' id='5fdb1349'/>
    <reference-type-def kind='lvalue' type-id='5fdb1349' size-in-bits='64' id='54df97bd'/>
    <qualified-type-def type-id='ba5fd377' const='yes' id='3d2a306e'/>
    <reference-type-def kind='lvalue' type-id='3d2a306e' size-in-bits='64' id='916a0158'/>
    <qualified-type-def type-id='5758d6f3' const='yes' id='4ba9f1ec'/>
    <reference-type-def kind='lvalue' type-id='4ba9f1ec' size-in-bits='64' id='e687a0fe'/>
    <qualified-type-def type-id='d060b589' const='yes' id='f0cbe2dc'/>
    <reference-type-def kind='lvalue' type-id='f0cbe2dc' size-in-bits='64' id='0af64f8e'/>
    <qualified-type-def type-id='c3422e51' const='yes' id='c9c4ddee'/>
    <reference-type-def kind='lvalue' type-id='c9c4ddee' size-in-bits='64' id='68e921d8'/>
    <qualified-type-def type-id='045f2c1d' const='yes' id='6d7b66d2'/>
    <reference-type-def kind='lvalue' type-id='6d7b66d2' size-in-bits='64' id='4d43121c'/>
    <qualified-type-def type-id='c3bd9520' const='yes' id='38b27fd1'/>
    <reference-type-def kind='lvalue' type-id='38b27fd1' size-in-bits='64' id='37ff71d5'/>
    <qualified-type-def type-id='4f2e50a6' const='yes' id='6458eae3'/>
    <reference-type-def kind='lvalue' type-id='6458eae3' size-in-bits='64' id='bcf9941f'/>
    <qualified-type-def type-id='95370a30' const='yes' id='66a2fce7'/>
    <reference-type-def kind='lvalue' type-id='66a2fce7' size-in-bits='64' id='5393e3d3'/>
    <qualified-type-def type-id='5a450888' const='yes' id='2eae0a51'/>
    <reference-type-def kind='lvalue' type-id='2eae0a51' size-in-bits='64' id='f2fa7955'/>
    <qualified-type-def type-id='91b400c2' const='yes' id='13506b45'/>
    <reference-type-def kind='lvalue' type-id='13506b45' size-in-bits='64' id='ca990cd9'/>
    <qualified-type-def type-id='5ab984d5' const='yes' id='334a7ec0'/>
    <reference-type-def kind='lvalue' type-id='334a7ec0' size-in-bits='64' id='a445c412'/>
    <qualified-type-def type-id='81a0b4b0' const='yes' id='feac3277'/>
    <reference-type-def kind='lvalue' type-id='feac3277' size-in-bits='64' id='3a133583'/>
    <qualified-type-def type-id='7ea8f7bd' const='yes' id='ee56d904'/>
    <reference-type-def kind='lvalue' type-id='ee56d904' size-in-bits='64' id='54b7d086'/>
    <qualified-type-def type-id='b93cf803' const='yes' id='d3d8dbf0'/>
    <reference-type-def kind='lvalue' type-id='d3d8dbf0' size-in-bits='64' id='546211e2'/>
    <qualified-type-def type-id='39c9355e' const='yes' id='e3ab2cff'/>
    <reference-type-def kind='lvalue' type-id='e3ab2cff' size-in-bits='64' id='3f77999b'/>
    <qualified-type-def type-id='0abdfcb3' const='yes' id='cd12eb12'/>
    <reference-type-def kind='lvalue' type-id='cd12eb12' size-in-bits='64' id='08c842dc'/>
    <qualified-type-def type-id='fa512ec6' const='yes' id='e18079b1'/>
    <reference-type-def kind='lvalue' type-id='e18079b1' size-in-bits='64' id='943f68b5'/>
    <qualified-type-def type-id='072a65bb' const='yes' id='3df7d11c'/>
    <reference-type-def kind='lvalue' type-id='3df7d11c' size-in-bits='64' id='c71e5e4e'/>
    <pointer-type-def type-id='3df7d11c' size-in-bits='64' id='c31e5802'/>
    <qualified-type-def type-id='b7eb94b4' const='yes' id='e95882a3'/>
    <pointer-type-def type-id='e95882a3' size-in-bits='64' id='df557dab'/>
    <qualified-type-def type-id='c8e52e89' const='yes' id='96207d1c'/>
    <pointer-type-def type-id='96207d1c' size-in-bits='64' id='8b251c02'/>
    <qualified-type-def type-id='a8163d5b' const='yes' id='a694a378'/>
    <pointer-type-def type-id='a694a378' size-in-bits='64' id='8dfd1a16'/>
    <qualified-type-def type-id='4e40e14c' const='yes' id='a90c5b0f'/>
    <reference-type-def kind='lvalue' type-id='a90c5b0f' size-in-bits='64' id='4773818b'/>
    <pointer-type-def type-id='a90c5b0f' size-in-bits='64' id='43737b3f'/>
    <qualified-type-def type-id='1e5dce81' const='yes' id='d782b5e0'/>
    <reference-type-def kind='lvalue' type-id='d782b5e0' size-in-bits='64' id='08c426b2'/>
    <pointer-type-def type-id='d782b5e0' size-in-bits='64' id='0cc42cfe'/>
    <qualified-type-def type-id='41f6eaf7' const='yes' id='badd00aa'/>
    <reference-type-def kind='lvalue' type-id='badd00aa' size-in-bits='64' id='b5e7dc64'/>
    <pointer-type-def type-id='badd00aa' size-in-bits='64' id='a9e7c980'/>
    <qualified-type-def type-id='a7485048' const='yes' id='58e7af25'/>
    <reference-type-def kind='lvalue' type-id='58e7af25' size-in-bits='64' id='f7b881b9'/>
    <pointer-type-def type-id='58e7af25' size-in-bits='64' id='03b8949d'/>
    <qualified-type-def type-id='559b5d54' const='yes' id='d7941ccf'/>
    <reference-type-def kind='lvalue' type-id='d7941ccf' size-in-bits='64' id='472982cb'/>
    <pointer-type-def type-id='d7941ccf' size-in-bits='64' id='43297c7f'/>
    <qualified-type-def type-id='49c21ffd' const='yes' id='e1180b2d'/>
    <reference-type-def kind='lvalue' type-id='e1180b2d' size-in-bits='64' id='63d96251'/>
    <qualified-type-def type-id='0840c323' const='yes' id='7b2d09f3'/>
    <reference-type-def kind='lvalue' type-id='7b2d09f3' size-in-bits='64' id='bce67a4f'/>
    <qualified-type-def type-id='c947cc49' const='yes' id='c2071cd9'/>
    <reference-type-def kind='lvalue' type-id='c2071cd9' size-in-bits='64' id='7032a56d'/>
    <qualified-type-def type-id='79c2d379' const='yes' id='25bdb7e9'/>
    <reference-type-def kind='lvalue' type-id='25bdb7e9' size-in-bits='64' id='38a85add'/>
    <qualified-type-def type-id='d8b17029' const='yes' id='50d39ce6'/>
    <reference-type-def kind='lvalue' type-id='50d39ce6' size-in-bits='64' id='fd1fc240'/>
    <pointer-type-def type-id='50d39ce6' size-in-bits='64' id='091fd524'/>
    <qualified-type-def type-id='533f0a3c' const='yes' id='4ba4c02c'/>
    <reference-type-def kind='lvalue' type-id='4ba4c02c' size-in-bits='64' id='1e5a4fbe'/>
    <qualified-type-def type-id='eac038ca' const='yes' id='48c4e89a'/>
    <reference-type-def kind='lvalue' type-id='48c4e89a' size-in-bits='64' id='49fa5ff4'/>
    <qualified-type-def type-id='db2fee86' const='yes' id='d4b68656'/>
    <reference-type-def kind='lvalue' type-id='d4b68656' size-in-bits='64' id='4b55a250'/>
    <qualified-type-def type-id='b8c746bc' const='yes' id='acf4cb6c'/>
    <reference-type-def kind='lvalue' type-id='acf4cb6c' size-in-bits='64' id='8f5c057e'/>
    <qualified-type-def type-id='c6c973d1' const='yes' id='4feeb13e'/>
    <reference-type-def kind='lvalue' type-id='4feeb13e' size-in-bits='64' id='ecc0c8c8'/>
    <pointer-type-def type-id='4feeb13e' size-in-bits='64' id='e8c0c27c'/>
    <qualified-type-def type-id='42af8d53' const='yes' id='13dbef3c'/>
    <reference-type-def kind='lvalue' type-id='13dbef3c' size-in-bits='64' id='5d3965ee'/>
    <qualified-type-def type-id='d2cd143e' const='yes' id='4116d9df'/>
    <reference-type-def kind='lvalue' type-id='4116d9df' size-in-bits='64' id='6ff922fb'/>
    <qualified-type-def type-id='00db6bac' const='yes' id='0de9cf89'/>
    <reference-type-def kind='lvalue' type-id='0de9cf89' size-in-bits='64' id='9611f07d'/>
    <qualified-type-def type-id='0d466f58' const='yes' id='6e9545ad'/>
    <reference-type-def kind='lvalue' type-id='6e9545ad' size-in-bits='64' id='9ffc79d1'/>
    <qualified-type-def type-id='51f53c2c' const='yes' id='da433c17'/>
    <reference-type-def kind='lvalue' type-id='da433c17' size-in-bits='64' id='c8d7c123'/>
    <qualified-type-def type-id='153cbf30' const='yes' id='ea9d32b1'/>
    <reference-type-def kind='lvalue' type-id='ea9d32b1' size-in-bits='64' id='ec76a3b5'/>
    <pointer-type-def type-id='ea9d32b1' size-in-bits='64' id='f076aa01'/>
    <qualified-type-def type-id='058b4023' const='yes' id='687cf76a'/>
    <reference-type-def kind='lvalue' type-id='687cf76a' size-in-bits='64' id='c8b94ca4'/>
    <pointer-type-def type-id='687cf76a' size-in-bits='64' id='bcb939c0'/>
    <qualified-type-def type-id='d48c7580' const='yes' id='221ec870'/>
    <reference-type-def kind='lvalue' type-id='221ec870' size-in-bits='64' id='0c755f62'/>
    <qualified-type-def type-id='89e54b1e' const='yes' id='6f3e62ee'/>
    <reference-type-def kind='lvalue' type-id='6f3e62ee' size-in-bits='64' id='e73580d8'/>
    <qualified-type-def type-id='ba5010d8' const='yes' id='2a9a3708'/>
    <reference-type-def kind='lvalue' type-id='2a9a3708' size-in-bits='64' id='3ec4dd6a'/>
    <qualified-type-def type-id='944498cc' const='yes' id='1bf977bf'/>
    <reference-type-def kind='lvalue' type-id='1bf977bf' size-in-bits='64' id='a2b745db'/>
    <pointer-type-def type-id='1bf977bf' size-in-bits='64' id='9eb73f8f'/>
    <qualified-type-def type-id='3ba8a1ed' const='yes' id='d02bb9dd'/>
    <reference-type-def kind='lvalue' type-id='d02bb9dd' size-in-bits='64' id='afd5c621'/>
    <qualified-type-def type-id='fef409b3' const='yes' id='df58dc03'/>
    <reference-type-def kind='lvalue' type-id='df58dc03' size-in-bits='64' id='bde28e3f'/>
    <qualified-type-def type-id='3e6206a9' const='yes' id='75c404d9'/>
    <reference-type-def kind='lvalue' type-id='75c404d9' size-in-bits='64' id='6293dd6d'/>
    <reference-type-def kind='lvalue' type-id='9cbd1c16' size-in-bits='64' id='edb35f90'/>
    <pointer-type-def type-id='9cbd1c16' size-in-bits='64' id='f9b37274'/>
    <pointer-type-def type-id='ab1af04a' size-in-bits='64' id='73a6dc88'/>
    <reference-type-def kind='lvalue' type-id='e2ea29ba' size-in-bits='64' id='131b6add'/>
    <pointer-type-def type-id='1aff39ce' size-in-bits='64' id='29efd4e4'/>
    <reference-type-def kind='lvalue' type-id='0e6df23a' size-in-bits='64' id='d1e866e5'/>
    <reference-type-def kind='lvalue' type-id='601112f0' size-in-bits='64' id='b229903a'/>
    <pointer-type-def type-id='601112f0' size-in-bits='64' id='a6297d56'/>
    <reference-type-def kind='lvalue' type-id='f4910e26' size-in-bits='64' id='73b591f8'/>
    <pointer-type-def type-id='f4910e26' size-in-bits='64' id='6fb58bac'/>
    <reference-type-def kind='lvalue' type-id='d006b1ee' size-in-bits='64' id='e4a0b7e0'/>
    <pointer-type-def type-id='d006b1ee' size-in-bits='64' id='f0a0cac4'/>
    <reference-type-def kind='lvalue' type-id='2dfd06ac' size-in-bits='64' id='1fda0e06'/>
    <pointer-type-def type-id='2dfd06ac' size-in-bits='64' id='2bda20ea'/>
    <reference-type-def kind='lvalue' type-id='fa10109f' size-in-bits='64' id='2e517b63'/>
    <pointer-type-def type-id='fa10109f' size-in-bits='64' id='3a518e47'/>
    <pointer-type-def type-id='7e04d7d2' size-in-bits='64' id='cc5d4cc0'/>
    <reference-type-def kind='lvalue' type-id='0c05c1dd' size-in-bits='64' id='310042a9'/>
    <pointer-type-def type-id='0c05c1dd' size-in-bits='64' id='3d00558d'/>
    <reference-type-def kind='lvalue' type-id='271d4497' size-in-bits='64' id='413fca08'/>
    <reference-type-def kind='lvalue' type-id='c25f07c1' size-in-bits='64' id='248aa7ca'/>
    <pointer-type-def type-id='fad3db35' size-in-bits='64' id='7ab94e15'/>
    <reference-type-def kind='lvalue' type-id='1bcd6548' size-in-bits='64' id='52111972'/>
    <pointer-type-def type-id='1bcd6548' size-in-bits='64' id='56111fbe'/>
    <reference-type-def kind='lvalue' type-id='017cc23a' size-in-bits='64' id='83f0cff9'/>
    <reference-type-def kind='lvalue' type-id='4306cd8c' size-in-bits='64' id='d88afb7f'/>
    <pointer-type-def type-id='a40ad1e7' size-in-bits='64' id='7db2635f'/>
    <reference-type-def kind='lvalue' type-id='5bf9f966' size-in-bits='64' id='479cea88'/>
    <pointer-type-def type-id='5bf9f966' size-in-bits='64' id='439ce43c'/>
    <reference-type-def kind='lvalue' type-id='2b0e6d62' size-in-bits='64' id='6b1124d7'/>
    <reference-type-def kind='lvalue' type-id='c434c394' size-in-bits='64' id='83be4141'/>
    <pointer-type-def type-id='de7fd4e7' size-in-bits='64' id='f8eeed9f'/>
    <reference-type-def kind='lvalue' type-id='21f5ffdb' size-in-bits='64' id='4d2b542f'/>
    <pointer-type-def type-id='21f5ffdb' size-in-bits='64' id='512b5a7b'/>
    <reference-type-def kind='lvalue' type-id='c71a1c73' size-in-bits='64' id='a9d22446'/>
    <reference-type-def kind='lvalue' type-id='7bff1605' size-in-bits='64' id='e1482e74'/>
    <pointer-type-def type-id='38772859' size-in-bits='64' id='c6400161'/>
    <pointer-type-def type-id='ca8f5e2c' size-in-bits='64' id='c8f9d5ba'/>
    <reference-type-def kind='lvalue' type-id='3dc69e9c' size-in-bits='64' id='c111a59b'/>
    <pointer-type-def type-id='7c3c0fe1' size-in-bits='64' id='f73ea599'/>
    <reference-type-def kind='lvalue' type-id='3ffb5a41' size-in-bits='64' id='b87512b6'/>
    <pointer-type-def type-id='48a38263' size-in-bits='64' id='873b29e3'/>
    <reference-type-def kind='lvalue' type-id='7e61558d' size-in-bits='64' id='d3ee0e68'/>
    <pointer-type-def type-id='f4949dd6' size-in-bits='64' id='325e72cc'/>
    <reference-type-def kind='lvalue' type-id='b04d0584' size-in-bits='64' id='e192a44d'/>
    <pointer-type-def type-id='41163438' size-in-bits='64' id='06589dae'/>
    <reference-type-def kind='lvalue' type-id='03a83b58' size-in-bits='64' id='e44c522f'/>
    <pointer-type-def type-id='4e95d0c5' size-in-bits='64' id='720a5a35'/>
    <reference-type-def kind='lvalue' type-id='77993625' size-in-bits='64' id='4d5ddcd2'/>
    <pointer-type-def type-id='d749159f' size-in-bits='64' id='f4123637'/>
    <reference-type-def kind='lvalue' type-id='2f626509' size-in-bits='64' id='84eb69fc'/>
    <pointer-type-def type-id='60f7c662' size-in-bits='64' id='a0a59360'/>
    <reference-type-def kind='lvalue' type-id='cb8e50a0' size-in-bits='64' id='09b669e1'/>
    <reference-type-def kind='lvalue' type-id='fc48170e' size-in-bits='64' id='0e44d3e0'/>
    <pointer-type-def type-id='fc48170e' size-in-bits='64' id='1a44e6c4'/>
    <reference-type-def kind='lvalue' type-id='83371577' size-in-bits='64' id='c155340b'/>
    <pointer-type-def type-id='83371577' size-in-bits='64' id='bd552dbf'/>
    <reference-type-def kind='lvalue' type-id='bef4d559' size-in-bits='64' id='b564a485'/>
    <pointer-type-def type-id='bef4d559' size-in-bits='64' id='b964aad1'/>
    <reference-type-def kind='lvalue' type-id='a9207050' size-in-bits='64' id='04ebcf9a'/>
    <pointer-type-def type-id='a9207050' size-in-bits='64' id='f8ebbcb6'/>
    <pointer-type-def type-id='2ca858ff' size-in-bits='64' id='458526d7'/>
    <reference-type-def kind='lvalue' type-id='dcda34fe' size-in-bits='64' id='435a6850'/>
    <pointer-type-def type-id='dcda34fe' size-in-bits='64' id='4f5a7b34'/>
    <pointer-type-def type-id='39af612e' size-in-bits='64' id='7e1fba74'/>
    <reference-type-def kind='lvalue' type-id='a4477481' size-in-bits='64' id='18c8f008'/>
    <reference-type-def kind='lvalue' type-id='9509476a' size-in-bits='64' id='938313cc'/>
    <pointer-type-def type-id='9509476a' size-in-bits='64' id='97831a18'/>
    <pointer-type-def type-id='33908b5a' size-in-bits='64' id='f44c1d78'/>
    <reference-type-def kind='lvalue' type-id='8aa94201' size-in-bits='64' id='8d0a7e24'/>
    <reference-type-def kind='lvalue' type-id='e95c0bc2' size-in-bits='64' id='bad0f034'/>
    <pointer-type-def type-id='e95c0bc2' size-in-bits='64' id='aed0dd50'/>
    <pointer-type-def type-id='057ac362' size-in-bits='64' id='2857a6c0'/>
    <reference-type-def kind='lvalue' type-id='f2d8abf5' size-in-bits='64' id='7d783d5c'/>
    <reference-type-def kind='lvalue' type-id='862caace' size-in-bits='64' id='0c795a40'/>
    <pointer-type-def type-id='862caace' size-in-bits='64' id='18796d24'/>
    <pointer-type-def type-id='0edfc7de' size-in-bits='64' id='d391a504'/>
    <reference-type-def kind='lvalue' type-id='1a909a45' size-in-bits='64' id='9291baf8'/>
    <reference-type-def kind='lvalue' type-id='c39e145c' size-in-bits='64' id='ed9298f6'/>
    <pointer-type-def type-id='c39e145c' size-in-bits='64' id='f992abda'/>
    <pointer-type-def type-id='292c51c8' size-in-bits='64' id='38b97d6e'/>
    <reference-type-def kind='lvalue' type-id='e89d29fb' size-in-bits='64' id='da2f189a'/>
    <reference-type-def kind='lvalue' type-id='e4c0d167' size-in-bits='64' id='9242ee3b'/>
    <pointer-type-def type-id='e4c0d167' size-in-bits='64' id='8e42e7ef'/>
    <reference-type-def kind='lvalue' type-id='c50f7d62' size-in-bits='64' id='bc50be2f'/>
    <reference-type-def kind='lvalue' type-id='7da10ac2' size-in-bits='64' id='58259d8d'/>
    <reference-type-def kind='lvalue' type-id='ba760a37' size-in-bits='64' id='d4f1b06b'/>
    <pointer-type-def type-id='ba760a37' size-in-bits='64' id='d0f1aa1f'/>
    <reference-type-def kind='lvalue' type-id='8cc7d10e' size-in-bits='64' id='8afc74bf'/>
    <reference-type-def kind='lvalue' type-id='51b7bbce' size-in-bits='64' id='067d8d3d'/>
    <reference-type-def kind='lvalue' type-id='f25f4ef3' size-in-bits='64' id='86a42ef7'/>
    <pointer-type-def type-id='f25f4ef3' size-in-bits='64' id='7aa41c13'/>
    <reference-type-def kind='lvalue' type-id='7f3651c6' size-in-bits='64' id='071da953'/>
    <reference-type-def kind='lvalue' type-id='a05aa2c6' size-in-bits='64' id='f7dfb231'/>
    <reference-type-def kind='lvalue' type-id='e4634a23' size-in-bits='64' id='811e3827'/>
    <pointer-type-def type-id='e4634a23' size-in-bits='64' id='751e2543'/>
    <reference-type-def kind='lvalue' type-id='04830072' size-in-bits='64' id='0ccc4a63'/>
    <reference-type-def kind='lvalue' type-id='55e74bf2' size-in-bits='64' id='191221e1'/>
    <reference-type-def kind='lvalue' type-id='ebcac9bd' size-in-bits='64' id='918709a9'/>
    <pointer-type-def type-id='ebcac9bd' size-in-bits='64' id='9d871c8d'/>
    <reference-type-def kind='lvalue' type-id='fb3abc60' size-in-bits='64' id='b1e1ef55'/>
    <reference-type-def kind='lvalue' type-id='68fecac0' size-in-bits='64' id='2ee3eba3'/>
    <reference-type-def kind='lvalue' type-id='c3d55545' size-in-bits='64' id='f172a971'/>
    <pointer-type-def type-id='c3d55545' size-in-bits='64' id='ed72a325'/>
    <reference-type-def kind='lvalue' type-id='79621b1c' size-in-bits='64' id='f3c97726'/>
    <pointer-type-def type-id='79621b1c' size-in-bits='64' id='ffc98a0a'/>
    <reference-type-def kind='lvalue' type-id='ba5fd377' size-in-bits='64' id='2300facb'/>
    <pointer-type-def type-id='ba5fd377' size-in-bits='64' id='1f00f47f'/>
    <reference-type-def kind='lvalue' type-id='5758d6f3' size-in-bits='64' id='ffdc5f57'/>
    <pointer-type-def type-id='5758d6f3' size-in-bits='64' id='f3dc4c73'/>
    <reference-type-def kind='lvalue' type-id='d060b589' size-in-bits='64' id='390e6455'/>
    <pointer-type-def type-id='d060b589' size-in-bits='64' id='3d0e6aa1'/>
    <reference-type-def kind='lvalue' type-id='c3422e51' size-in-bits='64' id='32f7dc4d'/>
    <pointer-type-def type-id='c3422e51' size-in-bits='64' id='26f7c969'/>
    <reference-type-def kind='lvalue' type-id='045f2c1d' size-in-bits='64' id='f6109219'/>
    <pointer-type-def type-id='045f2c1d' size-in-bits='64' id='0210a4fd'/>
    <reference-type-def kind='lvalue' type-id='c3bd9520' size-in-bits='64' id='657ea14a'/>
    <pointer-type-def type-id='c3bd9520' size-in-bits='64' id='597e8e66'/>
    <reference-type-def kind='lvalue' type-id='4f2e50a6' size-in-bits='64' id='4769da28'/>
    <pointer-type-def type-id='4f2e50a6' size-in-bits='64' id='4369d3dc'/>
    <reference-type-def kind='lvalue' type-id='95370a30' size-in-bits='64' id='2d94f82a'/>
    <pointer-type-def type-id='95370a30' size-in-bits='64' id='2194e546'/>
    <reference-type-def kind='lvalue' type-id='5a450888' size-in-bits='64' id='55fa0182'/>
    <pointer-type-def type-id='5a450888' size-in-bits='64' id='59fa07ce'/>
    <reference-type-def kind='lvalue' type-id='91b400c2' size-in-bits='64' id='70b4fac4'/>
    <pointer-type-def type-id='91b400c2' size-in-bits='64' id='64b4e7e0'/>
    <reference-type-def kind='lvalue' type-id='5ab984d5' size-in-bits='64' id='320a1c41'/>
    <pointer-type-def type-id='5ab984d5' size-in-bits='64' id='2e0a15f5'/>
    <pointer-type-def type-id='81a0b4b0' size-in-bits='64' id='dbcb8b96'/>
    <pointer-type-def type-id='7ea8f7bd' size-in-bits='64' id='966e07dd'/>
    <pointer-type-def type-id='b93cf803' size-in-bits='64' id='96694063'/>
    <pointer-type-def type-id='39c9355e' size-in-bits='64' id='23eedc54'/>
    <reference-type-def kind='lvalue' type-id='0abdfcb3' size-in-bits='64' id='40a61937'/>
    <pointer-type-def type-id='0abdfcb3' size-in-bits='64' id='34a60653'/>
    <reference-type-def kind='lvalue' type-id='fa512ec6' size-in-bits='64' id='e67fba68'/>
    <pointer-type-def type-id='fa512ec6' size-in-bits='64' id='e27fb41c'/>
    <reference-type-def kind='lvalue' type-id='072a65bb' size-in-bits='64' id='0eea8e9f'/>
    <pointer-type-def type-id='072a65bb' size-in-bits='64' id='12ea94eb'/>
    <pointer-type-def type-id='b7eb94b4' size-in-bits='64' id='cc397e52'/>
    <pointer-type-def type-id='c8e52e89' size-in-bits='64' id='d1a330f1'/>
    <pointer-type-def type-id='a8163d5b' size-in-bits='64' id='d119c68b'/>
    <reference-type-def kind='lvalue' type-id='559b5d54' size-in-bits='64' id='dad0481e'/>
    <pointer-type-def type-id='559b5d54' size-in-bits='64' id='d6d041d2'/>
    <reference-type-def kind='lvalue' type-id='0840c323' size-in-bits='64' id='6ec7e202'/>
    <reference-type-def kind='lvalue' type-id='c947cc49' size-in-bits='64' id='e43a18a6'/>
    <reference-type-def kind='lvalue' type-id='d8b17029' size-in-bits='64' id='748a7df5'/>
    <pointer-type-def type-id='d8b17029' size-in-bits='64' id='788a8441'/>
    <reference-type-def kind='lvalue' type-id='eac038ca' size-in-bits='64' id='c8c10a51'/>
    <reference-type-def kind='lvalue' type-id='db2fee86' size-in-bits='64' id='9ffeed3f'/>
    <reference-type-def kind='lvalue' type-id='c6c973d1' size-in-bits='64' id='944b470d'/>
    <pointer-type-def type-id='c6c973d1' size-in-bits='64' id='884b3429'/>
    <reference-type-def kind='lvalue' type-id='42af8d53' size-in-bits='64' id='38f13dc7'/>
    <pointer-type-def type-id='42af8d53' size-in-bits='64' id='2cf12ae3'/>
    <reference-type-def kind='lvalue' type-id='d2cd143e' size-in-bits='64' id='dffdcb80'/>
    <pointer-type-def type-id='d2cd143e' size-in-bits='64' id='ebfdde64'/>
    <reference-type-def kind='lvalue' type-id='00db6bac' size-in-bits='64' id='432cc3a6'/>
    <pointer-type-def type-id='00db6bac' size-in-bits='64' id='4f2cd68a'/>
    <reference-type-def kind='lvalue' type-id='0d466f58' size-in-bits='64' id='5c041102'/>
    <pointer-type-def type-id='0d466f58' size-in-bits='64' id='6004174e'/>
    <reference-type-def kind='lvalue' type-id='51f53c2c' size-in-bits='64' id='e9bc0b96'/>
    <pointer-type-def type-id='51f53c2c' size-in-bits='64' id='f5bc1e7a'/>
    <reference-type-def kind='lvalue' type-id='153cbf30' size-in-bits='64' id='b30d7bba'/>
    <pointer-type-def type-id='153cbf30' size-in-bits='64' id='a70d68d6'/>
    <reference-type-def kind='lvalue' type-id='058b4023' size-in-bits='64' id='8750b967'/>
    <pointer-type-def type-id='058b4023' size-in-bits='64' id='7b50a683'/>
    <reference-type-def kind='lvalue' type-id='ba5010d8' size-in-bits='64' id='0bd0f021'/>
    <reference-type-def kind='lvalue' type-id='944498cc' size-in-bits='64' id='3251f586'/>
    <pointer-type-def type-id='944498cc' size-in-bits='64' id='3e52086a'/>
    <reference-type-def kind='lvalue' type-id='3e6206a9' size-in-bits='64' id='915fd384'/>
    <reference-type-def kind='lvalue' type-id='8f92235e' size-in-bits='64' id='84420273'/>
    <reference-type-def kind='lvalue' type-id='9c313c2d' size-in-bits='64' id='59647362'/>
    <pointer-type-def type-id='7359adad' size-in-bits='64' id='1d2c2b85'/>
    <qualified-type-def type-id='eaa32e2f' const='yes' id='83be723c'/>
    <reference-type-def kind='lvalue' type-id='83be723c' size-in-bits='64' id='7ecd9eee'/>
    <pointer-type-def type-id='83be723c' size-in-bits='64' id='7acd98a2'/>
    <namespace-decl name='std'>
      <class-decl name='initializer_list&lt;AutoData&gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='b7eb94b4'>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='df8180df'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='6bfcdf1b' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='40580759'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='6bfcdf1b' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='f588e0d9'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='40580759' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='df8180df' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;PtrData&gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='c8e52e89'>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='49b29242'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='05ad5d44' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='ad103cb2'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='05ad5d44' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='d4c99476'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='ad103cb2' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='49b29242' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='a8163d5b'>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='301ffb96'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='e8c0c27c' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='4ba313be'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='e8c0c27c' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='2c143e22'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='4ba313be' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='301ffb96' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;AutoData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='ab11193c'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='83f71ae2'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='8b0560c5'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='5fe824d9'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='00bf834f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='57717775'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;DynLib&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='78a239cb'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='67e99914' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='86d68e9c'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='22e8847b'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='ef8a199e'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='df094c7c'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='00bf834f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='cb6f181e'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PersistData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='3e59154f'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='0852f292' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='73fbe79e'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='b2505d45'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='8968e28c'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='207ad1be'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='00bf834f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='ddec2c60'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PtrData*&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='96ee3149'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='3116b9e2' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='84deebc6'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='68b426bd'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='8ed71a54'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='7ab284c6'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='00bf834f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='92b41d58'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PtrData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='9392ae91'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='2125256b'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='948e350e'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='11c66dcc'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='00bf834f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='add2b08e'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;TargetImage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='e5f70a1d'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='8064cc90' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='590aa120'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='a21c2b2f'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='8221055a'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='f3cd6dc0'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='00bf834f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='ac891b62'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;coibuffer*&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='eb145a38'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='4830199b' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='4180fb87'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='f6c893ba'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='3e213d2d'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='f464d0a1'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='00bf834f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='7269ca4d'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;DynLib&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='14911522'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='4f5b6bc5' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='c3e001c5'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='c5e9da48'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='ad74f34f'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='086916ff'/>
        </member-type>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;DynLib, DynLib&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE12_S_constructIS1_JS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PS9_DpOSA_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE12_S_constructIS1_JS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PS9_DpOSA_'>
            <parameter type-id='4769da28'/>
            <parameter type-id='5ff777cf'/>
            <parameter type-id='63f77e1b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE8allocateERS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE8allocateERS3_m'>
            <parameter type-id='4769da28'/>
            <parameter type-id='086916ff'/>
            <return type-id='c5e9da48'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;DynLib, DynLib&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE9constructIS1_JS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS6_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE9constructIS1_JS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS6_'>
            <parameter type-id='4769da28'/>
            <parameter type-id='5ff777cf'/>
            <parameter type-id='63f77e1b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE10deallocateERS3_PS2_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE10deallocateERS3_PS2_m'>
            <parameter type-id='4769da28'/>
            <parameter type-id='c5e9da48'/>
            <parameter type-id='086916ff'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;DynLib&gt; &gt;, DynLib&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='4769da28'/>
            <parameter type-id='5ff777cf'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;DynLib&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE7destroyIS1_EEvRS3_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE7destroyIS1_EEvRS3_PT_'>
            <parameter type-id='4769da28'/>
            <parameter type-id='5ff777cf'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;PersistData&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='4d287100'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='0ef18ae1' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='8b5bcc89'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='961539bc'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='c2996f8b'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='69c4b543'/>
        </member-type>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;PersistData, const PersistData&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE12_S_constructIS1_JRKS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PSB_DpOSC_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE12_S_constructIS1_JRKS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PSB_DpOSC_'>
            <parameter type-id='2d94f82a'/>
            <parameter type-id='b996b313'/>
            <parameter type-id='4778118e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE8allocateERS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE8allocateERS3_m'>
            <parameter type-id='2d94f82a'/>
            <parameter type-id='69c4b543'/>
            <return type-id='961539bc'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;PersistData, const PersistData&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE9constructIS1_JRKS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS8_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE9constructIS1_JRKS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS8_'>
            <parameter type-id='2d94f82a'/>
            <parameter type-id='b996b313'/>
            <parameter type-id='4778118e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE10deallocateERS3_PS2_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE10deallocateERS3_PS2_m'>
            <parameter type-id='2d94f82a'/>
            <parameter type-id='961539bc'/>
            <parameter type-id='69c4b543'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;PersistData&gt; &gt;, PersistData&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='2d94f82a'/>
            <parameter type-id='b996b313'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;PersistData&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE7destroyIS1_EEvRS3_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE7destroyIS1_EEvRS3_PT_'>
            <parameter type-id='2d94f82a'/>
            <parameter type-id='b996b313'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;PtrData*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='ee6f58c0'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='3796a51b' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='71ecc717'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='0859e98a'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='186c68fd'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='d5611ed1'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10deallocateERS4_PS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10deallocateERS4_PS3_m'>
            <parameter type-id='55fa0182'/>
            <parameter type-id='0859e98a'/>
            <parameter type-id='d5611ed1'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;PtrData*&gt; &gt;, PtrData*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='55fa0182'/>
            <parameter type-id='7182b119'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;PtrData*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE7destroyIS2_EEvRS4_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE7destroyIS2_EEvRS4_PT_'>
            <parameter type-id='55fa0182'/>
            <parameter type-id='7182b119'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;PtrData*, PtrData* const&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE12_S_constructIS2_JRKS2_EEENSt9enable_ifIXsrSt6__and_IJNS5_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS4_PSC_DpOSD_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE12_S_constructIS2_JRKS2_EEENSt9enable_ifIXsrSt6__and_IJNS5_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS4_PSC_DpOSD_'>
            <parameter type-id='55fa0182'/>
            <parameter type-id='7182b119'/>
            <parameter type-id='92ee9900'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE8allocateERS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE8allocateERS4_m'>
            <parameter type-id='55fa0182'/>
            <parameter type-id='d5611ed1'/>
            <return type-id='0859e98a'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;PtrData*, PtrData* const&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE9constructIS2_JRKS2_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS4_PT_DpOS9_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE9constructIS2_JRKS2_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS4_PT_DpOS9_'>
            <parameter type-id='55fa0182'/>
            <parameter type-id='7182b119'/>
            <parameter type-id='92ee9900'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;TargetImage&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='d4f39fde'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='4aaf8c97' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='f9629aeb'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='b8bc9e5e'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='d459ad49'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='4c7cc9a5'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE10deallocateERS3_PS2_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE10deallocateERS3_PS2_m'>
            <parameter type-id='70b4fac4'/>
            <parameter type-id='b8bc9e5e'/>
            <parameter type-id='4c7cc9a5'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;TargetImage&gt; &gt;, TargetImage&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='70b4fac4'/>
            <parameter type-id='d3471dad'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;TargetImage&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE7destroyIS1_EEvRS3_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE7destroyIS1_EEvRS3_PT_'>
            <parameter type-id='70b4fac4'/>
            <parameter type-id='d3471dad'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;TargetImage, TargetImage&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE12_S_constructIS1_JS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PS9_DpOSA_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE12_S_constructIS1_JS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PS9_DpOSA_'>
            <parameter type-id='70b4fac4'/>
            <parameter type-id='d3471dad'/>
            <parameter type-id='c7470ac9'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;TargetImage, const TargetImage&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE12_S_constructIS1_JRKS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PSB_DpOSC_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE12_S_constructIS1_JRKS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PSB_DpOSC_'>
            <parameter type-id='70b4fac4'/>
            <parameter type-id='d3471dad'/>
            <parameter type-id='b277f014'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE8allocateERS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE8allocateERS3_m'>
            <parameter type-id='70b4fac4'/>
            <parameter type-id='4c7cc9a5'/>
            <return type-id='b8bc9e5e'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;TargetImage, TargetImage&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE9constructIS1_JS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS6_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE9constructIS1_JS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS6_'>
            <parameter type-id='70b4fac4'/>
            <parameter type-id='d3471dad'/>
            <parameter type-id='c7470ac9'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;TargetImage, const TargetImage&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE9constructIS1_JRKS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS8_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE9constructIS1_JRKS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS8_'>
            <parameter type-id='70b4fac4'/>
            <parameter type-id='d3471dad'/>
            <parameter type-id='b277f014'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;coibuffer*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='53edfa95'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='b31bc16e' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='526e5da2'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='b87cca09'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='27891f68'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='73b01242'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10deallocateERS4_PS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10deallocateERS4_PS3_m'>
            <parameter type-id='320a1c41'/>
            <parameter type-id='b87cca09'/>
            <parameter type-id='73b01242'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;coibuffer*&gt; &gt;, coibuffer*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='320a1c41'/>
            <parameter type-id='02f58330'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;coibuffer*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE7destroyIS2_EEvRS4_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE7destroyIS2_EEvRS4_PT_'>
            <parameter type-id='320a1c41'/>
            <parameter type-id='02f58330'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;coibuffer*, coibuffer* const&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE12_S_constructIS2_JRKS2_EEENSt9enable_ifIXsrSt6__and_IJNS5_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS4_PSC_DpOSD_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE12_S_constructIS2_JRKS2_EEENSt9enable_ifIXsrSt6__and_IJNS5_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS4_PSC_DpOSD_'>
            <parameter type-id='320a1c41'/>
            <parameter type-id='02f58330'/>
            <parameter type-id='2ceace19'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE8allocateERS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE8allocateERS4_m'>
            <parameter type-id='320a1c41'/>
            <parameter type-id='73b01242'/>
            <return type-id='b87cca09'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;coibuffer*, coibuffer* const&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE9constructIS2_JRKS2_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS4_PT_DpOS9_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE9constructIS2_JRKS2_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS4_PT_DpOS9_'>
            <parameter type-id='320a1c41'/>
            <parameter type-id='02f58330'/>
            <parameter type-id='2ceace19'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='ab4e919f'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='8326e517'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='15918692'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='83ed7d38'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='00bf834f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='b9cd4e6a'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::pair&lt;void const* const, OffloadDescriptor*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='c0e9372a'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bb88ebcd'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='a8bd73a2'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='17f1dc85'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='9cd825e8' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='09e5b899'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='00bf834f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='afa8ce35'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;AutoData&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='79621b1c'>
        <base-class access='public' layout-offset-in-bits='0' type-id='01668b4e'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='fa2b575d'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='dcb4f314' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='d76dec66'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_Rb_tree_node&lt;AutoData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='6154fa47'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='81a0b4b0' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='07364eaa'/>
            </member-type>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;DynLib&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='ba5fd377'>
        <base-class access='public' layout-offset-in-bits='0' type-id='3239da4d'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='a4639394'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='5ff777cf' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='26e2c2e3'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='ef061f07' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='67e99914'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_List_node&lt;DynLib&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='61ea6ef4'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='4f2e50a6' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='28099a81'/>
            </member-type>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;PersistData&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='5758d6f3'>
        <base-class access='public' layout-offset-in-bits='0' type-id='b3c054a9'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='58f15a92'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='b996b313' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='de7950b9'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='5ba9ee93' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='0852f292'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_List_node&lt;PersistData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='56f030b2'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='95370a30' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='b1ecbf03'/>
            </member-type>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;PtrData*&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='d060b589'>
        <base-class access='public' layout-offset-in-bits='0' type-id='8305bfbf'/>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='7a51dc7f' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='97' column='1' id='0ad00282'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='pointer' type-id='7182b119' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='99' column='1' id='e7c92249'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='value_type' type-id='8967de09' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='103' column='1' id='3116b9e2'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='rebind&lt;std::_List_node&lt;PtrData*&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='106' column='1' id='1f3fa8fc'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='5a450888' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='107' column='1' id='64ff8eb1'/>
            </member-type>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;PtrData&gt;' size-in-bits='8' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/allocator.h' line='94' column='1' id='c3422e51'>
        <base-class access='public' layout-offset-in-bits='0' type-id='32cdc1b7'/>
        <member-type access='private'>
