<abi-corpus version='2.1' path='data/test-read-dwarf/test21-pr19092.so'>
  <elf-needed>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Z10cpp_assertP10cpp_readerPKc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z10cpp_defineP10cpp_readerPKc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z10cpp_finishP10cpp_readerP8_IO_FILE' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z10cpp_lookupP10cpp_readerPKhj' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z10deps_writePK4depsP8_IO_FILEj' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z10get_spacesPKc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z10ht_destroyP2ht' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z10seen_errorv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='funcs' size='72' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='global_dc' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='helpflag' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='htab_eq_pointer' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='htab_hash_pointer' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='identifier_to_locale_alloc' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='identifier_to_locale_free' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='input_location' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lderrout' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ldout' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libiberty_concat_ptr' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libiberty_demanglers' size='264' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='line_table' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='locale_encoding' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='locale_utf8' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='no_demangle' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='num_expanded_macros_counter' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='num_macro_tokens_counter' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='open_quote' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pkgversion_string' size='7' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='progname' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rtl_zone' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='stderr@@GLIBC_2.2.5' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='stdin@@GLIBC_2.2.5' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='stdout@@GLIBC_2.2.5' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='symbol_stack' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='symbol_stack_obstack' size='88' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='temporary_firstobj' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='temporary_obstack' size='88' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tree_id_zone' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tree_zone' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='version_string' size='6' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vflag' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../.././gcc/collect2-aix.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../.././gcc/collect2.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1024' id='e3204322'>
      <subrange length='128' type-id='4c87fef4' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='4c87fef4' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='4c87fef4' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <subrange length='4' type-id='4c87fef4' id='16fe7105'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='ce184e0c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='80f4b756' size-in-bits='3840' id='1605a9cc'>
      <subrange length='60' type-id='4c87fef4' id='b114e3c3'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='384' id='73b82f0f'>
      <subrange length='12' type-id='4c87fef4' id='84827bdc'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='192' id='5d34b9c7'>
      <subrange length='3' type-id='4c87fef4' id='56f209d2'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <type-decl name='sizetype' size-in-bits='64' id='4c87fef4'/>
    <array-type-def dimensions='1' type-id='ce184e0c' size-in-bits='192' id='1caa07cb'>
      <subrange length='1' type-id='4c87fef4' id='52f813b4'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <class-decl name='_obstack_chunk' size-in-bits='192' is-struct='yes' visibility='default' filepath='../.././gcc/../include/obstack.h' line='157' column='1' id='8b61fc63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='limit' type-id='26a90f95' visibility='default' filepath='../.././gcc/../include/obstack.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='b82ee913' visibility='default' filepath='../.././gcc/../include/obstack.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='contents' type-id='8e0573fd' visibility='default' filepath='../.././gcc/../include/obstack.h' line='161' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='lc_reason' filepath='../.././gcc/../libcpp/include/line-map.h' line='37' column='1' id='0894acca'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LC_ENTER' value='0'/>
      <enumerator name='LC_LEAVE' value='1'/>
      <enumerator name='LC_RENAME' value='2'/>
      <enumerator name='LC_RENAME_VERBATIM' value='3'/>
      <enumerator name='LC_ENTER_MACRO' value='4'/>
    </enum-decl>
    <typedef-decl name='linenum_type' type-id='f0981eeb' filepath='../.././gcc/../libcpp/include/line-map.h' line='48' column='1' id='edf70f83'/>
    <typedef-decl name='source_location' type-id='f0981eeb' filepath='../.././gcc/../libcpp/include/line-map.h' line='51' column='1' id='a4ae40b1'/>
    <class-decl name='line_map_ordinary' size-in-bits='192' is-struct='yes' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='71' column='1' id='15693919'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='to_file' type-id='80f4b756' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='to_line' type-id='edf70f83' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='included_from' type-id='95e97e5e' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sysp' type-id='002ac4a6' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='column_bits' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='line_map_macro' size-in-bits='256' is-struct='yes' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='105' column='1' id='761449d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='macro' type-id='6646eec7' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_tokens' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='macro_locations' type-id='cb7770a4' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='expansion' type-id='a4ae40b1' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='175' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='diagnostic_context' type-id='5a15c7a2' filepath='../.././gcc/coretypes.h' line='74' column='1' id='20b4ef87'/>
    <enum-decl name='diagnostic_t' naming-typedef-id='f1ca66d0' linkage-name='12diagnostic_t' filepath='../.././gcc/diagnostic-core.h' line='32' column='1' id='c32d6d4c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DK_UNSPECIFIED' value='0'/>
      <enumerator name='DK_IGNORED' value='1'/>
      <enumerator name='DK_FATAL' value='2'/>
      <enumerator name='DK_ICE' value='3'/>
      <enumerator name='DK_ERROR' value='4'/>
      <enumerator name='DK_SORRY' value='5'/>
      <enumerator name='DK_WARNING' value='6'/>
      <enumerator name='DK_ANACHRONISM' value='7'/>
      <enumerator name='DK_NOTE' value='8'/>
      <enumerator name='DK_DEBUG' value='9'/>
      <enumerator name='DK_PEDWARN' value='10'/>
      <enumerator name='DK_PERMERROR' value='11'/>
      <enumerator name='DK_LAST_DIAGNOSTIC_KIND' value='12'/>
      <enumerator name='DK_POP' value='13'/>
    </enum-decl>
    <typedef-decl name='diagnostic_t' type-id='c32d6d4c' filepath='../.././gcc/diagnostic-core.h' line='40' column='1' id='f1ca66d0'/>
    <class-decl name='diagnostic_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../.././gcc/diagnostic.h' line='31' column='1' id='97eb92bf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='message' type-id='33fec2a0' visibility='default' filepath='../.././gcc/diagnostic.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='location' type-id='801326d8' visibility='default' filepath='../.././gcc/diagnostic.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='override_column' type-id='f0981eeb' visibility='default' filepath='../.././gcc/diagnostic.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x_data' type-id='eaa32e2f' visibility='default' filepath='../.././gcc/diagnostic.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='kind' type-id='f1ca66d0' visibility='default' filepath='../.././gcc/diagnostic.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='option_index' type-id='95e97e5e' visibility='default' filepath='../.././gcc/diagnostic.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='diagnostic_info' type-id='97eb92bf' filepath='../.././gcc/diagnostic.h' line='42' column='1' id='6af2b5d8'/>
    <class-decl name='diagnostic_classification_change_t' size-in-bits='96' is-struct='yes' visibility='default' filepath='../.././gcc/diagnostic.h' line='47' column='1' id='1072b95f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='location' type-id='801326d8' visibility='default' filepath='../.././gcc/diagnostic.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='option' type-id='95e97e5e' visibility='default' filepath='../.././gcc/diagnostic.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='kind' type-id='f1ca66d0' visibility='default' filepath='../.././gcc/diagnostic.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='diagnostic_classification_change_t' type-id='1072b95f' filepath='../.././gcc/diagnostic.h' line='52' column='1' id='8c10789a'/>
    <typedef-decl name='diagnostic_starter_fn' type-id='4bd02b1f' filepath='../.././gcc/diagnostic.h' line='55' column='1' id='bade7414'/>
    <typedef-decl name='diagnostic_finalizer_fn' type-id='bade7414' filepath='../.././gcc/diagnostic.h' line='57' column='1' id='a284bf51'/>
    <class-decl name='diagnostic_context' size-in-bits='1536' is-struct='yes' visibility='default' filepath='../.././gcc/diagnostic.h' line='61' column='1' id='5a15c7a2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='printer' type-id='674e59c0' visibility='default' filepath='../.././gcc/diagnostic.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='diagnostic_count' type-id='73b82f0f' visibility='default' filepath='../.././gcc/diagnostic.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='some_warnings_are_errors' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='warning_as_error_requested' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='n_opts' type-id='95e97e5e' visibility='default' filepath='../.././gcc/diagnostic.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='classify_diagnostic' type-id='e92905fd' visibility='default' filepath='../.././gcc/diagnostic.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='classification_history' type-id='99a07997' visibility='default' filepath='../.././gcc/diagnostic.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='n_classification_history' type-id='95e97e5e' visibility='default' filepath='../.././gcc/diagnostic.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='push_list' type-id='7292109c' visibility='default' filepath='../.././gcc/diagnostic.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='n_push' type-id='95e97e5e' visibility='default' filepath='../.././gcc/diagnostic.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='show_option_requested' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='808'>
        <var-decl name='abort_on_error' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='show_column' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='824'>
        <var-decl name='pedantic_errors' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='permissive' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='opt_permissive' type-id='95e97e5e' visibility='default' filepath='../.././gcc/diagnostic.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='fatal_errors' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='904'>
        <var-decl name='dc_inhibit_warnings' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='912'>
        <var-decl name='dc_warn_system_headers' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='max_errors' type-id='f0981eeb' visibility='default' filepath='../.././gcc/diagnostic.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='begin_diagnostic' type-id='bade7414' visibility='default' filepath='../.././gcc/diagnostic.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='end_diagnostic' type-id='a284bf51' visibility='default' filepath='../.././gcc/diagnostic.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='internal_error' type-id='e6b16434' visibility='default' filepath='../.././gcc/diagnostic.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='option_enabled' type-id='2e711a2a' visibility='default' filepath='../.././gcc/diagnostic.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='option_state' type-id='eaa32e2f' visibility='default' filepath='../.././gcc/diagnostic.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='option_name' type-id='b6d26cb2' visibility='default' filepath='../.././gcc/diagnostic.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='x_data' type-id='eaa32e2f' visibility='default' filepath='../.././gcc/diagnostic.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='last_module' type-id='27b3940b' visibility='default' filepath='../.././gcc/diagnostic.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='lock' type-id='95e97e5e' visibility='default' filepath='../.././gcc/diagnostic.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='inhibit_notes_p' type-id='c894953d' visibility='default' filepath='../.././gcc/diagnostic.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='location_t' type-id='a4ae40b1' filepath='../.././gcc/input.h' line='44' column='1' id='801326d8'/>
    <class-decl name='text_info' size-in-bits='320' is-struct='yes' naming-typedef-id='33fec2a0' visibility='default' filepath='../.././gcc/pretty-print.h' line='34' column='1' id='6b5408ef'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format_spec' type-id='80f4b756' visibility='default' filepath='../.././gcc/pretty-print.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='args_ptr' type-id='50bcf651' visibility='default' filepath='../.././gcc/pretty-print.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='err_no' type-id='95e97e5e' visibility='default' filepath='../.././gcc/pretty-print.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='locus' type-id='5b7c6b95' visibility='default' filepath='../.././gcc/pretty-print.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_data' type-id='63e171df' visibility='default' filepath='../.././gcc/pretty-print.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='text_info' type-id='6b5408ef' filepath='../.././gcc/pretty-print.h' line='40' column='1' id='33fec2a0'/>
    <enum-decl name='diagnostic_prefixing_rule_t' naming-typedef-id='50992f40' linkage-name='27diagnostic_prefixing_rule_t' filepath='../.././gcc/pretty-print.h' line='48' column='1' id='6ae5252c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DIAGNOSTICS_SHOW_PREFIX_ONCE' value='0'/>
      <enumerator name='DIAGNOSTICS_SHOW_PREFIX_NEVER' value='1'/>
      <enumerator name='DIAGNOSTICS_SHOW_PREFIX_EVERY_LINE' value='2'/>
    </enum-decl>
    <typedef-decl name='diagnostic_prefixing_rule_t' type-id='6ae5252c' filepath='../.././gcc/pretty-print.h' line='52' column='1' id='50992f40'/>
    <class-decl name='chunk_info' size-in-bits='3904' is-struct='yes' visibility='default' filepath='../.././gcc/pretty-print.h' line='59' column='1' id='78b47b1b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='f27c1acb' visibility='default' filepath='../.././gcc/pretty-print.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='args' type-id='1605a9cc' visibility='default' filepath='../.././gcc/pretty-print.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='output_buffer' size-in-bits='2688' is-struct='yes' naming-typedef-id='bbb19be4' visibility='default' filepath='../.././gcc/pretty-print.h' line='76' column='1' id='920dff2f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='formatted_obstack' type-id='c7763f94' visibility='default' filepath='../.././gcc/pretty-print.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='chunk_obstack' type-id='c7763f94' visibility='default' filepath='../.././gcc/pretty-print.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='obstack' type-id='c6cba642' visibility='default' filepath='../.././gcc/pretty-print.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='cur_chunk_array' type-id='f27c1acb' visibility='default' filepath='../.././gcc/pretty-print.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='stream' type-id='822cd80b' visibility='default' filepath='../.././gcc/pretty-print.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='line_length' type-id='95e97e5e' visibility='default' filepath='../.././gcc/pretty-print.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='digit_buffer' type-id='e3204322' visibility='default' filepath='../.././gcc/pretty-print.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='output_buffer' type-id='920dff2f' filepath='../.././gcc/pretty-print.h' line='100' column='1' id='bbb19be4'/>
    <enum-decl name='pp_padding' naming-typedef-id='17933c42' linkage-name='10pp_padding' filepath='../.././gcc/pretty-print.h' line='106' column='1' id='b8889f8e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='pp_none' value='0'/>
      <enumerator name='pp_before' value='1'/>
      <enumerator name='pp_after' value='2'/>
    </enum-decl>
    <typedef-decl name='pp_padding' type-id='b8889f8e' filepath='../.././gcc/pretty-print.h' line='108' column='1' id='17933c42'/>
    <class-decl name='pp_wrapping_mode_t' size-in-bits='64' is-struct='yes' naming-typedef-id='84d9f8be' visibility='default' filepath='../.././gcc/pretty-print.h' line='113' column='1' id='f937c5ab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rule' type-id='50992f40' visibility='default' filepath='../.././gcc/pretty-print.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='line_cutoff' type-id='95e97e5e' visibility='default' filepath='../.././gcc/pretty-print.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pp_wrapping_mode_t' type-id='f937c5ab' filepath='../.././gcc/pretty-print.h' line='120' column='1' id='84d9f8be'/>
    <typedef-decl name='pretty_printer' type-id='d084944a' filepath='../.././gcc/pretty-print.h' line='135' column='1' id='a9d58e0b'/>
    <typedef-decl name='printer_fn' type-id='bbf6a6d7' filepath='../.././gcc/pretty-print.h' line='136' column='1' id='e43ebba5'/>
    <class-decl name='pretty_print_info' size-in-bits='448' is-struct='yes' visibility='default' filepath='../.././gcc/pretty-print.h' line='159' column='1' id='d084944a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='b9fd14c7' visibility='default' filepath='../.././gcc/pretty-print.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefix' type-id='80f4b756' visibility='default' filepath='../.././gcc/pretty-print.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='padding' type-id='17933c42' visibility='default' filepath='../.././gcc/pretty-print.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='maximum_length' type-id='95e97e5e' visibility='default' filepath='../.././gcc/pretty-print.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='indent_skip' type-id='95e97e5e' visibility='default' filepath='../.././gcc/pretty-print.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='wrapping' type-id='84d9f8be' visibility='default' filepath='../.././gcc/pretty-print.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format_decoder' type-id='e43ebba5' visibility='default' filepath='../.././gcc/pretty-print.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='emitted_prefix' type-id='c894953d' visibility='default' filepath='../.././gcc/pretty-print.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='392'>
        <var-decl name='need_newline' type-id='c894953d' visibility='default' filepath='../.././gcc/pretty-print.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='translate_identifiers' type-id='c894953d' visibility='default' filepath='../.././gcc/pretty-print.h' line='198' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='obstack' size-in-bits='704' is-struct='yes' visibility='default' filepath='../.././libcpp/../include/obstack.h' line='164' column='1' id='c7763f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='chunk_size' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../include/obstack.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='chunk' type-id='b82ee913' visibility='default' filepath='../.././gcc/../include/obstack.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='object_base' type-id='26a90f95' visibility='default' filepath='../.././gcc/../include/obstack.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_free' type-id='26a90f95' visibility='default' filepath='../.././gcc/../include/obstack.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='chunk_limit' type-id='26a90f95' visibility='default' filepath='../.././gcc/../include/obstack.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='temp' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../include/obstack.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='alignment_mask' type-id='95e97e5e' visibility='default' filepath='../.././gcc/../include/obstack.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='chunkfun' type-id='83219da5' visibility='default' filepath='../.././gcc/../include/obstack.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='freefun' type-id='f8358ecc' visibility='default' filepath='../.././gcc/../include/obstack.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='extra_arg' type-id='eaa32e2f' visibility='default' filepath='../.././gcc/../include/obstack.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='use_extra_arg' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../include/obstack.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='641'>
        <var-decl name='maybe_empty_object' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../include/obstack.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='642'>
        <var-decl name='alloc_failed' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../include/obstack.h' line='184' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpp_hashnode' size-in-bits='256' is-struct='yes' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='676' column='1' id='50f860cf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ident' type-id='58342aa9' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_directive' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129'>
        <var-decl name='directive_index' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='rid_code' type-id='002ac4a6' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='type' type-id='776c9ea1' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='150'>
        <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value' type-id='fbabea4d' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='686' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='line_map' size-in-bits='320' is-struct='yes' visibility='default' filepath='../.././libcpp/include/line-map.h' line='204' column='1' id='c06dbdd6'>
      <member-type access='public'>
        <union-decl name='map_u' size-in-bits='256' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='210' column='1' id='f9833753'>
          <data-member access='public'>
            <var-decl name='ordinary' type-id='15693919' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='211' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='macro' type-id='761449d1' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='212' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start_location' type-id='a4ae40b1' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reason' type-id='0894acca' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='f9833753' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='213' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__gnuc_va_list' type-id='1caa07cb' filepath='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/prev-gcc/include/stdarg.h' line='40' column='1' id='262941ea'/>
    <typedef-decl name='va_list' type-id='262941ea' filepath='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/prev-gcc/include/stdarg.h' line='102' column='1' id='2aee9912'/>
    <typedef-decl name='size_t' type-id='7359adad' filepath='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/prev-gcc/include/stddef.h' line='213' column='1' id='b59d7dce'/>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/stat.h' line='46' column='1' id='aafc373f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='35ed8932' visibility='default' filepath='/usr/include/bits/stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='e43e523d' visibility='default' filepath='/usr/include/bits/stat.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='80f0b9df' visibility='default' filepath='/usr/include/bits/stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='e1c52942' visibility='default' filepath='/usr/include/bits/stat.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='cc5fcceb' visibility='default' filepath='/usr/include/bits/stat.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='d94ec6d9' visibility='default' filepath='/usr/include/bits/stat.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='95e97e5e' visibility='default' filepath='/usr/include/bits/stat.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='35ed8932' visibility='default' filepath='/usr/include/bits/stat.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='79989e9c' visibility='default' filepath='/usr/include/bits/stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='d3f10a7f' visibility='default' filepath='/usr/include/bits/stat.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='dbc43803' visibility='default' filepath='/usr/include/bits/stat.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='a9c79a1f' visibility='default' filepath='/usr/include/bits/stat.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='a9c79a1f' visibility='default' filepath='/usr/include/bits/stat.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='a9c79a1f' visibility='default' filepath='/usr/include/bits/stat.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__unused' type-id='5d34b9c7' visibility='default' filepath='/usr/include/bits/stat.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='7359adad' filepath='/usr/include/bits/types.h' line='134' column='1' id='35ed8932'/>
    <typedef-decl name='__uid_t' type-id='f0981eeb' filepath='/usr/include/bits/types.h' line='135' column='1' id='cc5fcceb'/>
    <typedef-decl name='__gid_t' type-id='f0981eeb' filepath='/usr/include/bits/types.h' line='136' column='1' id='d94ec6d9'/>
    <typedef-decl name='__ino_t' type-id='7359adad' filepath='/usr/include/bits/types.h' line='137' column='1' id='e43e523d'/>
    <typedef-decl name='__mode_t' type-id='f0981eeb' filepath='/usr/include/bits/types.h' line='139' column='1' id='e1c52942'/>
    <typedef-decl name='__nlink_t' type-id='7359adad' filepath='/usr/include/bits/types.h' line='140' column='1' id='80f0b9df'/>
    <typedef-decl name='__off_t' type-id='bd54fe1a' filepath='/usr/include/bits/types.h' line='141' column='1' id='79989e9c'/>
    <typedef-decl name='__off64_t' type-id='bd54fe1a' filepath='/usr/include/bits/types.h' line='142' column='1' id='724e4de6'/>
    <typedef-decl name='__time_t' type-id='bd54fe1a' filepath='/usr/include/bits/types.h' line='149' column='1' id='65eda9c0'/>
    <typedef-decl name='__blksize_t' type-id='bd54fe1a' filepath='/usr/include/bits/types.h' line='164' column='1' id='d3f10a7f'/>
    <typedef-decl name='__blkcnt_t' type-id='bd54fe1a' filepath='/usr/include/bits/types.h' line='169' column='1' id='dbc43803'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='/usr/include/libio.h' line='180' column='1' id='bb4788fa'/>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='186' column='1' id='010ae0b9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='e4c6fa61' visibility='default' filepath='/usr/include/libio.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='dca988a5' visibility='default' filepath='/usr/include/libio.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='95e97e5e' visibility='default' filepath='/usr/include/libio.h' line='192' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='271' column='1' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='/usr/include/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='/usr/include/libio.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='/usr/include/libio.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='/usr/include/libio.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='/usr/include/libio.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='/usr/include/libio.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='8efea9e5' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='/usr/include/libio.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='/usr/include/libio.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='eaa32e2f' visibility='default' filepath='/usr/include/libio.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='eaa32e2f' visibility='default' filepath='/usr/include/libio.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='eaa32e2f' visibility='default' filepath='/usr/include/libio.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='eaa32e2f' visibility='default' filepath='/usr/include/libio.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='/usr/include/libio.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='/usr/include/libio.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='/usr/include/libio.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__sighandler_t' type-id='03347643' filepath='/usr/include/signal.h' line='84' column='1' id='8cdd9566'/>
    <typedef-decl name='FILE' type-id='ec1ed955' filepath='/usr/include/stdio.h' line='49' column='1' id='aa12d1ba'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='120' column='1' id='a9c79a1f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='65eda9c0' visibility='default' filepath='/usr/include/time.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='bd54fe1a' visibility='default' filepath='/usr/include/time.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='8b61fc63' size-in-bits='64' id='b82ee913'/>
    <pointer-type-def type-id='3a60f6f9' size-in-bits='64' id='83219da5'/>
    <pointer-type-def type-id='45d3a063' size-in-bits='64' id='bbf6a6d7'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <pointer-type-def type-id='14a4fa90' size-in-bits='64' id='b6d26cb2'/>
    <qualified-type-def type-id='26a90f95' const='yes' id='57de658a'/>
    <pointer-type-def type-id='57de658a' size-in-bits='64' id='f319fae0'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <pointer-type-def type-id='9b23c9ad' size-in-bits='64' id='c0563f85'/>
    <pointer-type-def type-id='78b47b1b' size-in-bits='64' id='f27c1acb'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='c06dbdd6' const='yes' id='3ac18e83'/>
    <pointer-type-def type-id='3ac18e83' size-in-bits='64' id='27b3940b'/>
    <pointer-type-def type-id='50f860cf' size-in-bits='64' id='6646eec7'/>
    <pointer-type-def type-id='8c10789a' size-in-bits='64' id='99a07997'/>
    <pointer-type-def type-id='20b4ef87' size-in-bits='64' id='f2052690'/>
    <pointer-type-def type-id='6af2b5d8' size-in-bits='64' id='629c5f17'/>
    <pointer-type-def type-id='f1ca66d0' size-in-bits='64' id='e92905fd'/>
    <pointer-type-def type-id='c70fa2e8' size-in-bits='64' id='2e711a2a'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='801326d8' size-in-bits='64' id='5b7c6b95'/>
    <pointer-type-def type-id='c7763f94' size-in-bits='64' id='c6cba642'/>
    <pointer-type-def type-id='bbb19be4' size-in-bits='64' id='b9fd14c7'/>
    <pointer-type-def type-id='2f223614' size-in-bits='64' id='b19f7322'/>
    <pointer-type-def type-id='a9d58e0b' size-in-bits='64' id='674e59c0'/>
    <pointer-type-def type-id='a4ae40b1' size-in-bits='64' id='cb7770a4'/>
    <pointer-type-def type-id='aafc373f' size-in-bits='64' id='4330df87'/>
    <pointer-type-def type-id='33fec2a0' size-in-bits='64' id='77cd2cd7'/>
    <pointer-type-def type-id='ce184e0c' size-in-bits='64' id='38f76a2a'/>
    <pointer-type-def type-id='2aee9912' size-in-bits='64' id='50bcf651'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <pointer-type-def type-id='f097af9a' size-in-bits='64' id='e6b16434'/>
    <pointer-type-def type-id='47a51e13' size-in-bits='64' id='4bd02b1f'/>
    <pointer-type-def type-id='f712e2b7' size-in-bits='64' id='03347643'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='17d4a342' size-in-bits='64' id='f8358ecc'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='f47265b3' size-in-bits='64' id='7abf4af7'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <class-decl name='pex_obj' size-in-bits='1152' is-struct='yes' visibility='default' filepath='../.././libiberty/pex-common.h' line='54' column='1' id='2f223614'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='95e97e5e' visibility='default' filepath='../.././libiberty/pex-common.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pname' type-id='80f4b756' visibility='default' filepath='../.././libiberty/pex-common.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tempbase' type-id='80f4b756' visibility='default' filepath='../.././libiberty/pex-common.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_input' type-id='95e97e5e' visibility='default' filepath='../.././libiberty/pex-common.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='next_input_name' type-id='26a90f95' visibility='default' filepath='../.././libiberty/pex-common.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_input_name_allocated' type-id='95e97e5e' visibility='default' filepath='../.././libiberty/pex-common.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='stderr_pipe' type-id='95e97e5e' visibility='default' filepath='../.././libiberty/pex-common.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='count' type-id='95e97e5e' visibility='default' filepath='../.././libiberty/pex-common.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='children' type-id='6d654359' visibility='default' filepath='../.././libiberty/pex-common.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='status' type-id='7292109c' visibility='default' filepath='../.././libiberty/pex-common.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='time' type-id='39dc0ec4' visibility='default' filepath='../.././libiberty/pex-common.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='number_waited' type-id='95e97e5e' visibility='default' filepath='../.././libiberty/pex-common.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='input_file' type-id='822cd80b' visibility='default' filepath='../.././libiberty/pex-common.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='read_output' type-id='822cd80b' visibility='default' filepath='../.././libiberty/pex-common.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='read_err' type-id='822cd80b' visibility='default' filepath='../.././libiberty/pex-common.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='remove_count' type-id='95e97e5e' visibility='default' filepath='../.././libiberty/pex-common.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='remove' type-id='9b23c9ad' visibility='default' filepath='../.././libiberty/pex-common.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='funcs' type-id='6a202c55' visibility='default' filepath='../.././libiberty/pex-common.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='sysdep' type-id='eaa32e2f' visibility='default' filepath='../.././libiberty/pex-common.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='filename_ncmp' filepath='../.././gcc/../include/filenames.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='unlock_std_streams' filepath='../.././gcc/../include/libiberty.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fopen_unlocked' filepath='../.././gcc/../include/libiberty.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='expandargv' filepath='../.././gcc/../include/libiberty.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7292109c'/>
      <parameter type-id='c0563f85'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='writeargv' filepath='../.././gcc/../include/libiberty.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lbasename' filepath='../.././gcc/../include/libiberty.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='concat' filepath='../.././gcc/../include/libiberty.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='make_temp_file' filepath='../.././gcc/../include/libiberty.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='unlink_if_ordinary' filepath='../.././gcc/../include/libiberty.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756' name='name' filepath='../.././gcc/collect2.c' line='475' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='xmalloc_set_program_name' filepath='../.././gcc/../include/libiberty.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='xmalloc' filepath='../.././gcc/../include/libiberty.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='xcalloc' filepath='../.././gcc/../include/libiberty.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='xstrdup' filepath='../.././gcc/../include/libiberty.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='pex_init' filepath='../.././gcc/../include/libiberty.h' line='401' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='b19f7322'/>
    </function-decl>
    <function-decl name='pex_run' filepath='../.././gcc/../include/libiberty.h' line='496' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b19f7322'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='f319fae0'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='7292109c'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='pex_read_output' filepath='../.././gcc/../include/libiberty.h' line='538' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b19f7322'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='pex_get_status' filepath='../.././gcc/../include/libiberty.h' line='552' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b19f7322'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7292109c'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pex_free' filepath='../.././gcc/../include/libiberty.h' line='573' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b19f7322'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_obstack_newchunk' filepath='../.././gcc/../include/obstack.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='c6cba642'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_obstack_begin' filepath='../.././gcc/../include/obstack.h' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='c6cba642'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7abf4af7'/>
      <parameter type-id='b7f9d8e6'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='obstack_free' filepath='../.././gcc/../include/obstack.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='c6cba642'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <var-decl name='do_collecting' type-id='95e97e5e' mangled-name='do_collecting' visibility='default' filepath='../.././gcc/collect2.c' line='147' column='1' elf-symbol-id='do_collecting'/>
    <var-decl name='no_demangle' type-id='95e97e5e' mangled-name='no_demangle' visibility='default' filepath='../.././gcc/collect2.c' line='161' column='1' elf-symbol-id='no_demangle'/>
    <var-decl name='vflag' type-id='c894953d' mangled-name='vflag' visibility='default' filepath='../.././gcc/collect2.c' line='179' column='1' elf-symbol-id='vflag'/>
    <var-decl name='debug' type-id='c894953d' mangled-name='debug' visibility='default' filepath='../.././gcc/collect2.c' line='197' column='1' elf-symbol-id='debug'/>
    <var-decl name='helpflag' type-id='c894953d' mangled-name='helpflag' visibility='default' filepath='../.././gcc/collect2.c' line='198' column='1' elf-symbol-id='helpflag'/>
    <var-decl name='ldout' type-id='80f4b756' mangled-name='ldout' visibility='default' filepath='../.././gcc/collect2.c' line='208' column='1' elf-symbol-id='ldout'/>
    <var-decl name='lderrout' type-id='80f4b756' mangled-name='lderrout' visibility='default' filepath='../.././gcc/collect2.c' line='209' column='1' elf-symbol-id='lderrout'/>
    <var-decl name='c_file_name' type-id='80f4b756' mangled-name='c_file_name' visibility='default' filepath='../.././gcc/collect2.c' line='216' column='1' elf-symbol-id='c_file_name'/>
    <var-decl name='temporary_obstack' type-id='c7763f94' mangled-name='temporary_obstack' visibility='default' filepath='../.././gcc/collect2.c' line='229' column='1' elf-symbol-id='temporary_obstack'/>
    <var-decl name='temporary_firstobj' type-id='26a90f95' mangled-name='temporary_firstobj' visibility='default' filepath='../.././gcc/collect2.c' line='230' column='1' elf-symbol-id='temporary_firstobj'/>
    <function-decl name='notice' mangled-name='_Z6noticePKcz' filepath='../.././gcc/collect2.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z6noticePKcz'>
      <parameter type-id='80f4b756' name='cmsgid' filepath='../.././gcc/collect2.c' line='423' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='notice_translated' mangled-name='_Z17notice_translatedPKcz' filepath='../.././gcc/collect2.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17notice_translatedPKcz'>
      <parameter type-id='80f4b756' name='cmsgid' filepath='../.././gcc/collect2.c' line='423' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='file_exists' mangled-name='_Z11file_existsPKc' filepath='../.././gcc/collect2.c' line='475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z11file_existsPKc'>
      <parameter type-id='80f4b756' name='name' filepath='../.././gcc/collect2.c' line='475' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='dump_file' mangled-name='_Z9dump_filePKcP8_IO_FILE' filepath='../.././gcc/collect2.c' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z9dump_filePKcP8_IO_FILE'>
      <parameter type-id='80f4b756' name='name' filepath='../.././gcc/collect2.c' line='513' column='1'/>
      <parameter type-id='822cd80b' name='to' filepath='../.././gcc/collect2.c' line='513' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='main' mangled-name='main' filepath='../.././gcc/collect2.c' line='1016' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='main'>
      <parameter type-id='95e97e5e' name='argc' filepath='../.././gcc/collect2.c' line='1016' column='1'/>
      <parameter type-id='9b23c9ad' name='argv' filepath='../.././gcc/collect2.c' line='1016' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='collect_wait' mangled-name='_Z12collect_waitPKcP7pex_obj' filepath='../.././gcc/collect2.c' line='1958' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z12collect_waitPKcP7pex_obj'>
      <parameter type-id='80f4b756' name='prog' filepath='../.././gcc/collect2.c' line='1958' column='1'/>
      <parameter type-id='b19f7322' name='pex' filepath='../.././gcc/collect2.c' line='1958' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='collect_execute' mangled-name='_Z15collect_executePKcPPcS0_S0_i' filepath='../.././gcc/collect2.c' line='2004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15collect_executePKcPPcS0_S0_i'>
      <parameter type-id='80f4b756' name='prog' filepath='../.././gcc/collect2.c' line='2004' column='1'/>
      <parameter type-id='9b23c9ad' name='argv' filepath='../.././gcc/collect2.c' line='2004' column='1'/>
      <parameter type-id='80f4b756' name='outname' filepath='../.././gcc/collect2.c' line='2004' column='1'/>
      <parameter type-id='80f4b756' name='errname' filepath='../.././gcc/collect2.c' line='2005' column='1'/>
      <parameter type-id='95e97e5e' name='flags' filepath='../.././gcc/collect2.c' line='2005' column='1'/>
      <return type-id='b19f7322'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='7292109c'/>
    </function-decl>
    <function-decl name='gettext' filepath='/usr/include/libintl.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='ngettext' filepath='/usr/include/libintl.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='7359adad'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__uflow' filepath='/usr/include/libio.h' line='417' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='dca988a5'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__overflow' filepath='/usr/include/libio.h' line='418' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='dca988a5'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/malloc.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='signal' filepath='/usr/include/signal.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='8cdd9566'/>
      <return type-id='8cdd9566'/>
    </function-decl>
    <function-decl name='raise' filepath='/usr/include/signal.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fflush_unlocked' filepath='/usr/include/stdio.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='355' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='printf' filepath='/usr/include/stdio.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='38f76a2a'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fgets_unlocked' filepath='/usr/include/stdio.h' line='644' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='fputs_unlocked' filepath='/usr/include/stdio.h' line='721' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fread_unlocked' filepath='/usr/include/stdio.h' line='732' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='822cd80b'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='atexit' filepath='/usr/include/stdlib.h' line='518' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='953b12f8'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='exit' filepath='/usr/include/stdlib.h' line='544' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='567' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strcoll' filepath='/usr/include/string.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strxfrm' filepath='/usr/include/string.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='strtok' filepath='/usr/include/string.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strsignal' filepath='/usr/include/string.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__xstat' filepath='/usr/include/sys/stat.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='4330df87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='845' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756' name='name' filepath='../.././gcc/collect2.c' line='475' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='3a60f6f9'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='bd54fe1a'/>
      <return type-id='b82ee913'/>
    </function-type>
    <function-type size-in-bits='64' id='45d3a063'>
      <parameter type-id='674e59c0'/>
      <parameter type-id='77cd2cd7'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='c894953d'/>
      <parameter type-id='c894953d'/>
      <parameter type-id='c894953d'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='14a4fa90'>
      <parameter type-id='f2052690'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='f1ca66d0'/>
      <parameter type-id='f1ca66d0'/>
      <return type-id='26a90f95'/>
    </function-type>
    <function-type size-in-bits='64' id='c70fa2e8'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='f097af9a'>
      <parameter type-id='f2052690'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='50bcf651'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='47a51e13'>
      <parameter type-id='f2052690'/>
      <parameter type-id='629c5f17'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f712e2b7'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='17d4a342'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b82ee913'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f47265b3'>
      <parameter type-id='bd54fe1a'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <type-decl name='void' id='48b5725f'/>
    <function-type size-in-bits='64' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='848c08bf'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <function-type size-in-bits='64' id='46281162'>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../.././gcc/diagnostic.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
    <typedef-decl name='line_map_realloc' type-id='09f6f8ed' filepath='../.././gcc/../libcpp/include/line-map.h' line='54' column='1' id='8a92ea36'/>
    <typedef-decl name='line_map_round_alloc_size_func' type-id='b7f0738a' filepath='../.././gcc/../libcpp/include/line-map.h' line='58' column='1' id='b510dfc9'/>
    <class-decl name='maps_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='244' column='1' id='033ee067'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='maps' type-id='4152489c' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='used' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cache' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='259' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='expanded_location' size-in-bits='192' is-struct='yes' naming-typedef-id='13eff86d' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='588' column='1' id='8740305e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='80f4b756' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='95e97e5e' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='column' type-id='95e97e5e' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sysp' type-id='c894953d' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='598' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='expanded_location' type-id='8740305e' filepath='../.././gcc/../libcpp/include/line-map.h' line='599' column='1' id='13eff86d'/>
    <enum-decl name='location_resolution_kind' filepath='../.././gcc/../libcpp/include/line-map.h' line='604' column='1' id='af285d75'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LRK_MACRO_EXPANSION_POINT' value='0'/>
      <enumerator name='LRK_SPELLING_LOCATION' value='1'/>
      <enumerator name='LRK_MACRO_DEFINITION_LOCATION' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' linkage-name='12diagnostic_t' filepath='../.././gcc/diagnostic-core.h' line='32' column='1' id='08f5ca17'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DK_UNSPECIFIED' value='0'/>
      <enumerator name='DK_IGNORED' value='1'/>
      <enumerator name='DK_FATAL' value='2'/>
      <enumerator name='DK_ICE' value='3'/>
      <enumerator name='DK_ERROR' value='4'/>
      <enumerator name='DK_SORRY' value='5'/>
      <enumerator name='DK_WARNING' value='6'/>
      <enumerator name='DK_ANACHRONISM' value='7'/>
      <enumerator name='DK_NOTE' value='8'/>
      <enumerator name='DK_DEBUG' value='9'/>
      <enumerator name='DK_PEDWARN' value='10'/>
      <enumerator name='DK_PERMERROR' value='11'/>
      <enumerator name='DK_LAST_DIAGNOSTIC_KIND' value='12'/>
      <enumerator name='DK_POP' value='13'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../.././gcc/pretty-print.h' line='34' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format_spec' type-id='80f4b756' visibility='default' filepath='../.././gcc/pretty-print.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='args_ptr' type-id='50bcf651' visibility='default' filepath='../.././gcc/pretty-print.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='err_no' type-id='95e97e5e' visibility='default' filepath='../.././gcc/pretty-print.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='locus' type-id='5b7c6b95' visibility='default' filepath='../.././gcc/pretty-print.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_data' type-id='63e171df' visibility='default' filepath='../.././gcc/pretty-print.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='line_maps' size-in-bits='704' is-struct='yes' visibility='default' filepath='../.././libcpp/include/line-map.h' line='263' column='1' id='91c18abf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='info_ordinary' type-id='033ee067' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='info_macro' type-id='033ee067' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='depth' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='trace_includes' type-id='c894953d' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='highest_location' type-id='a4ae40b1' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='highest_line' type-id='a4ae40b1' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='max_column_hint' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='reallocator' type-id='8a92ea36' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='round_alloc_size' type-id='b510dfc9' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='291' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='27b3940b' size-in-bits='64' id='a0b22ff3'/>
    <pointer-type-def type-id='c06dbdd6' size-in-bits='64' id='4152489c'/>
    <pointer-type-def type-id='91c18abf' size-in-bits='64' id='0bd89647'/>
    <pointer-type-def type-id='dbbc84e0' size-in-bits='64' id='b7f0738a'/>
    <pointer-type-def type-id='8190a159' size-in-bits='64' id='09f6f8ed'/>
    <function-decl name='concat_length' filepath='../.././gcc/../include/libiberty.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='7359adad'/>
    </function-decl>
    <function-decl name='concat_copy2' filepath='../.././gcc/../include/libiberty.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <var-decl name='progname' type-id='80f4b756' mangled-name='progname' visibility='default' filepath='../.././gcc/diagnostic.c' line='50' column='1' elf-symbol-id='progname'/>
    <var-decl name='global_dc' type-id='f2052690' mangled-name='global_dc' visibility='default' filepath='../.././gcc/diagnostic.c' line='54' column='1' elf-symbol-id='global_dc'/>
    <function-decl name='file_name_as_prefix' mangled-name='_Z19file_name_as_prefixPKc' filepath='../.././gcc/diagnostic.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19file_name_as_prefixPKc'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='diagnostic_initialize' mangled-name='_Z21diagnostic_initializeP18diagnostic_contexti' filepath='../.././gcc/diagnostic.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z21diagnostic_initializeP18diagnostic_contexti'>
      <parameter type-id='f2052690'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='diagnostic_finish' mangled-name='_Z17diagnostic_finishP18diagnostic_context' filepath='../.././gcc/diagnostic.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17diagnostic_finishP18diagnostic_context'>
      <parameter type-id='f2052690' name='context' filepath='../.././gcc/diagnostic.c' line='128' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='diagnostic_set_info_translated' mangled-name='_Z30diagnostic_set_info_translatedP15diagnostic_infoPKcPA1_13__va_list_tagj12diagnostic_t' filepath='../.././gcc/diagnostic.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z30diagnostic_set_info_translatedP15diagnostic_infoPKcPA1_13__va_list_tagj12diagnostic_t'>
      <parameter type-id='629c5f17' name='diagnostic' filepath='../.././gcc/diagnostic.c' line='150' column='1'/>
      <parameter type-id='80f4b756' name='msg' filepath='../.././gcc/diagnostic.c' line='150' column='1'/>
      <parameter type-id='50bcf651' name='args' filepath='../.././gcc/diagnostic.c' line='151' column='1'/>
      <parameter type-id='801326d8' name='location' filepath='../.././gcc/diagnostic.c' line='151' column='1'/>
      <parameter type-id='f1ca66d0' name='kind' filepath='../.././gcc/diagnostic.c' line='152' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='diagnostic_set_info' mangled-name='_Z19diagnostic_set_infoP15diagnostic_infoPKcPA1_13__va_list_tagj12diagnostic_t' filepath='../.././gcc/diagnostic.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19diagnostic_set_infoP15diagnostic_infoPKcPA1_13__va_list_tagj12diagnostic_t'>
      <parameter type-id='629c5f17' name='diagnostic' filepath='../.././gcc/diagnostic.c' line='150' column='1'/>
      <parameter type-id='80f4b756' name='msg' filepath='../.././gcc/diagnostic.c' line='150' column='1'/>
      <parameter type-id='50bcf651' name='args' filepath='../.././gcc/diagnostic.c' line='151' column='1'/>
      <parameter type-id='801326d8' name='location' filepath='../.././gcc/diagnostic.c' line='151' column='1'/>
      <parameter type-id='f1ca66d0' name='kind' filepath='../.././gcc/diagnostic.c' line='152' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='diagnostic_build_prefix' mangled-name='_Z23diagnostic_build_prefixP18diagnostic_contextP15diagnostic_info' filepath='../.././gcc/diagnostic.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z23diagnostic_build_prefixP18diagnostic_contextP15diagnostic_info'>
      <parameter type-id='f2052690' name='context' filepath='../.././gcc/diagnostic.c' line='176' column='1'/>
      <parameter type-id='629c5f17' name='diagnostic' filepath='../.././gcc/diagnostic.c' line='177' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='diagnostic_report_current_module' mangled-name='_Z32diagnostic_report_current_moduleP18diagnostic_contextj' filepath='../.././gcc/diagnostic.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z32diagnostic_report_current_moduleP18diagnostic_contextj'>
      <parameter type-id='f2052690' name='context' filepath='../.././gcc/diagnostic.c' line='258' column='1'/>
      <parameter type-id='801326d8' name='where' filepath='../.././gcc/diagnostic.c' line='258' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='default_diagnostic_starter' mangled-name='_Z26default_diagnostic_starterP18diagnostic_contextP15diagnostic_info' filepath='../.././gcc/diagnostic.c' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z26default_diagnostic_starterP18diagnostic_contextP15diagnostic_info'>
      <parameter type-id='f2052690'/>
      <parameter type-id='629c5f17'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='default_diagnostic_finalizer' mangled-name='_Z28default_diagnostic_finalizerP18diagnostic_contextP15diagnostic_info' filepath='../.././gcc/diagnostic.c' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z28default_diagnostic_finalizerP18diagnostic_contextP15diagnostic_info'>
      <parameter type-id='f2052690'/>
      <parameter type-id='629c5f17'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='diagnostic_classify_diagnostic' mangled-name='_Z30diagnostic_classify_diagnosticP18diagnostic_contexti12diagnostic_tj' filepath='../.././gcc/diagnostic.c' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z30diagnostic_classify_diagnosticP18diagnostic_contexti12diagnostic_tj'>
      <parameter type-id='f2052690' name='context' filepath='../.././gcc/diagnostic.c' line='323' column='1'/>
      <parameter type-id='95e97e5e' name='option_index' filepath='../.././gcc/diagnostic.c' line='324' column='1'/>
      <parameter type-id='f1ca66d0' name='new_kind' filepath='../.././gcc/diagnostic.c' line='325' column='1'/>
      <parameter type-id='801326d8' name='where' filepath='../.././gcc/diagnostic.c' line='326' column='1'/>
      <return type-id='f1ca66d0'/>
    </function-decl>
    <function-decl name='diagnostic_push_diagnostics' mangled-name='_Z27diagnostic_push_diagnosticsP18diagnostic_contextj' filepath='../.././gcc/diagnostic.c' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z27diagnostic_push_diagnosticsP18diagnostic_contextj'>
      <parameter type-id='f2052690' name='context' filepath='../.././gcc/diagnostic.c' line='258' column='1'/>
      <parameter type-id='801326d8' name='where' filepath='../.././gcc/diagnostic.c' line='258' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='diagnostic_pop_diagnostics' mangled-name='_Z26diagnostic_pop_diagnosticsP18diagnostic_contextj' filepath='../.././gcc/diagnostic.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z26diagnostic_pop_diagnosticsP18diagnostic_contextj'>
      <parameter type-id='f2052690' name='context' filepath='../.././gcc/diagnostic.c' line='258' column='1'/>
      <parameter type-id='801326d8' name='where' filepath='../.././gcc/diagnostic.c' line='258' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='diagnostic_report_diagnostic' mangled-name='_Z28diagnostic_report_diagnosticP18diagnostic_contextP15diagnostic_info' filepath='../.././gcc/diagnostic.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z28diagnostic_report_diagnosticP18diagnostic_contextP15diagnostic_info'>
      <parameter type-id='f2052690' name='context' filepath='../.././gcc/diagnostic.c' line='404' column='1'/>
      <parameter type-id='629c5f17' name='diagnostic' filepath='../.././gcc/diagnostic.c' line='405' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='trim_filename' mangled-name='_Z13trim_filenamePKc' filepath='../.././gcc/diagnostic.c' line='567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z13trim_filenamePKc'>
      <parameter type-id='80f4b756'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='verbatim' mangled-name='_Z8verbatimPKcz' filepath='../.././gcc/diagnostic.c' line='597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8verbatimPKcz'>
      <parameter type-id='80f4b756' name='cmsgid' filepath='../.././gcc/collect2.c' line='423' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='emit_diagnostic' mangled-name='_Z15emit_diagnostic12diagnostic_tjiPKcz' filepath='../.././gcc/diagnostic.c' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15emit_diagnostic12diagnostic_tjiPKcz'>
      <parameter type-id='f1ca66d0' name='kind' filepath='../.././gcc/diagnostic.c' line='614' column='1'/>
      <parameter type-id='801326d8' name='location' filepath='../.././gcc/diagnostic.c' line='614' column='1'/>
      <parameter type-id='95e97e5e' name='opt' filepath='../.././gcc/diagnostic.c' line='614' column='1'/>
      <parameter type-id='80f4b756' name='gmsgid' filepath='../.././gcc/diagnostic.c' line='615' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='inform' mangled-name='_Z6informjPKcz' filepath='../.././gcc/diagnostic.c' line='640' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z6informjPKcz'>
      <parameter type-id='801326d8' name='loc' filepath='../.././gcc/diagnostic.c' line='782' column='1'/>
      <parameter type-id='80f4b756' name='gmsgid' filepath='../.././gcc/diagnostic.c' line='782' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='inform_n' mangled-name='_Z8inform_njiPKcS0_z' filepath='../.././gcc/diagnostic.c' line='654' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8inform_njiPKcS0_z'>
      <parameter type-id='801326d8' name='location' filepath='../.././gcc/diagnostic.c' line='766' column='1'/>
      <parameter type-id='95e97e5e' name='n' filepath='../.././gcc/diagnostic.c' line='766' column='1'/>
      <parameter type-id='80f4b756' name='singular_gmsgid' filepath='../.././gcc/diagnostic.c' line='766' column='1'/>
      <parameter type-id='80f4b756' name='plural_gmsgid' filepath='../.././gcc/diagnostic.c' line='767' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='warning' mangled-name='_Z7warningiPKcz' filepath='../.././gcc/diagnostic.c' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7warningiPKcz'>
      <parameter type-id='95e97e5e' name='opt' filepath='../.././gcc/diagnostic.c' line='672' column='1'/>
      <parameter type-id='80f4b756' name='gmsgid' filepath='../.././gcc/diagnostic.c' line='672' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='warning_at' mangled-name='_Z10warning_atjiPKcz' filepath='../.././gcc/diagnostic.c' line='690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z10warning_atjiPKcz'>
      <parameter type-id='801326d8' name='location' filepath='../.././gcc/diagnostic.c' line='716' column='1'/>
      <parameter type-id='95e97e5e' name='opt' filepath='../.././gcc/diagnostic.c' line='716' column='1'/>
      <parameter type-id='80f4b756' name='gmsgid' filepath='../.././gcc/diagnostic.c' line='716' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='pedwarn' mangled-name='_Z7pedwarnjiPKcz' filepath='../.././gcc/diagnostic.c' line='716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7pedwarnjiPKcz'>
      <parameter type-id='801326d8' name='location' filepath='../.././gcc/diagnostic.c' line='716' column='1'/>
      <parameter type-id='95e97e5e' name='opt' filepath='../.././gcc/diagnostic.c' line='716' column='1'/>
      <parameter type-id='80f4b756' name='gmsgid' filepath='../.././gcc/diagnostic.c' line='716' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='permerror' mangled-name='_Z9permerrorjPKcz' filepath='../.././gcc/diagnostic.c' line='736' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z9permerrorjPKcz'>
      <parameter type-id='801326d8' name='location' filepath='../.././gcc/diagnostic.c' line='736' column='1'/>
      <parameter type-id='80f4b756' name='gmsgid' filepath='../.././gcc/diagnostic.c' line='736' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='error' mangled-name='_Z5errorPKcz' filepath='../.././gcc/diagnostic.c' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z5errorPKcz'>
      <parameter type-id='80f4b756' name='cmsgid' filepath='../.././gcc/collect2.c' line='423' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='error_n' mangled-name='_Z7error_njiPKcS0_z' filepath='../.././gcc/diagnostic.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7error_njiPKcS0_z'>
      <parameter type-id='801326d8' name='location' filepath='../.././gcc/diagnostic.c' line='766' column='1'/>
      <parameter type-id='95e97e5e' name='n' filepath='../.././gcc/diagnostic.c' line='766' column='1'/>
      <parameter type-id='80f4b756' name='singular_gmsgid' filepath='../.././gcc/diagnostic.c' line='766' column='1'/>
      <parameter type-id='80f4b756' name='plural_gmsgid' filepath='../.././gcc/diagnostic.c' line='767' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='error_at' mangled-name='_Z8error_atjPKcz' filepath='../.././gcc/diagnostic.c' line='782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8error_atjPKcz'>
      <parameter type-id='801326d8' name='loc' filepath='../.././gcc/diagnostic.c' line='782' column='1'/>
      <parameter type-id='80f4b756' name='gmsgid' filepath='../.././gcc/diagnostic.c' line='782' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='sorry' mangled-name='_Z5sorryPKcz' filepath='../.././gcc/diagnostic.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z5sorryPKcz'>
      <parameter type-id='80f4b756' name='cmsgid' filepath='../.././gcc/collect2.c' line='423' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='seen_error' mangled-name='_Z10seen_errorv' filepath='../.././gcc/diagnostic.c' line='811' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z10seen_errorv'>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='fatal_error' mangled-name='_Z11fatal_errorPKcz' filepath='../.././gcc/diagnostic.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z11fatal_errorPKcz'>
      <parameter type-id='80f4b756' name='cmsgid' filepath='../.././gcc/collect2.c' line='423' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='internal_error' mangled-name='_Z14internal_errorPKcz' filepath='../.././gcc/diagnostic.c' line='838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z14internal_errorPKcz'>
      <parameter type-id='80f4b756' name='cmsgid' filepath='../.././gcc/collect2.c' line='423' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnotice' mangled-name='_Z7fnoticeP8_IO_FILEPKcz' filepath='../.././gcc/diagnostic.c' line='857' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7fnoticeP8_IO_FILEPKcz'>
      <parameter type-id='822cd80b' name='file' filepath='../.././gcc/diagnostic.c' line='857' column='1'/>
      <parameter type-id='80f4b756' name='cmsgid' filepath='../.././gcc/diagnostic.c' line='857' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fancy_abort' mangled-name='_Z11fancy_abortPKciS0_' filepath='../.././gcc/diagnostic.c' line='897' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z11fancy_abortPKciS0_'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='vasprintf' filepath='/usr/include/stdio.h' line='398' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='38f76a2a'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././gcc/ggc-none.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
    <class-decl name='alloc_zone' size-in-bits='32' is-struct='yes' visibility='default' filepath='../.././gcc/ggc-none.c' line='75' column='1' id='8465e599'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='95e97e5e' visibility='default' filepath='../.././gcc/ggc-none.c' line='77' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='gt_types_enum' filepath='./gtype-desc.h' line='23' column='1' id='10faaf37'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='gt_ggc_e_24lazy_hex_fp_value_struct' value='0'/>
      <enumerator name='gt_ggc_e_15c_inline_static' value='1'/>
      <enumerator name='gt_ggc_e_24VEC_c_goto_bindings_p_gc' value='2'/>
      <enumerator name='gt_ggc_e_26VEC_c_goto_bindings_p_base' value='3'/>
      <enumerator name='gt_ggc_e_15c_goto_bindings' value='4'/>
      <enumerator name='gt_ggc_e_7c_scope' value='5'/>
      <enumerator name='gt_ggc_e_9c_binding' value='6'/>
      <enumerator name='gt_ggc_e_12c_label_vars' value='7'/>
      <enumerator name='gt_ggc_e_15c_spot_bindings' value='8'/>
      <enumerator name='gt_ggc_e_8c_parser' value='9'/>
      <enumerator name='gt_ggc_e_7c_token' value='10'/>
      <enumerator name='gt_ggc_e_20VEC_ivarref_entry_gc' value='11'/>
      <enumerator name='gt_ggc_e_22VEC_ivarref_entry_base' value='12'/>
      <enumerator name='gt_ggc_e_13ivarref_entry' value='13'/>
      <enumerator name='gt_ggc_e_22VEC_prot_list_entry_gc' value='14'/>
      <enumerator name='gt_ggc_e_24VEC_prot_list_entry_base' value='15'/>
      <enumerator name='gt_ggc_e_15prot_list_entry' value='16'/>
      <enumerator name='gt_ggc_e_19VEC_msgref_entry_gc' value='17'/>
      <enumerator name='gt_ggc_e_21VEC_msgref_entry_base' value='18'/>
      <enumerator name='gt_ggc_e_12msgref_entry' value='19'/>
      <enumerator name='gt_ggc_e_23VEC_ident_data_tuple_gc' value='20'/>
      <enumerator name='gt_ggc_e_25VEC_ident_data_tuple_base' value='21'/>
      <enumerator name='gt_ggc_e_16ident_data_tuple' value='22'/>
      <enumerator name='gt_ggc_e_17string_descriptor' value='23'/>
      <enumerator name='gt_ggc_e_9imp_entry' value='24'/>
      <enumerator name='gt_ggc_e_16hashed_attribute' value='25'/>
      <enumerator name='gt_ggc_e_12hashed_entry' value='26'/>
      <enumerator name='gt_ggc_e_16objc_map_private' value='27'/>
      <enumerator name='gt_ggc_e_14builtin_record' value='28'/>
      <enumerator name='gt_ggc_e_14string_or_tree' value='29'/>
      <enumerator name='gt_ggc_e_11cpool_entry' value='30'/>
      <enumerator name='gt_ggc_e_19VEC_method_entry_gc' value='31'/>
      <enumerator name='gt_ggc_e_21VEC_method_entry_base' value='32'/>
      <enumerator name='gt_ggc_e_14method_entry_d' value='33'/>
      <enumerator name='gt_ggc_e_13lang_decl_var' value='34'/>
      <enumerator name='gt_ggc_e_14type_assertion' value='35'/>
      <enumerator name='gt_ggc_e_14lang_decl_func' value='36'/>
      <enumerator name='gt_ggc_e_18treetreehash_entry' value='37'/>
      <enumerator name='gt_ggc_e_5CPool' value='38'/>
      <enumerator name='gt_ggc_e_3JCF' value='39'/>
      <enumerator name='gt_ggc_e_16gfc_powdecl_list' value='40'/>
      <enumerator name='gt_ggc_e_16gfc_st_parameter' value='41'/>
      <enumerator name='gt_ggc_e_22gfc_st_parameter_field' value='42'/>
      <enumerator name='gt_ggc_e_19gfc_intrinsic_map_t' value='43'/>
      <enumerator name='gt_ggc_e_17module_htab_entry' value='44'/>
      <enumerator name='gt_ggc_e_13binding_level' value='45'/>
      <enumerator name='gt_ggc_e_23VEC_pending_noexcept_gc' value='46'/>
      <enumerator name='gt_ggc_e_25VEC_pending_noexcept_base' value='47'/>
      <enumerator name='gt_ggc_e_16pending_noexcept' value='48'/>
      <enumerator name='gt_ggc_e_9opt_stack' value='49'/>
      <enumerator name='gt_ggc_e_27VEC_pending_redefinition_gc' value='50'/>
      <enumerator name='gt_ggc_e_29VEC_pending_redefinition_base' value='51'/>
      <enumerator name='gt_ggc_e_22pending_redefinition_d' value='52'/>
      <enumerator name='gt_ggc_e_19VEC_pending_weak_gc' value='53'/>
      <enumerator name='gt_ggc_e_21VEC_pending_weak_base' value='54'/>
      <enumerator name='gt_ggc_e_14pending_weak_d' value='55'/>
      <enumerator name='gt_ggc_e_11align_stack' value='56'/>
      <enumerator name='gt_ggc_e_18VEC_tree_gc_vec_gc' value='57'/>
      <enumerator name='gt_ggc_e_20VEC_tree_gc_vec_base' value='58'/>
      <enumerator name='gt_ggc_e_19VEC_const_char_p_gc' value='59'/>
      <enumerator name='gt_ggc_e_21VEC_const_char_p_base' value='60'/>
      <enumerator name='gt_ggc_e_21pending_abstract_type' value='61'/>
      <enumerator name='gt_ggc_e_15VEC_tree_int_gc' value='62'/>
      <enumerator name='gt_ggc_e_17VEC_tree_int_base' value='63'/>
      <enumerator name='gt_ggc_e_8tree_int' value='64'/>
      <enumerator name='gt_ggc_e_9cp_parser' value='65'/>
      <enumerator name='gt_ggc_e_17cp_parser_context' value='66'/>
      <enumerator name='gt_ggc_e_34VEC_cp_unparsed_functions_entry_gc' value='67'/>
      <enumerator name='gt_ggc_e_36VEC_cp_unparsed_functions_entry_base' value='68'/>
      <enumerator name='gt_ggc_e_29cp_unparsed_functions_entry_d' value='69'/>
      <enumerator name='gt_ggc_e_27VEC_cp_default_arg_entry_gc' value='70'/>
      <enumerator name='gt_ggc_e_29VEC_cp_default_arg_entry_base' value='71'/>
      <enumerator name='gt_ggc_e_22cp_default_arg_entry_d' value='72'/>
      <enumerator name='gt_ggc_e_8cp_lexer' value='73'/>
      <enumerator name='gt_ggc_e_15VEC_cp_token_gc' value='74'/>
      <enumerator name='gt_ggc_e_17VEC_cp_token_base' value='75'/>
      <enumerator name='gt_ggc_e_8cp_token' value='76'/>
      <enumerator name='gt_ggc_e_14cp_token_value' value='77'/>
      <enumerator name='gt_ggc_e_10tree_check' value='78'/>
      <enumerator name='gt_ggc_e_14constexpr_call' value='79'/>
      <enumerator name='gt_ggc_e_16constexpr_fundef' value='80'/>
      <enumerator name='gt_ggc_e_22VEC_deferred_access_gc' value='81'/>
      <enumerator name='gt_ggc_e_24VEC_deferred_access_base' value='82'/>
      <enumerator name='gt_ggc_e_15deferred_access' value='83'/>
      <enumerator name='gt_ggc_e_10spec_entry' value='84'/>
      <enumerator name='gt_ggc_e_16pending_template' value='85'/>
      <enumerator name='gt_ggc_e_21VEC_incomplete_var_gc' value='86'/>
      <enumerator name='gt_ggc_e_23VEC_incomplete_var_base' value='87'/>
      <enumerator name='gt_ggc_e_16incomplete_var_d' value='88'/>
      <enumerator name='gt_ggc_e_21named_label_use_entry' value='89'/>
      <enumerator name='gt_ggc_e_28VEC_deferred_access_check_gc' value='90'/>
      <enumerator name='gt_ggc_e_30VEC_deferred_access_check_base' value='91'/>
      <enumerator name='gt_ggc_e_21deferred_access_check' value='92'/>
      <enumerator name='gt_ggc_e_20operator_name_info_t' value='93'/>
      <enumerator name='gt_ggc_e_11lang_decl_u' value='94'/>
      <enumerator name='gt_ggc_e_14lang_decl_parm' value='95'/>
      <enumerator name='gt_ggc_e_12lang_decl_ns' value='96'/>
      <enumerator name='gt_ggc_e_12lang_decl_fn' value='97'/>
      <enumerator name='gt_ggc_e_12lang_decl_u3' value='98'/>
      <enumerator name='gt_ggc_e_12lang_decl_u5' value='99'/>
      <enumerator name='gt_ggc_e_13lang_decl_min' value='100'/>
      <enumerator name='gt_ggc_e_12lang_decl_u2' value='101'/>
      <enumerator name='gt_ggc_e_14lang_decl_base' value='102'/>
      <enumerator name='gt_ggc_e_11lang_type_u' value='103'/>
      <enumerator name='gt_ggc_e_16lang_type_ptrmem' value='104'/>
      <enumerator name='gt_ggc_e_15lang_type_class' value='105'/>
      <enumerator name='gt_ggc_e_18sorted_fields_type' value='106'/>
      <enumerator name='gt_ggc_e_16lang_type_header' value='107'/>
      <enumerator name='gt_ggc_e_18VEC_tree_pair_s_gc' value='108'/>
      <enumerator name='gt_ggc_e_20VEC_tree_pair_s_base' value='109'/>
      <enumerator name='gt_ggc_e_11tree_pair_s' value='110'/>
      <enumerator name='gt_ggc_e_17named_label_entry' value='111'/>
      <enumerator name='gt_ggc_e_19c_language_function' value='112'/>
      <enumerator name='gt_ggc_e_11stmt_tree_s' value='113'/>
      <enumerator name='gt_ggc_e_20tree_userdef_literal' value='114'/>
      <enumerator name='gt_ggc_e_18tree_template_info' value='115'/>
      <enumerator name='gt_ggc_e_32VEC_qualified_typedef_usage_t_gc' value='116'/>
      <enumerator name='gt_ggc_e_34VEC_qualified_typedef_usage_t_base' value='117'/>
      <enumerator name='gt_ggc_e_25qualified_typedef_usage_s' value='118'/>
      <enumerator name='gt_ggc_e_16tree_lambda_expr' value='119'/>
      <enumerator name='gt_ggc_e_15tree_trait_expr' value='120'/>
      <enumerator name='gt_ggc_e_25tree_argument_pack_select' value='121'/>
      <enumerator name='gt_ggc_e_18tree_static_assert' value='122'/>
      <enumerator name='gt_ggc_e_22tree_deferred_noexcept' value='123'/>
      <enumerator name='gt_ggc_e_16tree_default_arg' value='124'/>
      <enumerator name='gt_ggc_e_14cp_token_cache' value='125'/>
      <enumerator name='gt_ggc_e_13tree_baselink' value='126'/>
      <enumerator name='gt_ggc_e_13tree_overload' value='127'/>
      <enumerator name='gt_ggc_e_10ptrmem_cst' value='128'/>
      <enumerator name='gt_ggc_e_21template_parm_index_s' value='129'/>
      <enumerator name='gt_ggc_e_15lang_identifier' value='130'/>
      <enumerator name='gt_ggc_e_19c_common_identifier' value='131'/>
      <enumerator name='gt_ggc_e_11saved_scope' value='132'/>
      <enumerator name='gt_ggc_e_16cxx_int_tree_map' value='133'/>
      <enumerator name='gt_ggc_e_23VEC_cp_label_binding_gc' value='134'/>
      <enumerator name='gt_ggc_e_25VEC_cp_label_binding_base' value='135'/>
      <enumerator name='gt_ggc_e_16cp_label_binding' value='136'/>
      <enumerator name='gt_ggc_e_23VEC_cp_class_binding_gc' value='137'/>
      <enumerator name='gt_ggc_e_25VEC_cp_class_binding_base' value='138'/>
      <enumerator name='gt_ggc_e_16cp_class_binding' value='139'/>
      <enumerator name='gt_ggc_e_24VEC_cxx_saved_binding_gc' value='140'/>
      <enumerator name='gt_ggc_e_26VEC_cxx_saved_binding_base' value='141'/>
      <enumerator name='gt_ggc_e_17cxx_saved_binding' value='142'/>
      <enumerator name='gt_ggc_e_16cp_binding_level' value='143'/>
      <enumerator name='gt_ggc_e_11cxx_binding' value='144'/>
      <enumerator name='gt_ggc_e_15binding_entry_s' value='145'/>
      <enumerator name='gt_ggc_e_15binding_table_s' value='146'/>
      <enumerator name='gt_ggc_e_11tinst_level' value='147'/>
      <enumerator name='gt_ggc_e_7globals' value='148'/>
      <enumerator name='gt_ggc_e_14VEC_tinfo_s_gc' value='149'/>
      <enumerator name='gt_ggc_e_16VEC_tinfo_s_base' value='150'/>
      <enumerator name='gt_ggc_e_7tinfo_s' value='151'/>
      <enumerator name='gt_ggc_e_18gnat_binding_level' value='152'/>
      <enumerator name='gt_ggc_e_16VEC_loop_info_gc' value='153'/>
      <enumerator name='gt_ggc_e_18VEC_loop_info_base' value='154'/>
      <enumerator name='gt_ggc_e_11loop_info_d' value='155'/>
      <enumerator name='gt_ggc_e_23VEC_range_check_info_gc' value='156'/>
      <enumerator name='gt_ggc_e_25VEC_range_check_info_base' value='157'/>
      <enumerator name='gt_ggc_e_18range_check_info_d' value='158'/>
      <enumerator name='gt_ggc_e_9elab_info' value='159'/>
      <enumerator name='gt_ggc_e_10stmt_group' value='160'/>
      <enumerator name='gt_ggc_e_16VEC_parm_attr_gc' value='161'/>
      <enumerator name='gt_ggc_e_18VEC_parm_attr_base' value='162'/>
      <enumerator name='gt_ggc_e_11parm_attr_d' value='163'/>
      <enumerator name='gt_ggc_e_23VEC_inline_summary_t_gc' value='164'/>
      <enumerator name='gt_ggc_e_25VEC_inline_summary_t_base' value='165'/>
      <enumerator name='gt_ggc_e_22VEC_size_time_entry_gc' value='166'/>
      <enumerator name='gt_ggc_e_24VEC_size_time_entry_base' value='167'/>
      <enumerator name='gt_ggc_e_15size_time_entry' value='168'/>
      <enumerator name='gt_ggc_e_9predicate' value='169'/>
      <enumerator name='gt_ggc_e_16VEC_condition_gc' value='170'/>
      <enumerator name='gt_ggc_e_18VEC_condition_base' value='171'/>
      <enumerator name='gt_ggc_e_9condition' value='172'/>
      <enumerator name='gt_ggc_e_18lto_tree_ref_table' value='173'/>
      <enumerator name='gt_ggc_e_17lto_in_decl_state' value='174'/>
      <enumerator name='gt_ggc_e_22VEC_ipa_edge_args_t_gc' value='175'/>
      <enumerator name='gt_ggc_e_24VEC_ipa_edge_args_t_base' value='176'/>
      <enumerator name='gt_ggc_e_22VEC_ipa_jump_func_t_gc' value='177'/>
      <enumerator name='gt_ggc_e_24VEC_ipa_jump_func_t_base' value='178'/>
      <enumerator name='gt_ggc_e_15jump_func_value' value='179'/>
      <enumerator name='gt_ggc_e_18ipa_member_ptr_cst' value='180'/>
      <enumerator name='gt_ggc_e_20ipa_ancestor_jf_data' value='181'/>
      <enumerator name='gt_ggc_e_21ipa_pass_through_data' value='182'/>
      <enumerator name='gt_ggc_e_19ipa_known_type_data' value='183'/>
      <enumerator name='gt_ggc_e_20lto_symtab_entry_def' value='184'/>
      <enumerator name='gt_ggc_e_20ssa_operand_memory_d' value='185'/>
      <enumerator name='gt_ggc_e_13scev_info_str' value='186'/>
      <enumerator name='gt_ggc_e_24VEC_mem_addr_template_gc' value='187'/>
      <enumerator name='gt_ggc_e_26VEC_mem_addr_template_base' value='188'/>
      <enumerator name='gt_ggc_e_17mem_addr_template' value='189'/>
      <enumerator name='gt_ggc_e_12ssa_operands' value='190'/>
      <enumerator name='gt_ggc_e_15tm_restart_node' value='191'/>
      <enumerator name='gt_ggc_e_26gimple_type_leader_entry_s' value='192'/>
      <enumerator name='gt_ggc_e_28gimple_statement_transaction' value='193'/>
      <enumerator name='gt_ggc_e_33gimple_statement_omp_atomic_store' value='194'/>
      <enumerator name='gt_ggc_e_32gimple_statement_omp_atomic_load' value='195'/>
      <enumerator name='gt_ggc_e_27gimple_statement_omp_single' value='196'/>
      <enumerator name='gt_ggc_e_29gimple_statement_omp_continue' value='197'/>
      <enumerator name='gt_ggc_e_29gimple_statement_omp_sections' value='198'/>
      <enumerator name='gt_ggc_e_25gimple_statement_omp_task' value='199'/>
      <enumerator name='gt_ggc_e_29gimple_statement_omp_parallel' value='200'/>
      <enumerator name='gt_ggc_e_24gimple_statement_omp_for' value='201'/>
      <enumerator name='gt_ggc_e_19gimple_omp_for_iter' value='202'/>
      <enumerator name='gt_ggc_e_29gimple_statement_omp_critical' value='203'/>
      <enumerator name='gt_ggc_e_20gimple_statement_asm' value='204'/>
      <enumerator name='gt_ggc_e_20gimple_statement_wce' value='205'/>
      <enumerator name='gt_ggc_e_20gimple_statement_try' value='206'/>
      <enumerator name='gt_ggc_e_24gimple_statement_eh_ctrl' value='207'/>
      <enumerator name='gt_ggc_e_20gimple_statement_phi' value='208'/>
      <enumerator name='gt_ggc_e_23gimple_statement_eh_mnt' value='209'/>
      <enumerator name='gt_ggc_e_24gimple_statement_eh_else' value='210'/>
      <enumerator name='gt_ggc_e_26gimple_statement_eh_filter' value='211'/>
      <enumerator name='gt_ggc_e_22gimple_statement_catch' value='212'/>
      <enumerator name='gt_ggc_e_21gimple_statement_bind' value='213'/>
      <enumerator name='gt_ggc_e_20gimple_statement_omp' value='214'/>
      <enumerator name='gt_ggc_e_21gimple_statement_call' value='215'/>
      <enumerator name='gt_ggc_e_11pt_solution' value='216'/>
      <enumerator name='gt_ggc_e_32gimple_statement_with_memory_ops' value='217'/>
      <enumerator name='gt_ggc_e_37gimple_statement_with_memory_ops_base' value='218'/>
      <enumerator name='gt_ggc_e_25gimple_statement_with_ops' value='219'/>
      <enumerator name='gt_ggc_e_30gimple_statement_with_ops_base' value='220'/>
      <enumerator name='gt_ggc_e_21gimple_statement_base' value='221'/>
      <enumerator name='gt_ggc_e_17gimple_seq_node_d' value='222'/>
      <enumerator name='gt_ggc_e_9type_hash' value='223'/>
      <enumerator name='gt_ggc_e_16string_pool_data' value='224'/>
      <enumerator name='gt_ggc_e_18initial_value_pair' value='225'/>
      <enumerator name='gt_ggc_e_23temp_slot_address_entry' value='226'/>
      <enumerator name='gt_ggc_e_11eh_status_u' value='227'/>
      <enumerator name='gt_ggc_e_15throw_stmt_node' value='228'/>
      <enumerator name='gt_ggc_e_21VEC_eh_landing_pad_gc' value='229'/>
      <enumerator name='gt_ggc_e_23VEC_eh_landing_pad_base' value='230'/>
      <enumerator name='gt_ggc_e_16VEC_eh_region_gc' value='231'/>
      <enumerator name='gt_ggc_e_18VEC_eh_region_base' value='232'/>
      <enumerator name='gt_ggc_e_11eh_region_u' value='233'/>
      <enumerator name='gt_ggc_e_26eh_region_u_must_not_throw' value='234'/>
      <enumerator name='gt_ggc_e_19eh_region_u_allowed' value='235'/>
      <enumerator name='gt_ggc_e_15eh_region_u_try' value='236'/>
      <enumerator name='gt_ggc_e_10eh_catch_d' value='237'/>
      <enumerator name='gt_ggc_e_16eh_landing_pad_d' value='238'/>
      <enumerator name='gt_ggc_e_11eh_region_d' value='239'/>
      <enumerator name='gt_ggc_e_22cached_dw_loc_list_def' value='240'/>
      <enumerator name='gt_ggc_e_17call_arg_loc_node' value='241'/>
      <enumerator name='gt_ggc_e_16var_loc_list_def' value='242'/>
      <enumerator name='gt_ggc_e_12var_loc_node' value='243'/>
      <enumerator name='gt_ggc_e_20VEC_die_arg_entry_gc' value='244'/>
      <enumerator name='gt_ggc_e_22VEC_die_arg_entry_base' value='245'/>
      <enumerator name='gt_ggc_e_20die_arg_entry_struct' value='246'/>
      <enumerator name='gt_ggc_e_16limbo_die_struct' value='247'/>
      <enumerator name='gt_ggc_e_20VEC_macinfo_entry_gc' value='248'/>
      <enumerator name='gt_ggc_e_22VEC_macinfo_entry_base' value='249'/>
      <enumerator name='gt_ggc_e_14macinfo_struct' value='250'/>
      <enumerator name='gt_ggc_e_20VEC_pubname_entry_gc' value='251'/>
      <enumerator name='gt_ggc_e_22VEC_pubname_entry_base' value='252'/>
      <enumerator name='gt_ggc_e_23die_symbol_or_type_node' value='253'/>
      <enumerator name='gt_ggc_e_19VEC_dw_attr_node_gc' value='254'/>
      <enumerator name='gt_ggc_e_21VEC_dw_attr_node_base' value='255'/>
      <enumerator name='gt_ggc_e_27VEC_dw_line_info_table_p_gc' value='256'/>
      <enumerator name='gt_ggc_e_29VEC_dw_line_info_table_p_base' value='257'/>
      <enumerator name='gt_ggc_e_25dw_line_info_table_struct' value='258'/>
      <enumerator name='gt_ggc_e_25VEC_dw_line_info_entry_gc' value='259'/>
      <enumerator name='gt_ggc_e_27VEC_dw_line_info_entry_base' value='260'/>
      <enumerator name='gt_ggc_e_18comdat_type_struct' value='261'/>
      <enumerator name='gt_ggc_e_25dw_ranges_by_label_struct' value='262'/>
      <enumerator name='gt_ggc_e_16dw_ranges_struct' value='263'/>
      <enumerator name='gt_ggc_e_14pubname_struct' value='264'/>
      <enumerator name='gt_ggc_e_19dw_line_info_struct' value='265'/>
      <enumerator name='gt_ggc_e_14dw_attr_struct' value='266'/>
      <enumerator name='gt_ggc_e_25VEC_deferred_locations_gc' value='267'/>
      <enumerator name='gt_ggc_e_27VEC_deferred_locations_base' value='268'/>
      <enumerator name='gt_ggc_e_25deferred_locations_struct' value='269'/>
      <enumerator name='gt_ggc_e_17VEC_dw_fde_ref_gc' value='270'/>
      <enumerator name='gt_ggc_e_19VEC_dw_fde_ref_base' value='271'/>
      <enumerator name='gt_ggc_e_24reg_saved_in_data_struct' value='272'/>
      <enumerator name='gt_ggc_e_17dw_cfi_row_struct' value='273'/>
      <enumerator name='gt_ggc_e_19dw_val_struct_union' value='274'/>
      <enumerator name='gt_ggc_e_22dw_val_vms_delta_union' value='275'/>
      <enumerator name='gt_ggc_e_15dwarf_file_data' value='276'/>
      <enumerator name='gt_ggc_e_20indirect_string_node' value='277'/>
      <enumerator name='gt_ggc_e_16dw_val_die_union' value='278'/>
      <enumerator name='gt_ggc_e_13dw_vec_struct' value='279'/>
      <enumerator name='gt_ggc_e_7cfa_loc' value='280'/>
      <enumerator name='gt_ggc_e_17VEC_dw_cfi_ref_gc' value='281'/>
      <enumerator name='gt_ggc_e_19VEC_dw_cfi_ref_base' value='282'/>
      <enumerator name='gt_ggc_e_19dw_cfi_oprnd_struct' value='283'/>
      <enumerator name='gt_ggc_e_18dw_loc_list_struct' value='284'/>
      <enumerator name='gt_ggc_e_19dw_loc_descr_struct' value='285'/>
      <enumerator name='gt_ggc_e_13dw_cfi_struct' value='286'/>
      <enumerator name='gt_ggc_e_13dw_val_struct' value='287'/>
      <enumerator name='gt_ggc_e_8typeinfo' value='288'/>
      <enumerator name='gt_ggc_e_14inline_summary' value='289'/>
      <enumerator name='gt_ggc_e_13ipa_edge_args' value='290'/>
      <enumerator name='gt_ggc_e_13ipa_jump_func' value='291'/>
      <enumerator name='gt_ggc_e_22VEC_alias_set_entry_gc' value='292'/>
      <enumerator name='gt_ggc_e_24VEC_alias_set_entry_base' value='293'/>
      <enumerator name='gt_ggc_e_17alias_set_entry_d' value='294'/>
      <enumerator name='gt_ggc_e_24constant_descriptor_tree' value='295'/>
      <enumerator name='gt_ggc_e_15cgraph_asm_node' value='296'/>
      <enumerator name='gt_ggc_e_25cgraph_indirect_call_info' value='297'/>
      <enumerator name='gt_ggc_e_11cgraph_edge' value='298'/>
      <enumerator name='gt_ggc_e_17cgraph_clone_info' value='299'/>
      <enumerator name='gt_ggc_e_24VEC_ipa_replace_map_p_gc' value='300'/>
      <enumerator name='gt_ggc_e_26VEC_ipa_replace_map_p_base' value='301'/>
      <enumerator name='gt_ggc_e_15ipa_replace_map' value='302'/>
      <enumerator name='gt_ggc_e_15cgraph_rtl_info' value='303'/>
      <enumerator name='gt_ggc_e_18cgraph_global_info' value='304'/>
      <enumerator name='gt_ggc_e_17cgraph_local_info' value='305'/>
      <enumerator name='gt_ggc_e_17cgraph_thunk_info' value='306'/>
      <enumerator name='gt_ggc_e_18lto_file_decl_data' value='307'/>
      <enumerator name='gt_ggc_e_12ipa_ref_list' value='308'/>
      <enumerator name='gt_ggc_e_16VEC_ipa_ref_t_gc' value='309'/>
      <enumerator name='gt_ggc_e_18VEC_ipa_ref_t_base' value='310'/>
      <enumerator name='gt_ggc_e_7ipa_ref' value='311'/>
      <enumerator name='gt_ggc_e_13ipa_ref_ptr_u' value='312'/>
      <enumerator name='gt_ggc_e_12varpool_node' value='313'/>
      <enumerator name='gt_ggc_e_11cgraph_node' value='314'/>
      <enumerator name='gt_ggc_e_18VEC_basic_block_gc' value='315'/>
      <enumerator name='gt_ggc_e_20VEC_basic_block_base' value='316'/>
      <enumerator name='gt_ggc_e_24basic_block_il_dependent' value='317'/>
      <enumerator name='gt_ggc_e_14gimple_bb_info' value='318'/>
      <enumerator name='gt_ggc_e_11rtl_bb_info' value='319'/>
      <enumerator name='gt_ggc_e_11VEC_edge_gc' value='320'/>
      <enumerator name='gt_ggc_e_13VEC_edge_base' value='321'/>
      <enumerator name='gt_ggc_e_14edge_def_insns' value='322'/>
      <enumerator name='gt_ggc_e_13VEC_loop_p_gc' value='323'/>
      <enumerator name='gt_ggc_e_15VEC_loop_p_base' value='324'/>
      <enumerator name='gt_ggc_e_4loop' value='325'/>
      <enumerator name='gt_ggc_e_9loop_exit' value='326'/>
      <enumerator name='gt_ggc_e_13nb_iter_bound' value='327'/>
      <enumerator name='gt_ggc_e_12lpt_decision' value='328'/>
      <enumerator name='gt_ggc_e_16noswitch_section' value='329'/>
      <enumerator name='gt_ggc_e_15unnamed_section' value='330'/>
      <enumerator name='gt_ggc_e_13named_section' value='331'/>
      <enumerator name='gt_ggc_e_14section_common' value='332'/>
      <enumerator name='gt_ggc_e_24types_used_by_vars_entry' value='333'/>
      <enumerator name='gt_ggc_e_17language_function' value='334'/>
      <enumerator name='gt_ggc_e_5loops' value='335'/>
      <enumerator name='gt_ggc_e_18control_flow_graph' value='336'/>
      <enumerator name='gt_ggc_e_9eh_status' value='337'/>
      <enumerator name='gt_ggc_e_11stack_usage' value='338'/>
      <enumerator name='gt_ggc_e_8rtl_data' value='339'/>
      <enumerator name='gt_ggc_e_20initial_value_struct' value='340'/>
      <enumerator name='gt_ggc_e_11frame_space' value='341'/>
      <enumerator name='gt_ggc_e_20function_subsections' value='342'/>
      <enumerator name='gt_ggc_e_13incoming_args' value='343'/>
      <enumerator name='gt_ggc_e_13varasm_status' value='344'/>
      <enumerator name='gt_ggc_e_17rtx_constant_pool' value='345'/>
      <enumerator name='gt_ggc_e_18VEC_temp_slot_p_gc' value='346'/>
      <enumerator name='gt_ggc_e_20VEC_temp_slot_p_base' value='347'/>
      <enumerator name='gt_ggc_e_13dw_fde_struct' value='348'/>
      <enumerator name='gt_ggc_e_9temp_slot' value='349'/>
      <enumerator name='gt_ggc_e_9gimple_df' value='350'/>
      <enumerator name='gt_ggc_e_6rtl_eh' value='351'/>
      <enumerator name='gt_ggc_e_23VEC_call_site_record_gc' value='352'/>
      <enumerator name='gt_ggc_e_25VEC_call_site_record_base' value='353'/>
      <enumerator name='gt_ggc_e_18call_site_record_d' value='354'/>
      <enumerator name='gt_ggc_e_11expr_status' value='355'/>
      <enumerator name='gt_ggc_e_11emit_status' value='356'/>
      <enumerator name='gt_ggc_e_14sequence_stack' value='357'/>
      <enumerator name='gt_ggc_e_15target_libfuncs' value='358'/>
      <enumerator name='gt_ggc_e_13libfunc_entry' value='359'/>
      <enumerator name='gt_ggc_e_19builtin_info_type_d' value='360'/>
      <enumerator name='gt_ggc_e_12tree_vec_map' value='361'/>
      <enumerator name='gt_ggc_e_17tree_priority_map' value='362'/>
      <enumerator name='gt_ggc_e_12tree_int_map' value='363'/>
      <enumerator name='gt_ggc_e_13tree_decl_map' value='364'/>
      <enumerator name='gt_ggc_e_8tree_map' value='365'/>
      <enumerator name='gt_ggc_e_13tree_map_base' value='366'/>
      <enumerator name='gt_ggc_e_14lang_tree_node' value='367'/>
      <enumerator name='gt_ggc_e_18tree_target_option' value='368'/>
      <enumerator name='gt_ggc_e_24tree_optimization_option' value='369'/>
      <enumerator name='gt_ggc_e_19tree_statement_list' value='370'/>
      <enumerator name='gt_ggc_e_24tree_statement_list_node' value='371'/>
      <enumerator name='gt_ggc_e_14tree_type_decl' value='372'/>
      <enumerator name='gt_ggc_e_26tree_translation_unit_decl' value='373'/>
      <enumerator name='gt_ggc_e_18tree_function_decl' value='374'/>
      <enumerator name='gt_ggc_e_20tree_decl_non_common' value='375'/>
      <enumerator name='gt_ggc_e_13tree_var_decl' value='376'/>
      <enumerator name='gt_ggc_e_18tree_decl_with_vis' value='377'/>
      <enumerator name='gt_ggc_e_14tree_parm_decl' value='378'/>
      <enumerator name='gt_ggc_e_15tree_const_decl' value='379'/>
      <enumerator name='gt_ggc_e_16tree_result_decl' value='380'/>
      <enumerator name='gt_ggc_e_9var_ann_d' value='381'/>
      <enumerator name='gt_ggc_e_15tree_label_decl' value='382'/>
      <enumerator name='gt_ggc_e_15tree_field_decl' value='383'/>
      <enumerator name='gt_ggc_e_18tree_decl_with_rtl' value='384'/>
      <enumerator name='gt_ggc_e_16tree_decl_common' value='385'/>
      <enumerator name='gt_ggc_e_9lang_decl' value='386'/>
      <enumerator name='gt_ggc_e_17tree_decl_minimal' value='387'/>
      <enumerator name='gt_ggc_e_10tree_binfo' value='388'/>
      <enumerator name='gt_ggc_e_20tree_type_non_common' value='389'/>
      <enumerator name='gt_ggc_e_28tree_type_with_lang_specific' value='390'/>
      <enumerator name='gt_ggc_e_9lang_type' value='391'/>
      <enumerator name='gt_ggc_e_16tree_type_common' value='392'/>
      <enumerator name='gt_ggc_e_16tree_type_symtab' value='393'/>
      <enumerator name='gt_ggc_e_10die_struct' value='394'/>
      <enumerator name='gt_ggc_e_10tree_block' value='395'/>
      <enumerator name='gt_ggc_e_15tree_omp_clause' value='396'/>
      <enumerator name='gt_ggc_e_9phi_arg_d' value='397'/>
      <enumerator name='gt_ggc_e_13tree_ssa_name' value='398'/>
      <enumerator name='gt_ggc_e_17ssa_use_operand_d' value='399'/>
      <enumerator name='gt_ggc_e_12ptr_info_def' value='400'/>
      <enumerator name='gt_ggc_e_8tree_exp' value='401'/>
      <enumerator name='gt_ggc_e_17tree_exp_subunion' value='402'/>
      <enumerator name='gt_ggc_e_16tree_constructor' value='403'/>
      <enumerator name='gt_ggc_e_22VEC_constructor_elt_gc' value='404'/>
      <enumerator name='gt_ggc_e_24VEC_constructor_elt_base' value='405'/>
      <enumerator name='gt_ggc_e_17constructor_elt_d' value='406'/>
      <enumerator name='gt_ggc_e_8tree_vec' value='407'/>
      <enumerator name='gt_ggc_e_9tree_list' value='408'/>
      <enumerator name='gt_ggc_e_15tree_identifier' value='409'/>
      <enumerator name='gt_ggc_e_11tree_vector' value='410'/>
      <enumerator name='gt_ggc_e_12tree_complex' value='411'/>
      <enumerator name='gt_ggc_e_11tree_string' value='412'/>
      <enumerator name='gt_ggc_e_14tree_fixed_cst' value='413'/>
      <enumerator name='gt_ggc_e_13tree_real_cst' value='414'/>
      <enumerator name='gt_ggc_e_12tree_int_cst' value='415'/>
      <enumerator name='gt_ggc_e_11tree_common' value='416'/>
      <enumerator name='gt_ggc_e_10tree_typed' value='417'/>
      <enumerator name='gt_ggc_e_9tree_base' value='418'/>
      <enumerator name='gt_ggc_e_17VEC_alias_pair_gc' value='419'/>
      <enumerator name='gt_ggc_e_19VEC_alias_pair_base' value='420'/>
      <enumerator name='gt_ggc_e_10alias_pair' value='421'/>
      <enumerator name='gt_ggc_e_10target_rtl' value='422'/>
      <enumerator name='gt_ggc_e_8function' value='423'/>
      <enumerator name='gt_ggc_e_16rtx_def_subunion' value='424'/>
      <enumerator name='gt_ggc_e_27rtx_def_debug_parameter_ref' value='425'/>
      <enumerator name='gt_ggc_e_19rtx_def_entry_value' value='426'/>
      <enumerator name='gt_ggc_e_26rtx_def_debug_implicit_ptr' value='427'/>
      <enumerator name='gt_ggc_e_20rtx_def_var_location' value='428'/>
      <enumerator name='gt_ggc_e_11rtx_def_fma' value='429'/>
      <enumerator name='gt_ggc_e_19rtx_def_us_truncate' value='430'/>
      <enumerator name='gt_ggc_e_19rtx_def_ss_truncate' value='431'/>
      <enumerator name='gt_ggc_e_16rtx_def_us_minus' value='432'/>
      <enumerator name='gt_ggc_e_17rtx_def_us_ashift' value='433'/>
      <enumerator name='gt_ggc_e_17rtx_def_ss_ashift' value='434'/>
      <enumerator name='gt_ggc_e_14rtx_def_ss_abs' value='435'/>
      <enumerator name='gt_ggc_e_14rtx_def_us_neg' value='436'/>
      <enumerator name='gt_ggc_e_14rtx_def_ss_neg' value='437'/>
      <enumerator name='gt_ggc_e_16rtx_def_ss_minus' value='438'/>
      <enumerator name='gt_ggc_e_15rtx_def_us_plus' value='439'/>
      <enumerator name='gt_ggc_e_15rtx_def_ss_plus' value='440'/>
      <enumerator name='gt_ggc_e_21rtx_def_vec_duplicate' value='441'/>
      <enumerator name='gt_ggc_e_18rtx_def_vec_concat' value='442'/>
      <enumerator name='gt_ggc_e_18rtx_def_vec_select' value='443'/>
      <enumerator name='gt_ggc_e_17rtx_def_vec_merge' value='444'/>
      <enumerator name='gt_ggc_e_14rtx_def_lo_sum' value='445'/>
      <enumerator name='gt_ggc_e_12rtx_def_high' value='446'/>
      <enumerator name='gt_ggc_e_20rtx_def_zero_extract' value='447'/>
      <enumerator name='gt_ggc_e_20rtx_def_sign_extract' value='448'/>
      <enumerator name='gt_ggc_e_14rtx_def_parity' value='449'/>
      <enumerator name='gt_ggc_e_16rtx_def_popcount' value='450'/>
      <enumerator name='gt_ggc_e_11rtx_def_ctz' value='451'/>
      <enumerator name='gt_ggc_e_11rtx_def_clz' value='452'/>
      <enumerator name='gt_ggc_e_13rtx_def_clrsb' value='453'/>
      <enumerator name='gt_ggc_e_11rtx_def_ffs' value='454'/>
      <enumerator name='gt_ggc_e_13rtx_def_bswap' value='455'/>
      <enumerator name='gt_ggc_e_12rtx_def_sqrt' value='456'/>
      <enumerator name='gt_ggc_e_11rtx_def_abs' value='457'/>
      <enumerator name='gt_ggc_e_26rtx_def_unsigned_sat_fract' value='458'/>
      <enumerator name='gt_ggc_e_17rtx_def_sat_fract' value='459'/>
      <enumerator name='gt_ggc_e_30rtx_def_unsigned_fract_convert' value='460'/>
      <enumerator name='gt_ggc_e_21rtx_def_fract_convert' value='461'/>
      <enumerator name='gt_ggc_e_20rtx_def_unsigned_fix' value='462'/>
      <enumerator name='gt_ggc_e_22rtx_def_unsigned_float' value='463'/>
      <enumerator name='gt_ggc_e_11rtx_def_fix' value='464'/>
      <enumerator name='gt_ggc_e_13rtx_def_float' value='465'/>
      <enumerator name='gt_ggc_e_22rtx_def_float_truncate' value='466'/>
      <enumerator name='gt_ggc_e_20rtx_def_float_extend' value='467'/>
      <enumerator name='gt_ggc_e_16rtx_def_truncate' value='468'/>
      <enumerator name='gt_ggc_e_19rtx_def_zero_extend' value='469'/>
      <enumerator name='gt_ggc_e_19rtx_def_sign_extend' value='470'/>
      <enumerator name='gt_ggc_e_12rtx_def_ltgt' value='471'/>
      <enumerator name='gt_ggc_e_12rtx_def_unlt' value='472'/>
      <enumerator name='gt_ggc_e_12rtx_def_unle' value='473'/>
      <enumerator name='gt_ggc_e_12rtx_def_ungt' value='474'/>
      <enumerator name='gt_ggc_e_12rtx_def_unge' value='475'/>
      <enumerator name='gt_ggc_e_12rtx_def_uneq' value='476'/>
      <enumerator name='gt_ggc_e_15rtx_def_ordered' value='477'/>
      <enumerator name='gt_ggc_e_17rtx_def_unordered' value='478'/>
      <enumerator name='gt_ggc_e_11rtx_def_ltu' value='479'/>
      <enumerator name='gt_ggc_e_11rtx_def_leu' value='480'/>
      <enumerator name='gt_ggc_e_11rtx_def_gtu' value='481'/>
      <enumerator name='gt_ggc_e_11rtx_def_geu' value='482'/>
      <enumerator name='gt_ggc_e_10rtx_def_lt' value='483'/>
      <enumerator name='gt_ggc_e_10rtx_def_le' value='484'/>
      <enumerator name='gt_ggc_e_10rtx_def_gt' value='485'/>
      <enumerator name='gt_ggc_e_10rtx_def_ge' value='486'/>
      <enumerator name='gt_ggc_e_10rtx_def_eq' value='487'/>
      <enumerator name='gt_ggc_e_10rtx_def_ne' value='488'/>
      <enumerator name='gt_ggc_e_19rtx_def_post_modify' value='489'/>
      <enumerator name='gt_ggc_e_18rtx_def_pre_modify' value='490'/>
      <enumerator name='gt_ggc_e_16rtx_def_post_inc' value='491'/>
      <enumerator name='gt_ggc_e_16rtx_def_post_dec' value='492'/>
      <enumerator name='gt_ggc_e_15rtx_def_pre_inc' value='493'/>
      <enumerator name='gt_ggc_e_15rtx_def_pre_dec' value='494'/>
      <enumerator name='gt_ggc_e_12rtx_def_umax' value='495'/>
      <enumerator name='gt_ggc_e_12rtx_def_umin' value='496'/>
      <enumerator name='gt_ggc_e_12rtx_def_smax' value='497'/>
      <enumerator name='gt_ggc_e_12rtx_def_smin' value='498'/>
      <enumerator name='gt_ggc_e_16rtx_def_rotatert' value='499'/>
      <enumerator name='gt_ggc_e_16rtx_def_lshiftrt' value='500'/>
      <enumerator name='gt_ggc_e_16rtx_def_ashiftrt' value='501'/>
      <enumerator name='gt_ggc_e_14rtx_def_rotate' value='502'/>
      <enumerator name='gt_ggc_e_14rtx_def_ashift' value='503'/>
      <enumerator name='gt_ggc_e_11rtx_def_not' value='504'/>
      <enumerator name='gt_ggc_e_11rtx_def_xor' value='505'/>
      <enumerator name='gt_ggc_e_11rtx_def_ior' value='506'/>
      <enumerator name='gt_ggc_e_11rtx_def_and' value='507'/>
      <enumerator name='gt_ggc_e_12rtx_def_umod' value='508'/>
      <enumerator name='gt_ggc_e_12rtx_def_udiv' value='509'/>
      <enumerator name='gt_ggc_e_11rtx_def_mod' value='510'/>
      <enumerator name='gt_ggc_e_14rtx_def_us_div' value='511'/>
      <enumerator name='gt_ggc_e_14rtx_def_ss_div' value='512'/>
      <enumerator name='gt_ggc_e_11rtx_def_div' value='513'/>
      <enumerator name='gt_ggc_e_15rtx_def_us_mult' value='514'/>
      <enumerator name='gt_ggc_e_15rtx_def_ss_mult' value='515'/>
      <enumerator name='gt_ggc_e_12rtx_def_mult' value='516'/>
      <enumerator name='gt_ggc_e_11rtx_def_neg' value='517'/>
      <enumerator name='gt_ggc_e_13rtx_def_minus' value='518'/>
      <enumerator name='gt_ggc_e_12rtx_def_plus' value='519'/>
      <enumerator name='gt_ggc_e_15rtx_def_compare' value='520'/>
      <enumerator name='gt_ggc_e_20rtx_def_if_then_else' value='521'/>
      <enumerator name='gt_ggc_e_11rtx_def_cc0' value='522'/>
      <enumerator name='gt_ggc_e_18rtx_def_symbol_ref' value='523'/>
      <enumerator name='gt_ggc_e_12fake_union_1' value='524'/>
      <enumerator name='gt_ggc_e_17rtx_def_label_ref' value='525'/>
      <enumerator name='gt_ggc_e_11rtx_def_mem' value='526'/>
      <enumerator name='gt_ggc_e_15rtx_def_concatn' value='527'/>
      <enumerator name='gt_ggc_e_14rtx_def_concat' value='528'/>
      <enumerator name='gt_ggc_e_23rtx_def_strict_low_part' value='529'/>
      <enumerator name='gt_ggc_e_14rtx_def_subreg' value='530'/>
      <enumerator name='gt_ggc_e_15rtx_def_scratch' value='531'/>
      <enumerator name='gt_ggc_e_11rtx_def_reg' value='532'/>
      <enumerator name='gt_ggc_e_10rtx_def_pc' value='533'/>
      <enumerator name='gt_ggc_e_13rtx_def_const' value='534'/>
      <enumerator name='gt_ggc_e_20rtx_def_const_string' value='535'/>
      <enumerator name='gt_ggc_e_20rtx_def_const_vector' value='536'/>
      <enumerator name='gt_ggc_e_20rtx_def_const_double' value='537'/>
      <enumerator name='gt_ggc_e_19rtx_def_const_fixed' value='538'/>
      <enumerator name='gt_ggc_e_17rtx_def_const_int' value='539'/>
      <enumerator name='gt_ggc_e_15rtx_def_trap_if' value='540'/>
      <enumerator name='gt_ggc_e_17rtx_def_eh_return' value='541'/>
      <enumerator name='gt_ggc_e_21rtx_def_simple_return' value='542'/>
      <enumerator name='gt_ggc_e_14rtx_def_return' value='543'/>
      <enumerator name='gt_ggc_e_12rtx_def_call' value='544'/>
      <enumerator name='gt_ggc_e_15rtx_def_clobber' value='545'/>
      <enumerator name='gt_ggc_e_11rtx_def_use' value='546'/>
      <enumerator name='gt_ggc_e_11rtx_def_set' value='547'/>
      <enumerator name='gt_ggc_e_16rtx_def_prefetch' value='548'/>
      <enumerator name='gt_ggc_e_21rtx_def_addr_diff_vec' value='549'/>
      <enumerator name='gt_ggc_e_16rtx_def_addr_vec' value='550'/>
      <enumerator name='gt_ggc_e_23rtx_def_unspec_volatile' value='551'/>
      <enumerator name='gt_ggc_e_14rtx_def_unspec' value='552'/>
      <enumerator name='gt_ggc_e_20rtx_def_asm_operands' value='553'/>
      <enumerator name='gt_ggc_e_17rtx_def_asm_input' value='554'/>
      <enumerator name='gt_ggc_e_16rtx_def_parallel' value='555'/>
      <enumerator name='gt_ggc_e_17rtx_def_cond_exec' value='556'/>
      <enumerator name='gt_ggc_e_12rtx_def_note' value='557'/>
      <enumerator name='gt_ggc_e_18rtx_def_code_label' value='558'/>
      <enumerator name='gt_ggc_e_15rtx_def_barrier' value='559'/>
      <enumerator name='gt_ggc_e_17rtx_def_call_insn' value='560'/>
      <enumerator name='gt_ggc_e_17rtx_def_jump_insn' value='561'/>
      <enumerator name='gt_ggc_e_12rtx_def_insn' value='562'/>
      <enumerator name='gt_ggc_e_18rtx_def_debug_insn' value='563'/>
      <enumerator name='gt_ggc_e_15rtx_def_address' value='564'/>
      <enumerator name='gt_ggc_e_16rtx_def_sequence' value='565'/>
      <enumerator name='gt_ggc_e_17rtx_def_insn_list' value='566'/>
      <enumerator name='gt_ggc_e_17rtx_def_expr_list' value='567'/>
      <enumerator name='gt_ggc_e_18rtx_def_debug_expr' value='568'/>
      <enumerator name='gt_ggc_e_13rtx_def_value' value='569'/>
      <enumerator name='gt_ggc_e_15rtx_def_UnKnown' value='570'/>
      <enumerator name='gt_ggc_e_23rtx_def_symbol_subunion' value='571'/>
      <enumerator name='gt_ggc_e_21rtx_def_note_subunion' value='572'/>
      <enumerator name='gt_ggc_e_23constant_descriptor_rtx' value='573'/>
      <enumerator name='gt_ggc_e_11fixed_value' value='574'/>
      <enumerator name='gt_ggc_e_10real_value' value='575'/>
      <enumerator name='gt_ggc_e_12block_symbol' value='576'/>
      <enumerator name='gt_ggc_e_12object_block' value='577'/>
      <enumerator name='gt_ggc_e_9reg_attrs' value='578'/>
      <enumerator name='gt_ggc_e_9mem_attrs' value='579'/>
      <enumerator name='gt_ggc_e_13coverage_data' value='580'/>
      <enumerator name='gt_ggc_e_14bitmap_obstack' value='581'/>
      <enumerator name='gt_ggc_e_18bitmap_element_def' value='582'/>
      <enumerator name='gt_ggc_e_12splay_tree_s' value='583'/>
      <enumerator name='gt_ggc_e_17splay_tree_node_s' value='584'/>
      <enumerator name='gt_ggc_e_4htab' value='585'/>
      <enumerator name='gt_ggc_e_16machine_function' value='586'/>
      <enumerator name='gt_ggc_e_17stack_local_entry' value='587'/>
      <enumerator name='gt_ggc_e_19machine_frame_state' value='588'/>
      <enumerator name='gt_ggc_e_10VEC_rtx_gc' value='589'/>
      <enumerator name='gt_ggc_e_12VEC_rtx_base' value='590'/>
      <enumerator name='gt_ggc_e_13VEC_gimple_gc' value='591'/>
      <enumerator name='gt_ggc_e_15VEC_gimple_base' value='592'/>
      <enumerator name='gt_ggc_e_11VEC_tree_gc' value='593'/>
      <enumerator name='gt_ggc_e_13VEC_tree_none' value='594'/>
      <enumerator name='gt_ggc_e_13VEC_tree_base' value='595'/>
      <enumerator name='gt_ggc_e_12VEC_uchar_gc' value='596'/>
      <enumerator name='gt_ggc_e_14VEC_uchar_base' value='597'/>
      <enumerator name='gt_ggc_e_10vec_prefix' value='598'/>
      <enumerator name='gt_ggc_e_15basic_block_def' value='599'/>
      <enumerator name='gt_ggc_e_8edge_def' value='600'/>
      <enumerator name='gt_ggc_e_12gimple_seq_d' value='601'/>
      <enumerator name='gt_ggc_e_15cl_optimization' value='602'/>
      <enumerator name='gt_ggc_e_16cl_target_option' value='603'/>
      <enumerator name='gt_ggc_e_7section' value='604'/>
      <enumerator name='gt_ggc_e_18gimple_statement_d' value='605'/>
      <enumerator name='gt_ggc_e_9rtvec_def' value='606'/>
      <enumerator name='gt_ggc_e_7rtx_def' value='607'/>
      <enumerator name='gt_ggc_e_15bitmap_head_def' value='608'/>
      <enumerator name='gt_ggc_e_11cpp_macro_u' value='609'/>
      <enumerator name='gt_ggc_e_13ht_identifier' value='610'/>
      <enumerator name='gt_ggc_e_19_cpp_hashnode_value' value='611'/>
      <enumerator name='gt_ggc_e_11cpp_token_u' value='612'/>
      <enumerator name='gt_ggc_e_14cpp_identifier' value='613'/>
      <enumerator name='gt_ggc_e_13cpp_macro_arg' value='614'/>
      <enumerator name='gt_ggc_e_6answer' value='615'/>
      <enumerator name='gt_ggc_e_9cpp_macro' value='616'/>
      <enumerator name='gt_ggc_e_10cpp_string' value='617'/>
      <enumerator name='gt_ggc_e_9cpp_token' value='618'/>
      <enumerator name='gt_ggc_e_9line_maps' value='619'/>
      <enumerator name='gt_ggc_e_9maps_info' value='620'/>
      <enumerator name='gt_ggc_e_8line_map' value='621'/>
      <enumerator name='gt_ggc_e_5map_u' value='622'/>
      <enumerator name='gt_ggc_e_14line_map_macro' value='623'/>
      <enumerator name='gt_ggc_e_9tree_node' value='624'/>
      <enumerator name='gt_ggc_e_12cpp_hashnode' value='625'/>
      <enumerator name='gt_ggc_e_17line_map_ordinary' value='626'/>
      <enumerator name='gt_e_II17splay_tree_node_s' value='627'/>
      <enumerator name='gt_e_SP9tree_node17splay_tree_node_s' value='628'/>
      <enumerator name='gt_e_P9tree_nodeP9tree_node17splay_tree_node_s' value='629'/>
      <enumerator name='gt_e_P17string_descriptor4htab' value='630'/>
      <enumerator name='gt_e_P14type_assertion4htab' value='631'/>
      <enumerator name='gt_e_P18treetreehash_entry4htab' value='632'/>
      <enumerator name='gt_e_P17module_htab_entry4htab' value='633'/>
      <enumerator name='gt_e_P21pending_abstract_type4htab' value='634'/>
      <enumerator name='gt_e_P14constexpr_call4htab' value='635'/>
      <enumerator name='gt_e_P16constexpr_fundef4htab' value='636'/>
      <enumerator name='gt_e_P10spec_entry4htab' value='637'/>
      <enumerator name='gt_e_P16cxx_int_tree_map4htab' value='638'/>
      <enumerator name='gt_e_P17named_label_entry4htab' value='639'/>
      <enumerator name='gt_e_P17lto_in_decl_state4htab' value='640'/>
      <enumerator name='gt_e_P20lto_symtab_entry_def4htab' value='641'/>
      <enumerator name='gt_e_P9tree_nodeP9tree_node12splay_tree_s' value='642'/>
      <enumerator name='gt_e_P12varpool_node4htab' value='643'/>
      <enumerator name='gt_e_P13scev_info_str4htab' value='644'/>
      <enumerator name='gt_e_P15tm_restart_node4htab' value='645'/>
      <enumerator name='gt_e_P12tree_int_map4htab' value='646'/>
      <enumerator name='gt_e_P8tree_map4htab' value='647'/>
      <enumerator name='gt_e_P23constant_descriptor_rtx4htab' value='648'/>
      <enumerator name='gt_e_P24constant_descriptor_tree4htab' value='649'/>
      <enumerator name='gt_e_P12object_block4htab' value='650'/>
      <enumerator name='gt_e_P7section4htab' value='651'/>
      <enumerator name='gt_e_P17tree_priority_map4htab' value='652'/>
      <enumerator name='gt_e_P12tree_vec_map4htab' value='653'/>
      <enumerator name='gt_e_P13tree_decl_map4htab' value='654'/>
      <enumerator name='gt_e_P9type_hash4htab' value='655'/>
      <enumerator name='gt_e_P23temp_slot_address_entry4htab' value='656'/>
      <enumerator name='gt_e_P15throw_stmt_node4htab' value='657'/>
      <enumerator name='gt_e_P9reg_attrs4htab' value='658'/>
      <enumerator name='gt_e_P9mem_attrs4htab' value='659'/>
      <enumerator name='gt_e_P7rtx_def4htab' value='660'/>
      <enumerator name='gt_e_P22cached_dw_loc_list_def4htab' value='661'/>
      <enumerator name='gt_e_P16var_loc_list_def4htab' value='662'/>
      <enumerator name='gt_e_P10die_struct4htab' value='663'/>
      <enumerator name='gt_e_P15dwarf_file_data4htab' value='664'/>
      <enumerator name='gt_e_P20indirect_string_node4htab' value='665'/>
      <enumerator name='gt_e_SP9tree_node12splay_tree_s' value='666'/>
      <enumerator name='gt_e_P11cgraph_node4htab' value='667'/>
      <enumerator name='gt_e_II12splay_tree_s' value='668'/>
      <enumerator name='gt_e_P11cgraph_edge4htab' value='669'/>
      <enumerator name='gt_e_P9loop_exit4htab' value='670'/>
      <enumerator name='gt_e_P24types_used_by_vars_entry4htab' value='671'/>
      <enumerator name='gt_e_P9tree_node4htab' value='672'/>
      <enumerator name='gt_e_P13libfunc_entry4htab' value='673'/>
      <enumerator name='gt_types_enum_last' value='674'/>
    </enum-decl>
    <function-decl name='ggc_alloc_typed_stat' mangled-name='_Z20ggc_alloc_typed_stat13gt_types_enumm' filepath='../.././gcc/ggc-none.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20ggc_alloc_typed_stat13gt_types_enumm'>
      <parameter type-id='10faaf37' name='gte' filepath='../.././gcc/ggc-none.c' line='36' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='../.././gcc/ggc-none.c' line='36' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='ggc_round_alloc_size' mangled-name='_Z20ggc_round_alloc_sizem' filepath='../.././gcc/ggc-none.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20ggc_round_alloc_sizem'>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='ggc_internal_alloc_stat' mangled-name='_Z23ggc_internal_alloc_statm' filepath='../.././gcc/ggc-none.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z23ggc_internal_alloc_statm'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='ggc_internal_cleared_alloc_stat' mangled-name='_Z31ggc_internal_cleared_alloc_statm' filepath='../.././gcc/ggc-none.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z31ggc_internal_cleared_alloc_statm'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='ggc_realloc_stat' mangled-name='_Z16ggc_realloc_statPvm' filepath='../.././gcc/ggc-none.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16ggc_realloc_statPvm'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='ggc_free' mangled-name='_Z8ggc_freePv' filepath='../.././gcc/ggc-none.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8ggc_freePv'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <var-decl name='rtl_zone' type-id='8465e599' mangled-name='rtl_zone' visibility='default' filepath='../.././gcc/ggc-none.c' line='80' column='1' elf-symbol-id='rtl_zone'/>
    <var-decl name='tree_zone' type-id='8465e599' mangled-name='tree_zone' visibility='default' filepath='../.././gcc/ggc-none.c' line='81' column='1' elf-symbol-id='tree_zone'/>
    <var-decl name='tree_id_zone' type-id='8465e599' mangled-name='tree_id_zone' visibility='default' filepath='../.././gcc/ggc-none.c' line='82' column='1' elf-symbol-id='tree_id_zone'/>
  </abi-instr>
  <abi-instr address-size='64' path='../.././gcc/input.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='588' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='80f4b756' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='95e97e5e' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='column' type-id='95e97e5e' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sysp' type-id='c894953d' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='598' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='linemap_stats' size-in-bits='704' is-struct='yes' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='685' column='1' id='cc195293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_ordinary_maps_allocated' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_ordinary_maps_used' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ordinary_maps_allocated_size' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ordinary_maps_used_size' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='num_expanded_macros' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_macro_tokens' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='num_macro_maps_used' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='macro_maps_allocated_size' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='macro_maps_used_size' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='macro_maps_locations_size' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='duplicated_macro_maps_locations_size' type-id='bd54fe1a' visibility='default' filepath='../.././gcc/../libcpp/include/line-map.h' line='697' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='cc195293' size-in-bits='64' id='b1493fd3'/>
    <var-decl name='input_location' type-id='801326d8' mangled-name='input_location' visibility='default' filepath='../.././gcc/input.c' line='29' column='1' elf-symbol-id='input_location'/>
    <var-decl name='line_table' type-id='0bd89647' mangled-name='line_table' visibility='default' filepath='../.././gcc/input.c' line='31' column='1' elf-symbol-id='line_table'/>
    <function-decl name='expand_location' mangled-name='_Z15expand_locationj' filepath='../.././gcc/input.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15expand_locationj'>
      <parameter type-id='a4ae40b1'/>
      <return type-id='13eff86d'/>
    </function-decl>
    <function-decl name='dump_line_table_statistics' mangled-name='_Z26dump_line_table_statisticsv' filepath='../.././gcc/input.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z26dump_line_table_statisticsv'>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././gcc/intl.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
    <type-decl name='wchar_t' size-in-bits='32' id='c523b9f1'/>
    <typedef-decl name='nl_item' type-id='95e97e5e' filepath='/usr/include/nl_types.h' line='37' column='1' id='03b79a94'/>
    <qualified-type-def type-id='c523b9f1' const='yes' id='effb3702'/>
    <pointer-type-def type-id='effb3702' size-in-bits='64' id='f077d3f8'/>
    <pointer-type-def type-id='c523b9f1' size-in-bits='64' id='323d93c1'/>
    <var-decl name='open_quote' type-id='80f4b756' mangled-name='open_quote' visibility='default' filepath='../.././gcc/intl.c' line='31' column='1' elf-symbol-id='open_quote'/>
    <var-decl name='close_quote' type-id='80f4b756' mangled-name='close_quote' visibility='default' filepath='../.././gcc/intl.c' line='34' column='1' elf-symbol-id='close_quote'/>
    <var-decl name='locale_encoding' type-id='80f4b756' mangled-name='locale_encoding' visibility='default' filepath='../.././gcc/intl.c' line='37' column='1' elf-symbol-id='locale_encoding'/>
    <var-decl name='locale_utf8' type-id='c894953d' mangled-name='locale_utf8' visibility='default' filepath='../.././gcc/intl.c' line='40' column='1' elf-symbol-id='locale_utf8'/>
    <function-decl name='gcc_init_libintl' mangled-name='_Z16gcc_init_libintlv' filepath='../.././gcc/intl.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16gcc_init_libintlv'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gcc_gettext_width' mangled-name='_Z17gcc_gettext_widthPKc' filepath='../.././gcc/intl.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17gcc_gettext_widthPKc'>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='get_spaces' mangled-name='_Z10get_spacesPKc' filepath='../.././gcc/intl.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z10get_spacesPKc'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='nl_langinfo' filepath='/usr/include/langinfo.h' line='584' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='03b79a94'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='textdomain' filepath='/usr/include/libintl.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='bindtextdomain' filepath='/usr/include/libintl.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='setlocale' filepath='/usr/include/locale.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='/usr/include/stdlib.h' line='871' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='strcasecmp' filepath='/usr/include/string.h' line='536' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wcswidth' filepath='/usr/include/wchar.h' line='441' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././gcc/pretty-print.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
    <typedef-decl name='iconv_t' type-id='eaa32e2f' filepath='/usr/include/iconv.h' line='30' column='1' id='61bff1ba'/>
    <qualified-type-def type-id='a9d58e0b' const='yes' id='a8195e1b'/>
    <pointer-type-def type-id='a8195e1b' size-in-bits='64' id='d0ef4723'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <pointer-type-def type-id='848c08bf' size-in-bits='64' id='5a7caabb'/>
    <function-decl name='xstrerror' filepath='../.././gcc/../include/libiberty.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='pp_write_text_to_stream' mangled-name='_Z23pp_write_text_to_streamP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z23pp_write_text_to_streamP17pretty_print_info'>
      <parameter type-id='674e59c0'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_indent' mangled-name='_Z14pp_base_indentP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z14pp_base_indentP17pretty_print_info'>
      <parameter type-id='674e59c0'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_format' mangled-name='_Z14pp_base_formatP17pretty_print_infoP9text_info' filepath='../.././gcc/pretty-print.c' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z14pp_base_formatP17pretty_print_infoP9text_info'>
      <parameter type-id='674e59c0'/>
      <parameter type-id='77cd2cd7'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_output_formatted_text' mangled-name='_Z29pp_base_output_formatted_textP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z29pp_base_output_formatted_textP17pretty_print_info'>
      <parameter type-id='674e59c0'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_format_verbatim' mangled-name='_Z23pp_base_format_verbatimP17pretty_print_infoP9text_info' filepath='../.././gcc/pretty-print.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z23pp_base_format_verbatimP17pretty_print_infoP9text_info'>
      <parameter type-id='674e59c0'/>
      <parameter type-id='77cd2cd7'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_flush' mangled-name='_Z13pp_base_flushP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='574' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z13pp_base_flushP17pretty_print_info'>
      <parameter type-id='674e59c0'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_set_line_maximum_length' mangled-name='_Z31pp_base_set_line_maximum_lengthP17pretty_print_infoi' filepath='../.././gcc/pretty-print.c' line='587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z31pp_base_set_line_maximum_lengthP17pretty_print_infoi'>
      <parameter type-id='674e59c0' name='pp' filepath='../.././gcc/pretty-print.c' line='587' column='1'/>
      <parameter type-id='95e97e5e' name='length' filepath='../.././gcc/pretty-print.c' line='587' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_clear_output_area' mangled-name='_Z25pp_base_clear_output_areaP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z25pp_base_clear_output_areaP17pretty_print_info'>
      <parameter type-id='674e59c0'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_set_prefix' mangled-name='_Z18pp_base_set_prefixP17pretty_print_infoPKc' filepath='../.././gcc/pretty-print.c' line='603' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z18pp_base_set_prefixP17pretty_print_infoPKc'>
      <parameter type-id='674e59c0'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_destroy_prefix' mangled-name='_Z22pp_base_destroy_prefixP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='613' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z22pp_base_destroy_prefixP17pretty_print_info'>
      <parameter type-id='674e59c0'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_emit_prefix' mangled-name='_Z19pp_base_emit_prefixP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19pp_base_emit_prefixP17pretty_print_info'>
      <parameter type-id='674e59c0'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_construct' mangled-name='_Z12pp_constructP17pretty_print_infoPKci' filepath='../.././gcc/pretty-print.c' line='657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z12pp_constructP17pretty_print_infoPKci'>
      <parameter type-id='674e59c0'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_append_text' mangled-name='_Z19pp_base_append_textP17pretty_print_infoPKcS2_' filepath='../.././gcc/pretty-print.c' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19pp_base_append_textP17pretty_print_infoPKcS2_'>
      <parameter type-id='674e59c0' name='pp' filepath='../.././gcc/pretty-print.c' line='677' column='1'/>
      <parameter type-id='80f4b756' name='start' filepath='../.././gcc/pretty-print.c' line='677' column='1'/>
      <parameter type-id='80f4b756' name='end' filepath='../.././gcc/pretty-print.c' line='677' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_formatted_text' mangled-name='_Z22pp_base_formatted_textP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z22pp_base_formatted_textP17pretty_print_info'>
      <parameter type-id='674e59c0' name='pp' filepath='../.././gcc/pretty-print.c' line='693' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='pp_base_last_position_in_text' mangled-name='_Z29pp_base_last_position_in_textPK17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z29pp_base_last_position_in_textPK17pretty_print_info'>
      <parameter type-id='d0ef4723' name='pp' filepath='../.././gcc/pretty-print.c' line='702' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='pp_base_remaining_character_count_for_line' mangled-name='_Z42pp_base_remaining_character_count_for_lineP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z42pp_base_remaining_character_count_for_lineP17pretty_print_info'>
      <parameter type-id='674e59c0' name='pp' filepath='../.././gcc/pretty-print.c' line='715' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pp_printf' mangled-name='_Z9pp_printfP17pretty_print_infoPKcz' filepath='../.././gcc/pretty-print.c' line='723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z9pp_printfP17pretty_print_infoPKcz'>
      <parameter type-id='674e59c0'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_verbatim' mangled-name='_Z11pp_verbatimP17pretty_print_infoPKcz' filepath='../.././gcc/pretty-print.c' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z11pp_verbatimP17pretty_print_infoPKcz'>
      <parameter type-id='674e59c0'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_newline' mangled-name='_Z15pp_base_newlineP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15pp_base_newlineP17pretty_print_info'>
      <parameter type-id='674e59c0'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_character' mangled-name='_Z17pp_base_characterP17pretty_print_infoi' filepath='../.././gcc/pretty-print.c' line='767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17pp_base_characterP17pretty_print_infoi'>
      <parameter type-id='674e59c0' name='pp' filepath='../.././gcc/pretty-print.c' line='587' column='1'/>
      <parameter type-id='95e97e5e' name='length' filepath='../.././gcc/pretty-print.c' line='587' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_string' mangled-name='_Z14pp_base_stringP17pretty_print_infoPKc' filepath='../.././gcc/pretty-print.c' line='783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z14pp_base_stringP17pretty_print_infoPKc'>
      <parameter type-id='674e59c0'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pp_base_maybe_space' mangled-name='_Z19pp_base_maybe_spaceP17pretty_print_info' filepath='../.././gcc/pretty-print.c' line='791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19pp_base_maybe_spaceP17pretty_print_info'>
      <parameter type-id='674e59c0'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <var-decl name='identifier_to_locale_alloc' type-id='5a7caabb' mangled-name='identifier_to_locale_alloc' visibility='default' filepath='../.././gcc/pretty-print.c' line='859' column='1' elf-symbol-id='identifier_to_locale_alloc'/>
    <var-decl name='identifier_to_locale_free' type-id='b7f9d8e6' mangled-name='identifier_to_locale_free' visibility='default' filepath='../.././gcc/pretty-print.c' line='860' column='1' elf-symbol-id='identifier_to_locale_free'/>
    <function-decl name='identifier_to_locale' mangled-name='_Z20identifier_to_localePKc' filepath='../.././gcc/pretty-print.c' line='873' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20identifier_to_localePKc'>
      <parameter type-id='80f4b756'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='iconv_open' filepath='/usr/include/iconv.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='61bff1ba'/>
    </function-decl>
    <function-decl name='iconv' filepath='/usr/include/iconv.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='61bff1ba'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='78c01427'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='78c01427'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='iconv_close' filepath='/usr/include/iconv.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='61bff1ba'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='sprintf' filepath='/usr/include/stdio.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='7359adad'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././gcc/tlink.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
    <typedef-decl name='hashval_t' type-id='f0981eeb' filepath='../.././gcc/../include/hashtab.h' line='47' column='1' id='decaf000'/>
    <typedef-decl name='htab_hash' type-id='2509443b' filepath='../.././gcc/../include/hashtab.h' line='52' column='1' id='d47b70fc'/>
    <typedef-decl name='htab_eq' type-id='585e1de9' filepath='../.././gcc/../include/hashtab.h' line='59' column='1' id='4be57d5e'/>
    <typedef-decl name='htab_del' type-id='b7f9d8e6' filepath='../.././gcc/../include/hashtab.h' line='63' column='1' id='4194ca21'/>
    <typedef-decl name='htab_alloc' type-id='3e23471c' filepath='../.././gcc/../include/hashtab.h' line='75' column='1' id='46520a41'/>
    <typedef-decl name='htab_free' type-id='b7f9d8e6' filepath='../.././gcc/../include/hashtab.h' line='78' column='1' id='92b3d4b2'/>
    <typedef-decl name='htab_alloc_with_arg' type-id='48c21c06' filepath='../.././gcc/../include/hashtab.h' line='82' column='1' id='79abfb69'/>
    <typedef-decl name='htab_free_with_arg' type-id='debb4ee8' filepath='../.././gcc/../include/hashtab.h' line='83' column='1' id='44c8ccfc'/>
    <typedef-decl name='htab_t' type-id='62189a7c' filepath='../.././gcc/../include/hashtab.h' line='144' column='1' id='b387c4d8'/>
    <enum-decl name='insert_option' filepath='../.././gcc/../include/hashtab.h' line='147' column='1' id='ddafe633'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='NO_INSERT' value='0'/>
      <enumerator name='INSERT' value='1'/>
    </enum-decl>
    <class-decl name='symbol_hash_entry' size-in-bits='256' is-struct='yes' visibility='default' filepath='../.././gcc/tlink.c' line='53' column='1' id='c14c9745'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='80f4b756' visibility='default' filepath='../.././gcc/tlink.c' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='file' type-id='790fb2ef' visibility='default' filepath='../.././gcc/tlink.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='chosen' type-id='95e97e5e' visibility='default' filepath='../.././gcc/tlink.c' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tweaking' type-id='95e97e5e' visibility='default' filepath='../.././gcc/tlink.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tweaked' type-id='95e97e5e' visibility='default' filepath='../.././gcc/tlink.c' line='59' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='symbol' type-id='c14c9745' filepath='../.././gcc/tlink.c' line='60' column='1' id='ad3be5a8'/>
    <class-decl name='file_hash_entry' size-in-bits='320' is-struct='yes' visibility='default' filepath='../.././gcc/tlink.c' line='62' column='1' id='48c409b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='80f4b756' visibility='default' filepath='../.././gcc/tlink.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='args' type-id='80f4b756' visibility='default' filepath='../.././gcc/tlink.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dir' type-id='80f4b756' visibility='default' filepath='../.././gcc/tlink.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='main' type-id='80f4b756' visibility='default' filepath='../.././gcc/tlink.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tweaking' type-id='95e97e5e' visibility='default' filepath='../.././gcc/tlink.c' line='68' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='file' type-id='48c409b7' filepath='../.././gcc/tlink.c' line='69' column='1' id='acc1017a'/>
    <class-decl name='symbol_stack_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='../.././gcc/tlink.c' line='188' column='1' id='425dd7a1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='0fa20e21' visibility='default' filepath='../.././gcc/tlink.c' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='bad40339' visibility='default' filepath='../.././gcc/tlink.c' line='191' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_stack_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='../.././gcc/tlink.c' line='196' column='1' id='357c8aaf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='77e79a4b' visibility='default' filepath='../.././gcc/tlink.c' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='d27b2487' visibility='default' filepath='../.././gcc/tlink.c' line='199' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='htab' size-in-bits='896' is-struct='yes' visibility='default' filepath='../.././libiberty/../include/hashtab.h' line='100' column='1' id='e8622676'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash_f' type-id='d47b70fc' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='eq_f' type-id='4be57d5e' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='del_f' type-id='4194ca21' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='entries' type-id='63e171df' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='n_elements' type-id='b59d7dce' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='n_deleted' type-id='b59d7dce' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='searches' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='collisions' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='alloc_f' type-id='46520a41' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='free_f' type-id='92b3d4b2' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='alloc_arg' type-id='eaa32e2f' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='alloc_with_arg_f' type-id='79abfb69' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='free_with_arg_f' type-id='44c8ccfc' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='size_prime_index' type-id='f0981eeb' visibility='default' filepath='../.././gcc/../include/hashtab.h' line='141' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='acc1017a' size-in-bits='64' id='77e79a4b'/>
    <pointer-type-def type-id='48c409b7' size-in-bits='64' id='790fb2ef'/>
    <pointer-type-def type-id='357c8aaf' size-in-bits='64' id='d27b2487'/>
    <pointer-type-def type-id='e8622676' size-in-bits='64' id='62189a7c'/>
    <pointer-type-def type-id='96ee24a5' size-in-bits='64' id='585e1de9'/>
    <pointer-type-def type-id='ad3be5a8' size-in-bits='64' id='0fa20e21'/>
    <pointer-type-def type-id='425dd7a1' size-in-bits='64' id='bad40339'/>
    <pointer-type-def type-id='3b3c849f' size-in-bits='64' id='2509443b'/>
    <pointer-type-def type-id='c039af2e' size-in-bits='64' id='debb4ee8'/>
    <pointer-type-def type-id='46281162' size-in-bits='64' id='3e23471c'/>
    <pointer-type-def type-id='d77a0bb4' size-in-bits='64' id='48c21c06'/>
    <function-decl name='cplus_demangle' filepath='../.././gcc/../include/demangle.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='htab_create' filepath='../.././gcc/../include/hashtab.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='d47b70fc'/>
      <parameter type-id='4be57d5e'/>
      <parameter type-id='4194ca21'/>
      <return type-id='b387c4d8'/>
    </function-decl>
    <function-decl name='htab_find_slot_with_hash' filepath='../.././gcc/../include/hashtab.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b387c4d8'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='decaf000'/>
      <parameter type-id='ddafe633'/>
      <return type-id='63e171df'/>
    </function-decl>
    <function-decl name='htab_hash_string' filepath='../.././gcc/../include/hashtab.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='decaf000'/>
    </function-decl>
    <function-decl name='getpwd' filepath='../.././gcc/../include/libiberty.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='26a90f95'/>
    </function-decl>
    <var-decl name='symbol_stack_obstack' type-id='c7763f94' mangled-name='symbol_stack_obstack' visibility='default' filepath='../.././gcc/tlink.c' line='193' column='1' elf-symbol-id='symbol_stack_obstack'/>
    <var-decl name='symbol_stack' type-id='bad40339' mangled-name='symbol_stack' visibility='default' filepath='../.././gcc/tlink.c' line='194' column='1' elf-symbol-id='symbol_stack'/>
    <var-decl name='file_stack_obstack' type-id='c7763f94' mangled-name='file_stack_obstack' visibility='default' filepath='../.././gcc/tlink.c' line='201' column='1' elf-symbol-id='file_stack_obstack'/>
    <var-decl name='file_stack' type-id='d27b2487' mangled-name='file_stack' visibility='default' filepath='../.././gcc/tlink.c' line='202' column='1' elf-symbol-id='file_stack'/>
    <function-decl name='do_tlink' mangled-name='_Z8do_tlinkPPcS0_' filepath='../.././gcc/tlink.c' line='821' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8do_tlinkPPcS0_'>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='9b23c9ad'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='remove' filepath='/usr/include/stdio.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756' name='name' filepath='../.././gcc/collect2.c' line='475' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fscanf' filepath='/usr/include/stdio.h' line='429' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='putenv' filepath='/usr/include/stdlib.h' line='579' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='chdir' filepath='/usr/include/unistd.h' line='494' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756' name='name' filepath='../.././gcc/collect2.c' line='475' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='96ee24a5'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='3b3c849f'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='decaf000'/>
    </function-type>
    <function-type size-in-bits='64' id='c039af2e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='d77a0bb4'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../.././gcc/vec.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
    <function-decl name='xrealloc' filepath='../.././gcc/../include/libiberty.h' line='307' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_gc_p_reserve' mangled-name='_Z16vec_gc_p_reservePvi' filepath='../.././gcc/vec.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16vec_gc_p_reservePvi'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_gc_p_reserve_exact' mangled-name='_Z22vec_gc_p_reserve_exactPvi' filepath='../.././gcc/vec.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z22vec_gc_p_reserve_exactPvi'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_gc_o_reserve' mangled-name='_Z16vec_gc_o_reservePvimm' filepath='../.././gcc/vec.c' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16vec_gc_o_reservePvimm'>
      <parameter type-id='eaa32e2f' name='vec' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='95e97e5e' name='reserve' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='vec_offset' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='elt_size' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_gc_o_reserve_exact' mangled-name='_Z22vec_gc_o_reserve_exactPvimm' filepath='../.././gcc/vec.c' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z22vec_gc_o_reserve_exactPvimm'>
      <parameter type-id='eaa32e2f' name='vec' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='95e97e5e' name='reserve' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='vec_offset' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='elt_size' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_heap_p_reserve' mangled-name='_Z18vec_heap_p_reservePvi' filepath='../.././gcc/vec.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z18vec_heap_p_reservePvi'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_heap_p_reserve_exact' mangled-name='_Z24vec_heap_p_reserve_exactPvi' filepath='../.././gcc/vec.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z24vec_heap_p_reserve_exactPvi'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_heap_o_reserve' mangled-name='_Z18vec_heap_o_reservePvimm' filepath='../.././gcc/vec.c' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z18vec_heap_o_reservePvimm'>
      <parameter type-id='eaa32e2f' name='vec' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='95e97e5e' name='reserve' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='vec_offset' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='elt_size' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_heap_o_reserve_exact' mangled-name='_Z24vec_heap_o_reserve_exactPvimm' filepath='../.././gcc/vec.c' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z24vec_heap_o_reserve_exactPvimm'>
      <parameter type-id='eaa32e2f' name='vec' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='95e97e5e' name='reserve' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='vec_offset' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='elt_size' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_stack_p_reserve_exact_1' mangled-name='_Z27vec_stack_p_reserve_exact_1iPv' filepath='../.././gcc/vec.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z27vec_stack_p_reserve_exact_1iPv'>
      <parameter type-id='95e97e5e' name='alloc' filepath='../.././gcc/vec.c' line='400' column='1'/>
      <parameter type-id='eaa32e2f' name='space' filepath='../.././gcc/vec.c' line='400' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_stack_p_reserve' mangled-name='_Z19vec_stack_p_reservePvi' filepath='../.././gcc/vec.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19vec_stack_p_reservePvi'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_stack_p_reserve_exact' mangled-name='_Z25vec_stack_p_reserve_exactPvi' filepath='../.././gcc/vec.c' line='470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z25vec_stack_p_reserve_exactPvi'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_stack_o_reserve' mangled-name='_Z19vec_stack_o_reservePvimm' filepath='../.././gcc/vec.c' line='481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19vec_stack_o_reservePvimm'>
      <parameter type-id='eaa32e2f' name='vec' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='95e97e5e' name='reserve' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='vec_offset' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='elt_size' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_stack_o_reserve_exact' mangled-name='_Z25vec_stack_o_reserve_exactPvimm' filepath='../.././gcc/vec.c' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z25vec_stack_o_reserve_exactPvimm'>
      <parameter type-id='eaa32e2f' name='vec' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='95e97e5e' name='reserve' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='vec_offset' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <parameter type-id='b59d7dce' name='elt_size' filepath='../.././gcc/vec.c' line='284' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='vec_stack_free' mangled-name='_Z14vec_stack_freePv' filepath='../.././gcc/vec.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z14vec_stack_freePv'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='dump_vec_loc_statistics' mangled-name='_Z23dump_vec_loc_statisticsv' filepath='../.././gcc/vec.c' line='563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z23dump_vec_loc_statisticsv'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='dbbc84e0'>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-type>
    <function-type size-in-bits='64' id='8190a159'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../.././gcc/version.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/gcc' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='248' id='d6dfd241'>
      <subrange length='31' type-id='4c87fef4' id='ae5e1d19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='48' id='4a008bc3'>
      <subrange length='6' type-id='4c87fef4' id='52fa524b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='56' id='4e02d0a6'>
      <subrange length='7' type-id='4c87fef4' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9b45d938' size-in-bits='248' id='a3a30ca0'>
      <subrange length='31' type-id='4c87fef4' id='ae5e1d19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9b45d938' size-in-bits='48' id='049fa520'>
      <subrange length='6' type-id='4c87fef4' id='52fa524b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9b45d938' size-in-bits='56' id='089d6cd5'>
      <subrange length='7' type-id='4c87fef4' id='16fc326e'/>
    </array-type-def>
    <var-decl name='bug_report_url' type-id='a3a30ca0' mangled-name='bug_report_url' visibility='default' filepath='../.././gcc/version.c' line='29' column='1' elf-symbol-id='bug_report_url'/>
    <var-decl name='version_string' type-id='049fa520' mangled-name='version_string' visibility='default' filepath='../.././gcc/version.c' line='35' column='1' elf-symbol-id='version_string'/>
    <var-decl name='pkgversion_string' type-id='089d6cd5' mangled-name='pkgversion_string' visibility='default' filepath='../.././gcc/version.c' line='36' column='1' elf-symbol-id='pkgversion_string'/>
  </abi-instr>
  <abi-instr address-size='64' path='../.././libcpp/charset.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/libcpp' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='478b3e6b' size-in-bits='64' id='e1330053'/>
    <function-decl name='cpp_init_iconv' mangled-name='_Z14cpp_init_iconvP10cpp_reader' filepath='../.././libcpp/charset.c' line='700' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z14cpp_init_iconvP10cpp_reader'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_destroy_iconv' mangled-name='_cpp_destroy_iconv' filepath='../.././libcpp/charset.c' line='740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_destroy_iconv'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_host_to_exec_charset' mangled-name='_Z24cpp_host_to_exec_charsetP10cpp_readerj' filepath='../.././libcpp/charset.c' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z24cpp_host_to_exec_charsetP10cpp_readerj'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/charset.c' line='770' column='1'/>
      <parameter type-id='e0daff96' name='c' filepath='../.././libcpp/charset.c' line='770' column='1'/>
      <return type-id='e0daff96'/>
    </function-decl>
    <function-decl name='_cpp_valid_ucn' mangled-name='_cpp_valid_ucn' filepath='../.././libcpp/charset.c' line='983' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_valid_ucn'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/charset.c' line='983' column='1'/>
      <parameter type-id='e1330053' name='pstr' filepath='../.././libcpp/charset.c' line='983' column='1'/>
      <parameter type-id='478b3e6b' name='limit' filepath='../.././libcpp/charset.c' line='984' column='1'/>
      <parameter type-id='95e97e5e' name='identifier_pos' filepath='../.././libcpp/charset.c' line='984' column='1'/>
      <parameter type-id='c9df9420' name='nst' filepath='../.././libcpp/charset.c' line='985' column='1'/>
      <return type-id='e0daff96'/>
    </function-decl>
    <function-decl name='cpp_interpret_string' mangled-name='_Z20cpp_interpret_stringP10cpp_readerPK10cpp_stringmPS1_9cpp_ttype' filepath='../.././libcpp/charset.c' line='1371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20cpp_interpret_stringP10cpp_readerPK10cpp_stringmPS1_9cpp_ttype'>
      <parameter type-id='56559d26'/>
      <parameter type-id='12e818df'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='6000a288'/>
      <parameter type-id='a3a7bd6a'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_interpret_string_notranslate' mangled-name='_Z32cpp_interpret_string_notranslateP10cpp_readerPK10cpp_stringmPS1_9cpp_ttype' filepath='../.././libcpp/charset.c' line='1452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z32cpp_interpret_string_notranslateP10cpp_readerPK10cpp_stringmPS1_9cpp_ttype'>
      <parameter type-id='56559d26'/>
      <parameter type-id='12e818df'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='6000a288'/>
      <parameter type-id='a3a7bd6a'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_interpret_charconst' mangled-name='_Z23cpp_interpret_charconstP10cpp_readerPK9cpp_tokenPjPi' filepath='../.././libcpp/charset.c' line='1602' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z23cpp_interpret_charconstP10cpp_readerPK9cpp_tokenPjPi'>
      <parameter type-id='56559d26'/>
      <parameter type-id='23db21b3'/>
      <parameter type-id='807869d3'/>
      <parameter type-id='7292109c'/>
      <return type-id='e0daff96'/>
    </function-decl>
    <function-decl name='_cpp_interpret_identifier' mangled-name='_cpp_interpret_identifier' filepath='../.././libcpp/charset.c' line='1634' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_interpret_identifier'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/charset.c' line='1634' column='1'/>
      <parameter type-id='478b3e6b' name='id' filepath='../.././libcpp/charset.c' line='1634' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='../.././libcpp/charset.c' line='1634' column='1'/>
      <return type-id='6646eec7'/>
    </function-decl>
    <function-decl name='_cpp_convert_input' mangled-name='_cpp_convert_input' filepath='../.././libcpp/charset.c' line='1698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_convert_input'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/charset.c' line='1698' column='1'/>
      <parameter type-id='80f4b756' name='input_charset' filepath='../.././libcpp/charset.c' line='1698' column='1'/>
      <parameter type-id='bb0164b2' name='input' filepath='../.././libcpp/charset.c' line='1699' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='../.././libcpp/charset.c' line='1699' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='../.././libcpp/charset.c' line='1699' column='1'/>
      <parameter type-id='7f244169' name='buffer_start' filepath='../.././libcpp/charset.c' line='1700' column='1'/>
      <parameter type-id='e90c4311' name='st_size' filepath='../.././libcpp/charset.c' line='1700' column='1'/>
      <return type-id='bb0164b2'/>
    </function-decl>
    <function-decl name='_cpp_default_encoding' mangled-name='_cpp_default_encoding' filepath='../.././libcpp/charset.c' line='1767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_default_encoding'>
      <return type-id='80f4b756'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././libcpp/directives.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/libcpp' language='LANG_C_plus_plus'>
    <typedef-decl name='pragma_cb' type-id='fabdf7b3' filepath='../.././libcpp/directives.c' line='43' column='1' id='a335ce14'/>
    <typedef-decl name='cpp_options' type-id='9d36a6db' filepath='../.././libcpp/include/cpplib.h' line='33' column='1' id='36cbf820'/>
    <typedef-decl name='cpp_callbacks' type-id='f0bc2ca1' filepath='../.././libcpp/include/cpplib.h' line='38' column='1' id='9bb26066'/>
    <typedef-decl name='cpp_cb' type-id='26a643e4' filepath='../.././libcpp/include/cpplib.h' line='994' column='1' id='1bff93cf'/>
    <enum-decl name='include_type' filepath='../.././libcpp/internal.h' line='120' column='1' id='da5947d9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IT_INCLUDE' value='0'/>
      <enumerator name='IT_INCLUDE_NEXT' value='1'/>
      <enumerator name='IT_IMPORT' value='2'/>
      <enumerator name='IT_CMDLINE' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='9bb26066' size-in-bits='64' id='68737059'/>
    <pointer-type-def type-id='36cbf820' size-in-bits='64' id='35d1fb1b'/>
    <pointer-type-def type-id='206efe5f' size-in-bits='64' id='6000a288'/>
    <pointer-type-def type-id='ceb974d2' size-in-bits='64' id='26a643e4'/>
    <pointer-type-def type-id='f0981eeb' size-in-bits='64' id='807869d3'/>
    <function-decl name='xmemdup' filepath='../.././libcpp/../include/libiberty.h' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='cpp_undef_all' mangled-name='_Z13cpp_undef_allP10cpp_reader' filepath='../.././libcpp/directives.c' line='639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z13cpp_undef_allP10cpp_reader'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_do_file_change' mangled-name='_cpp_do_file_change' filepath='../.././libcpp/directives.c' line='1034' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_do_file_change'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='1034' column='1'/>
      <parameter type-id='0894acca' name='reason' filepath='../.././libcpp/directives.c' line='1034' column='1'/>
      <parameter type-id='80f4b756' name='to_file' filepath='../.././libcpp/directives.c' line='1035' column='1'/>
      <parameter type-id='edf70f83' name='file_line' filepath='../.././libcpp/directives.c' line='1035' column='1'/>
      <parameter type-id='f0981eeb' name='sysp' filepath='../.././libcpp/directives.c' line='1036' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_register_pragma' mangled-name='_Z19cpp_register_pragmaP10cpp_readerPKcS2_PFvS0_Eb' filepath='../.././libcpp/directives.c' line='1214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19cpp_register_pragmaP10cpp_readerPKcS2_PFvS0_Eb'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='1214' column='1'/>
      <parameter type-id='80f4b756' name='space' filepath='../.././libcpp/directives.c' line='1214' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='../.././libcpp/directives.c' line='1214' column='1'/>
      <parameter type-id='a335ce14' name='handler' filepath='../.././libcpp/directives.c' line='1215' column='1'/>
      <parameter type-id='c894953d' name='allow_expansion' filepath='../.././libcpp/directives.c' line='1215' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_register_deferred_pragma' mangled-name='_Z28cpp_register_deferred_pragmaP10cpp_readerPKcS2_jbb' filepath='../.././libcpp/directives.c' line='1237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z28cpp_register_deferred_pragmaP10cpp_readerPKcS2_jbb'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='1237' column='1'/>
      <parameter type-id='80f4b756' name='space' filepath='../.././libcpp/directives.c' line='1237' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='../.././libcpp/directives.c' line='1238' column='1'/>
      <parameter type-id='f0981eeb' name='ident' filepath='../.././libcpp/directives.c' line='1238' column='1'/>
      <parameter type-id='c894953d' name='allow_expansion' filepath='../.././libcpp/directives.c' line='1239' column='1'/>
      <parameter type-id='c894953d' name='allow_name_expansion' filepath='../.././libcpp/directives.c' line='1239' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_init_internal_pragmas' mangled-name='_cpp_init_internal_pragmas' filepath='../.././libcpp/directives.c' line='1254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_init_internal_pragmas'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_save_pragma_names' mangled-name='_cpp_save_pragma_names' filepath='../.././libcpp/directives.c' line='1304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_save_pragma_names'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='1304' column='1'/>
      <return type-id='9b23c9ad'/>
    </function-decl>
    <function-decl name='_cpp_restore_pragma_names' mangled-name='_cpp_restore_pragma_names' filepath='../.././libcpp/directives.c' line='1333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_restore_pragma_names'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='1333' column='1'/>
      <parameter type-id='9b23c9ad' name='saved' filepath='../.././libcpp/directives.c' line='1333' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_test_assertion' mangled-name='_cpp_test_assertion' filepath='../.././libcpp/directives.c' line='2225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_test_assertion'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='2225' column='1'/>
      <parameter type-id='807869d3' name='value' filepath='../.././libcpp/directives.c' line='2225' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='cpp_define' mangled-name='_Z10cpp_defineP10cpp_readerPKc' filepath='../.././libcpp/directives.c' line='2331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z10cpp_defineP10cpp_readerPKc'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_define_formatted' mangled-name='_Z20cpp_define_formattedP10cpp_readerPKcz' filepath='../.././libcpp/directives.c' line='2364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20cpp_define_formattedP10cpp_readerPKcz'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='2364' column='1'/>
      <parameter type-id='80f4b756' name='fmt' filepath='../.././libcpp/directives.c' line='2364' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_define_builtin' mangled-name='_cpp_define_builtin' filepath='../.././libcpp/directives.c' line='2380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_define_builtin'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_undef' mangled-name='_Z9cpp_undefP10cpp_readerPKc' filepath='../.././libcpp/directives.c' line='2391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z9cpp_undefP10cpp_readerPKc'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_assert' mangled-name='_Z10cpp_assertP10cpp_readerPKc' filepath='../.././libcpp/directives.c' line='2455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z10cpp_assertP10cpp_readerPKc'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_unassert' mangled-name='_Z12cpp_unassertP10cpp_readerPKc' filepath='../.././libcpp/directives.c' line='2462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z12cpp_unassertP10cpp_readerPKc'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_get_options' mangled-name='_Z15cpp_get_optionsP10cpp_reader' filepath='../.././libcpp/directives.c' line='2492' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15cpp_get_optionsP10cpp_reader'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='2492' column='1'/>
      <return type-id='35d1fb1b'/>
    </function-decl>
    <function-decl name='cpp_get_callbacks' mangled-name='_Z17cpp_get_callbacksP10cpp_reader' filepath='../.././libcpp/directives.c' line='2499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17cpp_get_callbacksP10cpp_reader'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='2499' column='1'/>
      <return type-id='68737059'/>
    </function-decl>
    <function-decl name='cpp_set_callbacks' mangled-name='_Z17cpp_set_callbacksP10cpp_readerP13cpp_callbacks' filepath='../.././libcpp/directives.c' line='2506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17cpp_set_callbacksP10cpp_readerP13cpp_callbacks'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='2506' column='1'/>
      <parameter type-id='68737059' name='cb' filepath='../.././libcpp/directives.c' line='2506' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_get_deps' mangled-name='_Z12cpp_get_depsP10cpp_reader' filepath='../.././libcpp/directives.c' line='2513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z12cpp_get_depsP10cpp_reader'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='2513' column='1'/>
      <return type-id='5e7cf1cf'/>
    </function-decl>
    <function-decl name='cpp_push_buffer' mangled-name='_Z15cpp_push_bufferP10cpp_readerPKhmi' filepath='../.././libcpp/directives.c' line='2524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15cpp_push_bufferP10cpp_readerPKhmi'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/directives.c' line='2524' column='1'/>
      <parameter type-id='478b3e6b' name='buffer' filepath='../.././libcpp/directives.c' line='2524' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='../.././libcpp/directives.c' line='2524' column='1'/>
      <parameter type-id='95e97e5e' name='from_stage3' filepath='../.././libcpp/directives.c' line='2525' column='1'/>
      <return type-id='c77c6c95'/>
    </function-decl>
    <function-decl name='_cpp_init_directives' mangled-name='_cpp_init_directives' filepath='../.././libcpp/directives.c' line='2580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_init_directives'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_mark_file_once_only' mangled-name='_cpp_mark_file_once_only' filepath='../.././libcpp/internal.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_mark_file_once_only'>
      <parameter type-id='56559d26'/>
      <parameter type-id='db390ca4'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_fake_include' mangled-name='_cpp_fake_include' filepath='../.././libcpp/internal.h' line='627' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_fake_include'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_stack_include' mangled-name='_cpp_stack_include' filepath='../.././libcpp/internal.h' line='629' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_stack_include'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='da5947d9'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='_cpp_compare_file_date' mangled-name='_cpp_compare_file_date' filepath='../.././libcpp/internal.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_compare_file_date'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='_cpp_pop_file_buffer' mangled-name='_cpp_pop_file_buffer' filepath='../.././libcpp/internal.h' line='635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_pop_file_buffer'>
      <parameter type-id='56559d26'/>
      <parameter type-id='db390ca4'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_parse_expr' mangled-name='_cpp_parse_expr' filepath='../.././libcpp/internal.h' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_parse_expr'>
      <parameter type-id='56559d26'/>
      <parameter type-id='c894953d'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='_cpp_lex_identifier' mangled-name='_cpp_lex_identifier' filepath='../.././libcpp/internal.h' line='655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_lex_identifier'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <return type-id='6646eec7'/>
    </function-decl>
    <function-decl name='_cpp_overlay_buffer' filepath='../.././libcpp/internal.h' line='690' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='56559d26'/>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='strcspn' filepath='/usr/include/string.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././libcpp/errors.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/libcpp' language='LANG_C_plus_plus'>
    <function-decl name='cpp_error' mangled-name='_Z9cpp_errorP10cpp_readeriPKcz' filepath='../.././libcpp/errors.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z9cpp_errorP10cpp_readeriPKcz'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_warning' mangled-name='_Z11cpp_warningP10cpp_readeriPKcz' filepath='../.././libcpp/errors.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z11cpp_warningP10cpp_readeriPKcz'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_pedwarning' mangled-name='_Z14cpp_pedwarningP10cpp_readeriPKcz' filepath='../.././libcpp/errors.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z14cpp_pedwarningP10cpp_readeriPKcz'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_warning_syshdr' mangled-name='_Z18cpp_warning_syshdrP10cpp_readeriPKcz' filepath='../.././libcpp/errors.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z18cpp_warning_syshdrP10cpp_readeriPKcz'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_error_with_line' mangled-name='_Z19cpp_error_with_lineP10cpp_readerijjPKcz' filepath='../.././libcpp/errors.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19cpp_error_with_lineP10cpp_readerijjPKcz'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='a4ae40b1'/>
      <parameter type-id='f0981eeb'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_warning_with_line' mangled-name='_Z21cpp_warning_with_lineP10cpp_readerijjPKcz' filepath='../.././libcpp/errors.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z21cpp_warning_with_lineP10cpp_readerijjPKcz'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='a4ae40b1'/>
      <parameter type-id='f0981eeb'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_pedwarning_with_line' mangled-name='_Z24cpp_pedwarning_with_lineP10cpp_readerijjPKcz' filepath='../.././libcpp/errors.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z24cpp_pedwarning_with_lineP10cpp_readerijjPKcz'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='a4ae40b1'/>
      <parameter type-id='f0981eeb'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_warning_with_line_syshdr' mangled-name='_Z28cpp_warning_with_line_syshdrP10cpp_readerijjPKcz' filepath='../.././libcpp/errors.c' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z28cpp_warning_with_line_syshdrP10cpp_readerijjPKcz'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='a4ae40b1'/>
      <parameter type-id='f0981eeb'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_errno' mangled-name='_Z9cpp_errnoP10cpp_readeriPKc' filepath='../.././libcpp/errors.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z9cpp_errnoP10cpp_readeriPKc'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='dgettext' filepath='/usr/include/libintl.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././libcpp/expr.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/libcpp' language='LANG_C_plus_plus'>
    <typedef-decl name='cppchar_t' type-id='f0981eeb' filepath='../.././libcpp/include/cpplib.h' line='269' column='1' id='e0daff96'/>
    <typedef-decl name='cpp_num_part' type-id='7359adad' filepath='../.././libcpp/include/cpplib.h' line='799' column='1' id='eca4d5b6'/>
    <typedef-decl name='cpp_num' type-id='cd5f00fd' filepath='../.././libcpp/include/cpplib.h' line='800' column='1' id='2d384da6'/>
    <class-decl name='cpp_num' size-in-bits='192' is-struct='yes' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='801' column='1' id='cd5f00fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='high' type-id='eca4d5b6' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='low' type-id='eca4d5b6' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='unsignedp' type-id='c894953d' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='805' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='overflow' type-id='c894953d' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='806' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='cpp_interpret_float_suffix' mangled-name='_Z26cpp_interpret_float_suffixPKcm' filepath='../.././libcpp/expr.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z26cpp_interpret_float_suffixPKcm'>
      <parameter type-id='80f4b756' name='s' filepath='../.././libcpp/expr.c' line='190' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='../.././libcpp/expr.c' line='190' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='cpp_interpret_int_suffix' mangled-name='_Z24cpp_interpret_int_suffixPKcm' filepath='../.././libcpp/expr.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z24cpp_interpret_int_suffixPKcm'>
      <parameter type-id='80f4b756' name='s' filepath='../.././libcpp/expr.c' line='190' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='../.././libcpp/expr.c' line='190' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='cpp_userdef_string_remove_type' mangled-name='_Z30cpp_userdef_string_remove_type9cpp_ttype' filepath='../.././libcpp/expr.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z30cpp_userdef_string_remove_type9cpp_ttype'>
      <parameter type-id='a3a7bd6a' name='type' filepath='../.././libcpp/expr.c' line='240' column='1'/>
      <return type-id='a3a7bd6a'/>
    </function-decl>
    <function-decl name='cpp_userdef_string_add_type' mangled-name='_Z27cpp_userdef_string_add_type9cpp_ttype' filepath='../.././libcpp/expr.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z27cpp_userdef_string_add_type9cpp_ttype'>
      <parameter type-id='a3a7bd6a' name='type' filepath='../.././libcpp/expr.c' line='240' column='1'/>
      <return type-id='a3a7bd6a'/>
    </function-decl>
    <function-decl name='cpp_userdef_char_remove_type' mangled-name='_Z28cpp_userdef_char_remove_type9cpp_ttype' filepath='../.././libcpp/expr.c' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z28cpp_userdef_char_remove_type9cpp_ttype'>
      <parameter type-id='a3a7bd6a' name='type' filepath='../.././libcpp/expr.c' line='240' column='1'/>
      <return type-id='a3a7bd6a'/>
    </function-decl>
    <function-decl name='cpp_userdef_char_add_type' mangled-name='_Z25cpp_userdef_char_add_type9cpp_ttype' filepath='../.././libcpp/expr.c' line='298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z25cpp_userdef_char_add_type9cpp_ttype'>
      <parameter type-id='a3a7bd6a' name='type' filepath='../.././libcpp/expr.c' line='240' column='1'/>
      <return type-id='a3a7bd6a'/>
    </function-decl>
    <function-decl name='cpp_userdef_string_p' mangled-name='_Z20cpp_userdef_string_p9cpp_ttype' filepath='../.././libcpp/expr.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20cpp_userdef_string_p9cpp_ttype'>
      <parameter type-id='a3a7bd6a' name='type' filepath='../.././libcpp/expr.c' line='314' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_userdef_char_p' mangled-name='_Z18cpp_userdef_char_p9cpp_ttype' filepath='../.././libcpp/expr.c' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z18cpp_userdef_char_p9cpp_ttype'>
      <parameter type-id='a3a7bd6a' name='type' filepath='../.././libcpp/expr.c' line='314' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_get_userdef_suffix' mangled-name='_Z22cpp_get_userdef_suffixPK9cpp_token' filepath='../.././libcpp/expr.c' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z22cpp_get_userdef_suffixPK9cpp_token'>
      <parameter type-id='23db21b3' name='tok' filepath='../.././libcpp/expr.c' line='341' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='cpp_classify_number' mangled-name='_Z19cpp_classify_numberP10cpp_readerPK9cpp_tokenPPKc' filepath='../.././libcpp/expr.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19cpp_classify_numberP10cpp_readerPK9cpp_tokenPPKc'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/expr.c' line='364' column='1'/>
      <parameter type-id='23db21b3' name='token' filepath='../.././libcpp/expr.c' line='364' column='1'/>
      <parameter type-id='7d3cd834' name='ud_suffix' filepath='../.././libcpp/expr.c' line='365' column='1'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='cpp_interpret_integer' mangled-name='_Z21cpp_interpret_integerP10cpp_readerPK9cpp_tokenj' filepath='../.././libcpp/expr.c' line='635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z21cpp_interpret_integerP10cpp_readerPK9cpp_tokenj'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/expr.c' line='635' column='1'/>
      <parameter type-id='23db21b3' name='token' filepath='../.././libcpp/expr.c' line='635' column='1'/>
      <parameter type-id='f0981eeb' name='type' filepath='../.././libcpp/expr.c' line='636' column='1'/>
      <return type-id='2d384da6'/>
    </function-decl>
    <function-decl name='_cpp_expand_op_stack' mangled-name='_cpp_expand_op_stack' filepath='../.././libcpp/expr.c' line='1396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_expand_op_stack'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/expr.c' line='1396' column='1'/>
      <return type-id='5f220d80'/>
    </function-decl>
    <function-decl name='cpp_num_sign_extend' mangled-name='_Z19cpp_num_sign_extend7cpp_numm' filepath='../.././libcpp/expr.c' line='1464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19cpp_num_sign_extend7cpp_numm'>
      <parameter type-id='2d384da6' name='num' filepath='../.././libcpp/expr.c' line='1464' column='1'/>
      <parameter type-id='b59d7dce' name='precision' filepath='../.././libcpp/expr.c' line='1464' column='1'/>
      <return type-id='2d384da6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././libcpp/files.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/libcpp' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' id='d1617432'>
      <subrange length='256' type-id='4c87fef4' id='36e5b9fa'/>
    </array-type-def>
    <typedef-decl name='htab_trav' type-id='9d606d6b' filepath='../.././libcpp/../include/hashtab.h' line='69' column='1' id='78f55c81'/>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='23' column='1' id='611586a1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='e43e523d' visibility='default' filepath='/usr/include/bits/dirent.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='79989e9c' visibility='default' filepath='/usr/include/bits/dirent.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='8efea9e5' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='002ac4a6' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='d1617432' visibility='default' filepath='/usr/include/bits/dirent.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ssize_t' type-id='bd54fe1a' filepath='/usr/include/bits/types.h' line='180' column='1' id='41060289'/>
    <typedef-decl name='DIR' type-id='20cd73f2' filepath='/usr/include/dirent.h' line='128' column='1' id='54a5d683'/>
    <typedef-decl name='off_t' type-id='79989e9c' filepath='/usr/include/stdio.h' line='91' column='1' id='ad707ada'/>
    <typedef-decl name='ssize_t' type-id='41060289' filepath='/usr/include/stdio.h' line='103' column='1' id='79a0948f'/>
    <typedef-decl name='__compar_fn_t' type-id='585e1de9' filepath='/usr/include/stdlib.h' line='742' column='1' id='aba7edd8'/>
    <pointer-type-def type-id='54a5d683' size-in-bits='64' id='f09217ba'/>
    <pointer-type-def type-id='354f7eb9' size-in-bits='64' id='7f244169'/>
    <pointer-type-def type-id='611586a1' size-in-bits='64' id='2e243169'/>
    <pointer-type-def type-id='02fafe77' size-in-bits='64' id='9d606d6b'/>
    <pointer-type-def type-id='ad707ada' size-in-bits='64' id='e90c4311'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f2'/>
    <function-decl name='htab_create_alloc' filepath='../.././libcpp/../include/hashtab.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='d47b70fc'/>
      <parameter type-id='4be57d5e'/>
      <parameter type-id='4194ca21'/>
      <parameter type-id='46520a41'/>
      <parameter type-id='92b3d4b2'/>
      <return type-id='b387c4d8'/>
    </function-decl>
    <function-decl name='htab_delete' filepath='../.././libcpp/../include/hashtab.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b387c4d8'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='htab_find_with_hash' filepath='../.././libcpp/../include/hashtab.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b387c4d8'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='decaf000'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='htab_traverse' filepath='../.././libcpp/../include/hashtab.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b387c4d8'/>
      <parameter type-id='78f55c81'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='htab_elements' filepath='../.././libcpp/../include/hashtab.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b387c4d8'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='fdopen_unlocked' filepath='../.././libcpp/../include/libiberty.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='md5_stream' filepath='../.././libcpp/../include/md5.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='md5_buffer' filepath='../.././libcpp/../include/md5.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='_cpp_find_failed' mangled-name='_cpp_find_failed' filepath='../.././libcpp/files.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_find_failed'>
      <parameter type-id='db390ca4' name='file' filepath='../.././libcpp/files.c' line='432' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='_cpp_find_file' mangled-name='_cpp_find_file' filepath='../.././libcpp/files.c' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_find_file'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/files.c' line='452' column='1'/>
      <parameter type-id='80f4b756' name='fname' filepath='../.././libcpp/files.c' line='452' column='1'/>
      <parameter type-id='36e869a4' name='start_dir' filepath='../.././libcpp/files.c' line='452' column='1'/>
      <parameter type-id='c894953d' name='fake' filepath='../.././libcpp/files.c' line='452' column='1'/>
      <parameter type-id='95e97e5e' name='angle_brackets' filepath='../.././libcpp/files.c' line='452' column='1'/>
      <return type-id='db390ca4'/>
    </function-decl>
    <function-decl name='_cpp_stack_file' mangled-name='_cpp_stack_file' filepath='../.././libcpp/files.c' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_stack_file'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/files.c' line='796' column='1'/>
      <parameter type-id='db390ca4' name='file' filepath='../.././libcpp/files.c' line='796' column='1'/>
      <parameter type-id='c894953d' name='import' filepath='../.././libcpp/files.c' line='796' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_included' mangled-name='_Z12cpp_includedP10cpp_readerPKc' filepath='../.././libcpp/files.c' line='1097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z12cpp_includedP10cpp_readerPKc'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/files.c' line='1097' column='1'/>
      <parameter type-id='80f4b756' name='fname' filepath='../.././libcpp/files.c' line='1097' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_included_before' mangled-name='_Z19cpp_included_beforeP10cpp_readerPKcj' filepath='../.././libcpp/files.c' line='1114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19cpp_included_beforeP10cpp_readerPKcj'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/files.c' line='1114' column='1'/>
      <parameter type-id='80f4b756' name='fname' filepath='../.././libcpp/files.c' line='1114' column='1'/>
      <parameter type-id='a4ae40b1' name='location' filepath='../.././libcpp/files.c' line='1115' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='_cpp_init_files' mangled-name='_cpp_init_files' filepath='../.././libcpp/files.c' line='1170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_init_files'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_cleanup_files' mangled-name='_cpp_cleanup_files' filepath='../.././libcpp/files.c' line='1187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_cleanup_files'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_clear_file_cache' mangled-name='_Z20cpp_clear_file_cacheP10cpp_reader' filepath='../.././libcpp/files.c' line='1200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20cpp_clear_file_cacheP10cpp_reader'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_make_system_header' mangled-name='_Z22cpp_make_system_headerP10cpp_readerii' filepath='../.././libcpp/files.c' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z22cpp_make_system_headerP10cpp_readerii'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_change_file' mangled-name='_Z15cpp_change_fileP10cpp_reader9lc_reasonPKc' filepath='../.././libcpp/files.c' line='1236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15cpp_change_fileP10cpp_reader9lc_reasonPKc'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/files.c' line='1236' column='1'/>
      <parameter type-id='0894acca' name='reason' filepath='../.././libcpp/files.c' line='1236' column='1'/>
      <parameter type-id='80f4b756' name='new_name' filepath='../.././libcpp/files.c' line='1237' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_report_missing_guards' mangled-name='_cpp_report_missing_guards' filepath='../.././libcpp/files.c' line='1289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_report_missing_guards'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_push_include' mangled-name='_Z16cpp_push_includeP10cpp_readerPKc' filepath='../.././libcpp/files.c' line='1346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16cpp_push_includeP10cpp_readerPKc'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/files.c' line='1097' column='1'/>
      <parameter type-id='80f4b756' name='fname' filepath='../.././libcpp/files.c' line='1097' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='cpp_set_include_chains' mangled-name='_Z22cpp_set_include_chainsP10cpp_readerP7cpp_dirS2_i' filepath='../.././libcpp/files.c' line='1393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z22cpp_set_include_chainsP10cpp_readerP7cpp_dirS2_i'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/files.c' line='1393' column='1'/>
      <parameter type-id='36e869a4' name='quote' filepath='../.././libcpp/files.c' line='1393' column='1'/>
      <parameter type-id='36e869a4' name='bracket' filepath='../.././libcpp/files.c' line='1393' column='1'/>
      <parameter type-id='95e97e5e' name='quote_ignores_source_dir' filepath='../.././libcpp/files.c' line='1394' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_get_path' mangled-name='_Z12cpp_get_pathP9_cpp_file' filepath='../.././libcpp/files.c' line='1603' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z12cpp_get_pathP9_cpp_file'>
      <parameter type-id='db390ca4'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='cpp_get_dir' mangled-name='_Z11cpp_get_dirP9_cpp_file' filepath='../.././libcpp/files.c' line='1611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z11cpp_get_dirP9_cpp_file'>
      <parameter type-id='db390ca4' name='f' filepath='../.././libcpp/files.c' line='1611' column='1'/>
      <return type-id='36e869a4'/>
    </function-decl>
    <function-decl name='cpp_get_buffer' mangled-name='_Z14cpp_get_bufferP10cpp_reader' filepath='../.././libcpp/files.c' line='1620' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z14cpp_get_bufferP10cpp_reader'>
      <parameter type-id='56559d26'/>
      <return type-id='c77c6c95'/>
    </function-decl>
    <function-decl name='cpp_get_file' mangled-name='_Z12cpp_get_fileP10cpp_buffer' filepath='../.././libcpp/files.c' line='1628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z12cpp_get_fileP10cpp_buffer'>
      <parameter type-id='c77c6c95'/>
      <return type-id='db390ca4'/>
    </function-decl>
    <function-decl name='cpp_get_prev' mangled-name='_Z12cpp_get_prevP10cpp_buffer' filepath='../.././libcpp/files.c' line='1637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z12cpp_get_prevP10cpp_buffer'>
      <parameter type-id='c77c6c95' name='b' filepath='../.././libcpp/files.c' line='1637' column='1'/>
      <return type-id='c77c6c95'/>
    </function-decl>
    <function-decl name='_cpp_save_file_entries' mangled-name='_cpp_save_file_entries' filepath='../.././libcpp/files.c' line='1684' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_save_file_entries'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/files.c' line='1684' column='1'/>
      <parameter type-id='822cd80b' name='fp' filepath='../.././libcpp/files.c' line='1684' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='_cpp_read_file_entries' mangled-name='_cpp_read_file_entries' filepath='../.././libcpp/files.c' line='1751' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_read_file_entries'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/files.c' line='1684' column='1'/>
      <parameter type-id='822cd80b' name='fp' filepath='../.././libcpp/files.c' line='1684' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='_cpp_convert_input' filepath='../.././libcpp/internal.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='56559d26'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='cf536864'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='7f244169'/>
      <parameter type-id='e90c4311'/>
      <return type-id='cf536864'/>
    </function-decl>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='f09217ba'/>
    </function-decl>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f09217ba'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='readdir' filepath='/usr/include/dirent.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f09217ba'/>
      <return type-id='2e243169'/>
    </function-decl>
    <function-decl name='open' filepath='/usr/include/fcntl.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ungetc' filepath='/usr/include/stdio.h' line='697' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fwrite_unlocked' filepath='/usr/include/stdio.h' line='734' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='822cd80b'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='aba7edd8'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='qsort' filepath='/usr/include/stdlib.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='aba7edd8'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__fxstat' filepath='/usr/include/sys/stat.h' line='401' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='4330df87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-type size-in-bits='64' id='02fafe77'>
      <parameter type-id='63e171df'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../.././libcpp/identifiers.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/libcpp' language='LANG_C_plus_plus'>
    <typedef-decl name='ht_cb' type-id='d2de7c35' filepath='../.././libcpp/include/symtab.h' line='90' column='1' id='c94d84c0'/>
    <pointer-type-def type-id='e7b909b1' size-in-bits='64' id='d2de7c35'/>
    <function-decl name='_cpp_init_hashtable' mangled-name='_cpp_init_hashtable' filepath='../.././libcpp/identifiers.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_init_hashtable'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/identifiers.c' line='48' column='1'/>
      <parameter type-id='0e0cd1dc' name='table' filepath='../.././libcpp/identifiers.c' line='48' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_destroy_hashtable' mangled-name='_cpp_destroy_hashtable' filepath='../.././libcpp/identifiers.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_destroy_hashtable'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_lookup' mangled-name='_Z10cpp_lookupP10cpp_readerPKhj' filepath='../.././libcpp/identifiers.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z10cpp_lookupP10cpp_readerPKhj'>
      <parameter type-id='56559d26'/>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='f0981eeb'/>
      <return type-id='6646eec7'/>
    </function-decl>
    <function-decl name='cpp_defined' mangled-name='_Z11cpp_definedP10cpp_readerPKhi' filepath='../.././libcpp/identifiers.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z11cpp_definedP10cpp_readerPKhi'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/identifiers.c' line='100' column='1'/>
      <parameter type-id='354f7eb9' name='str' filepath='../.././libcpp/identifiers.c' line='100' column='1'/>
      <parameter type-id='95e97e5e' name='len' filepath='../.././libcpp/identifiers.c' line='100' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='cpp_forall_identifiers' mangled-name='_Z22cpp_forall_identifiersP10cpp_readerPFiS0_P12cpp_hashnodePvES3_' filepath='../.././libcpp/identifiers.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z22cpp_forall_identifiersP10cpp_readerPFiS0_P12cpp_hashnodePvES3_'>
      <parameter type-id='56559d26'/>
      <parameter type-id='1bff93cf'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='e7b909b1'>
      <parameter type-id='56559d26'/>
      <parameter type-id='d9ed1768'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../.././libcpp/init.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/libcpp' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='ea86de29' size-in-bits='2048' id='9941c99e'>
      <subrange length='256' type-id='4c87fef4' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='2048' id='f411cbcf'>
      <subrange length='256' type-id='4c87fef4' id='36e5b9fa'/>
    </array-type-def>
    <var-decl name='_cpp_trigraph_map' type-id='f411cbcf' mangled-name='_cpp_trigraph_map' visibility='default' filepath='../.././libcpp/init.c' line='60' column='1' elf-symbol-id='_cpp_trigraph_map'/>
    <function-decl name='cpp_set_lang' mangled-name='_Z12cpp_set_langP10cpp_reader6c_lang' filepath='../.././libcpp/init.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z12cpp_set_langP10cpp_reader6c_lang'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/init.c' line='108' column='1'/>
      <parameter type-id='1498f90e' name='lang' filepath='../.././libcpp/init.c' line='108' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_create_reader' mangled-name='_Z17cpp_create_reader6c_langP2htP9line_maps' filepath='../.././libcpp/init.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17cpp_create_reader6c_langP2htP9line_maps'>
      <parameter type-id='1498f90e' name='lang' filepath='../.././libcpp/init.c' line='152' column='1'/>
      <parameter type-id='0e0cd1dc' name='table' filepath='../.././libcpp/init.c' line='152' column='1'/>
      <parameter type-id='0bd89647' name='line_table' filepath='../.././libcpp/init.c' line='153' column='1'/>
      <return type-id='56559d26'/>
    </function-decl>
    <function-decl name='cpp_set_line_map' mangled-name='_Z16cpp_set_line_mapP10cpp_readerP9line_maps' filepath='../.././libcpp/init.c' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16cpp_set_line_mapP10cpp_readerP9line_maps'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/init.c' line='252' column='1'/>
      <parameter type-id='0bd89647' name='line_table' filepath='../.././libcpp/init.c' line='252' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_destroy' mangled-name='_Z11cpp_destroyP10cpp_reader' filepath='../.././libcpp/init.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z11cpp_destroyP10cpp_reader'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_init_special_builtins' mangled-name='_Z25cpp_init_special_builtinsP10cpp_reader' filepath='../.././libcpp/init.c' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z25cpp_init_special_builtinsP10cpp_reader'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_init_builtins' mangled-name='_Z17cpp_init_builtinsP10cpp_readeri' filepath='../.././libcpp/init.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17cpp_init_builtinsP10cpp_readeri'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_post_options' mangled-name='_Z16cpp_post_optionsP10cpp_reader' filepath='../.././libcpp/init.c' line='555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16cpp_post_optionsP10cpp_reader'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_read_main_file' mangled-name='_Z18cpp_read_main_fileP10cpp_readerPKc' filepath='../.././libcpp/init.c' line='577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z18cpp_read_main_fileP10cpp_readerPKc'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/init.c' line='577' column='1'/>
      <parameter type-id='80f4b756' name='fname' filepath='../.././libcpp/init.c' line='577' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='cpp_finish' mangled-name='_Z10cpp_finishP10cpp_readerP8_IO_FILE' filepath='../.././libcpp/init.c' line='693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z10cpp_finishP10cpp_readerP8_IO_FILE'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/lex.c' line='2649' column='1'/>
      <parameter type-id='822cd80b' name='fp' filepath='../.././libcpp/lex.c' line='2649' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././libcpp/lex.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/libcpp' language='LANG_C_plus_plus'>
    <enum-decl name='cpp_token_fld_kind' filepath='../.././libcpp/include/cpplib.h' line='195' column='1' id='c1491b85'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='CPP_TOKEN_FLD_NODE' value='0'/>
      <enumerator name='CPP_TOKEN_FLD_SOURCE' value='1'/>
      <enumerator name='CPP_TOKEN_FLD_STR' value='2'/>
      <enumerator name='CPP_TOKEN_FLD_ARG_NO' value='3'/>
      <enumerator name='CPP_TOKEN_FLD_TOKEN_NO' value='4'/>
      <enumerator name='CPP_TOKEN_FLD_PRAGMA' value='5'/>
      <enumerator name='CPP_TOKEN_FLD_NONE' value='6'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='961' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='comment' type-id='26a90f95' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='963' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sloc' type-id='a4ae40b1' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='966' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='972' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entries' type-id='6ed67a7e' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='count' type-id='95e97e5e' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='allocated' type-id='95e97e5e' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='980' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cpp_context' type-id='85ac1106' filepath='../.././libcpp/internal.h' line='176' column='1' id='1d493d19'/>
    <class-decl name='normalize_state' size-in-bits='96' is-struct='yes' visibility='default' filepath='../.././libcpp/internal.h' line='706' column='1' id='a0dfe632'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='previous' type-id='e0daff96' visibility='default' filepath='../.././libcpp/internal.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='prev_class' type-id='002ac4a6' visibility='default' filepath='../.././libcpp/internal.h' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='level' type-id='dfd670e8' visibility='default' filepath='../.././libcpp/internal.h' line='713' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='4478b7a8' size-in-bits='64' id='308ab1b7'/>
    <pointer-type-def type-id='a0dfe632' size-in-bits='64' id='c9df9420'/>
    <function-decl name='cpp_named_operator2name' mangled-name='cpp_named_operator2name' filepath='../.././libcpp/internal.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cpp_named_operator2name'>
      <parameter type-id='a3a7bd6a'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='_cpp_valid_ucn' filepath='../.././libcpp/internal.h' line='723' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='56559d26'/>
      <parameter type-id='7f244169'/>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='c9df9420'/>
      <return type-id='e0daff96'/>
    </function-decl>
    <function-decl name='_cpp_interpret_identifier' filepath='../.././libcpp/internal.h' line='731' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='56559d26'/>
      <parameter type-id='354f7eb9'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='6646eec7'/>
    </function-decl>
    <function-decl name='cpp_ideq' mangled-name='_Z8cpp_ideqPK9cpp_tokenPKc' filepath='../.././libcpp/lex.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8cpp_ideqPK9cpp_tokenPKc'>
      <parameter type-id='23db21b3' name='token' filepath='../.././libcpp/lex.c' line='74' column='1'/>
      <parameter type-id='80f4b756' name='string' filepath='../.././libcpp/lex.c' line='74' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='_cpp_init_lexer' mangled-name='_cpp_init_lexer' filepath='../.././libcpp/lex.c' line='645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_init_lexer'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_get_comments' mangled-name='_Z16cpp_get_commentsP10cpp_reader' filepath='../.././libcpp/lex.c' line='1627' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16cpp_get_commentsP10cpp_reader'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/lex.c' line='1627' column='1'/>
      <return type-id='308ab1b7'/>
    </function-decl>
    <function-decl name='_cpp_init_tokenrun' mangled-name='_cpp_init_tokenrun' filepath='../.././libcpp/lex.c' line='1721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_init_tokenrun'>
      <parameter type-id='3cc43cbb' name='run' filepath='../.././libcpp/lex.c' line='1721' column='1'/>
      <parameter type-id='f0981eeb' name='count' filepath='../.././libcpp/lex.c' line='1721' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_cpp_remaining_tokens_num_in_context' mangled-name='_cpp_remaining_tokens_num_in_context' filepath='../.././libcpp/lex.c' line='1745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_cpp_remaining_tokens_num_in_context'>
      <parameter type-id='648f7a0c' name='context' filepath='../.././libcpp/lex.c' line='1745' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='cpp_peek_token' mangled-name='_Z14cpp_peek_tokenP10cpp_readeri' filepath='../.././libcpp/lex.c' line='1772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z14cpp_peek_tokenP10cpp_readeri'>
      <parameter type-id='56559d26'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='23db21b3'/>
    </function-decl>
    <function-decl name='cpp_token_len' mangled-name='_Z13cpp_token_lenPK9cpp_token' filepath='../.././libcpp/lex.c' line='2355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z13cpp_token_lenPK9cpp_token'>
      <parameter type-id='23db21b3'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='cpp_spell_token' mangled-name='_Z15cpp_spell_tokenP10cpp_readerPK9cpp_tokenPhb' filepath='../.././libcpp/lex.c' line='2418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15cpp_spell_tokenP10cpp_readerPK9cpp_tokenPhb'>
      <parameter type-id='56559d26'/>
      <parameter type-id='23db21b3'/>
      <parameter type-id='cf536864'/>
      <parameter type-id='c894953d'/>
      <return type-id='cf536864'/>
    </function-decl>
    <function-decl name='cpp_token_as_text' mangled-name='_Z17cpp_token_as_textP10cpp_readerPK9cpp_token' filepath='../.././libcpp/lex.c' line='2481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17cpp_token_as_textP10cpp_readerPK9cpp_token'>
      <parameter type-id='56559d26'/>
      <parameter type-id='23db21b3'/>
      <return type-id='cf536864'/>
    </function-decl>
    <function-decl name='cpp_type2name' mangled-name='_Z13cpp_type2name9cpp_ttypeh' filepath='../.././libcpp/lex.c' line='2496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z13cpp_type2name9cpp_ttypeh'>
      <parameter type-id='a3a7bd6a' name='type' filepath='../.././libcpp/lex.c' line='2496' column='1'/>
      <parameter type-id='002ac4a6' name='flags' filepath='../.././libcpp/lex.c' line='2496' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='cpp_output_token' mangled-name='_Z16cpp_output_tokenPK9cpp_tokenP8_IO_FILE' filepath='../.././libcpp/lex.c' line='2510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16cpp_output_tokenPK9cpp_tokenP8_IO_FILE'>
      <parameter type-id='23db21b3' name='token' filepath='../.././libcpp/lex.c' line='2510' column='1'/>
      <parameter type-id='822cd80b' name='fp' filepath='../.././libcpp/lex.c' line='2510' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_avoid_paste' mangled-name='_Z15cpp_avoid_pasteP10cpp_readerPK9cpp_tokenS3_' filepath='../.././libcpp/lex.c' line='2592' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15cpp_avoid_pasteP10cpp_readerPK9cpp_tokenS3_'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/lex.c' line='2592' column='1'/>
      <parameter type-id='23db21b3' name='token1' filepath='../.././libcpp/lex.c' line='2592' column='1'/>
      <parameter type-id='23db21b3' name='token2' filepath='../.././libcpp/lex.c' line='2593' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='cpp_output_line' mangled-name='_Z15cpp_output_lineP10cpp_readerP8_IO_FILE' filepath='../.././libcpp/lex.c' line='2649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15cpp_output_lineP10cpp_readerP8_IO_FILE'>
      <parameter type-id='56559d26' name='pfile' filepath='../.././libcpp/lex.c' line='2649' column='1'/>
      <parameter type-id='822cd80b' name='fp' filepath='../.././libcpp/lex.c' line='2649' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_output_line_to_string' mangled-name='_Z25cpp_output_line_to_stringP10cpp_readerPKh' filepath='../.././libcpp/lex.c' line='2669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z25cpp_output_line_to_stringP10cpp_readerPKh'>
      <parameter type-id='56559d26'/>
      <parameter type-id='354f7eb9'/>
      <return type-id='cf536864'/>
    </function-decl>
    <function-decl name='cpp_token_val_index' mangled-name='_Z19cpp_token_val_indexP9cpp_token' filepath='../.././libcpp/lex.c' line='2879' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z19cpp_token_val_indexP9cpp_token'>
      <parameter type-id='f3cb4142' name='tok' filepath='../.././libcpp/lex.c' line='2879' column='1'/>
      <return type-id='c1491b85'/>
    </function-decl>
    <function-decl name='cpp_force_token_locations' mangled-name='_Z25cpp_force_token_locationsP10cpp_readerPj' filepath='../.././libcpp/lex.c' line='2910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z25cpp_force_token_locationsP10cpp_readerPj'>
      <parameter type-id='56559d26' name='r' filepath='../.././libcpp/lex.c' line='2910' column='1'/>
      <parameter type-id='cb7770a4' name='p' filepath='../.././libcpp/lex.c' line='2910' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='cpp_stop_forcing_token_locations' mangled-name='_Z32cpp_stop_forcing_token_locationsP10cpp_reader' filepath='../.././libcpp/lex.c' line='2918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z32cpp_stop_forcing_token_locationsP10cpp_reader'>
      <parameter type-id='56559d26'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='memmove' filepath='/usr/include/string.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../.././libcpp/line-map.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-wfh0ig/gcc-4.7.4/host-x86_64-unknown-linux-gnu/libcpp' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='7df866d4' size-in-bits='192' id='83676493'>
      <subrange length='1' type-id='4c87fef4' id='52f813b4'/>
    </array-type-def>
    <class-decl name='answer' size-in-bits='320' is-struct='yes' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='28' column='1' id='a8c7fb57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='8aa8dcaf' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='count' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='first' type-id='83676493' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpp_macro' size-in-bits='256' is-struct='yes' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='36' column='1' id='0734e92d'>
      <member-type access='public'>
        <union-decl name='cpp_macro_u' size-in-bits='64' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='47' column='1' id='eb4960c4'>
          <data-member access='public'>
            <var-decl name='tokens' type-id='f3cb4142' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='49' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='text' type-id='354f7eb9' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='50' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='eeaa1f17' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exp' type-id='eb4960c4' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='line' type-id='a4ae40b1' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='count' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='paramc' type-id='8efea9e5' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='fun_like' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='209'>
        <var-decl name='variadic' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='210'>
        <var-decl name='syshdr' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='211'>
        <var-decl name='used' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='212'>
        <var-decl name='traditional' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='213'>
        <var-decl name='extra_tokens' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpp-id-data.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cpp_token' type-id='7df866d4' filepath='../.././libcpp/include/cpplib.h' line='34' column='1' id='f8d2f79b'/>
    <typedef-decl name='cpp_hashnode' type-id='50f860cf' filepath='../.././libcpp/include/cpplib.h' line='36' column='1' id='db3ec9ce'/>
    <typedef-decl name='cpp_macro' type-id='0734e92d' filepath='../.././libcpp/include/cpplib.h' line='37' column='1' id='76c1a3a2'/>
    <enum-decl name='cpp_ttype' filepath='../.././libcpp/include/cpplib.h' line='153' column='1' id='a3a7bd6a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='CPP_EQ' value='0'/>
      <enumerator name='CPP_NOT' value='1'/>
      <enumerator name='CPP_GREATER' value='2'/>
      <enumerator name='CPP_LESS' value='3'/>
      <enumerator name='CPP_PLUS' value='4'/>
      <enumerator name='CPP_MINUS' value='5'/>
      <enumerator name='CPP_MULT' value='6'/>
      <enumerator name='CPP_DIV' value='7'/>
      <enumerator name='CPP_MOD' value='8'/>
      <enumerator name='CPP_AND' value='9'/>
      <enumerator name='CPP_OR' value='10'/>
      <enumerator name='CPP_XOR' value='11'/>
      <enumerator name='CPP_RSHIFT' value='12'/>
      <enumerator name='CPP_LSHIFT' value='13'/>
      <enumerator name='CPP_COMPL' value='14'/>
      <enumerator name='CPP_AND_AND' value='15'/>
      <enumerator name='CPP_OR_OR' value='16'/>
      <enumerator name='CPP_QUERY' value='17'/>
      <enumerator name='CPP_COLON' value='18'/>
      <enumerator name='CPP_COMMA' value='19'/>
      <enumerator name='CPP_OPEN_PAREN' value='20'/>
      <enumerator name='CPP_CLOSE_PAREN' value='21'/>
      <enumerator name='CPP_EOF' value='22'/>
      <enumerator name='CPP_EQ_EQ' value='23'/>
      <enumerator name='CPP_NOT_EQ' value='24'/>
      <enumerator name='CPP_GREATER_EQ' value='25'/>
      <enumerator name='CPP_LESS_EQ' value='26'/>
      <enumerator name='CPP_PLUS_EQ' value='27'/>
      <enumerator name='CPP_MINUS_EQ' value='28'/>
      <enumerator name='CPP_MULT_EQ' value='29'/>
      <enumerator name='CPP_DIV_EQ' value='30'/>
      <enumerator name='CPP_MOD_EQ' value='31'/>
      <enumerator name='CPP_AND_EQ' value='32'/>
      <enumerator name='CPP_OR_EQ' value='33'/>
      <enumerator name='CPP_XOR_EQ' value='34'/>
      <enumerator name='CPP_RSHIFT_EQ' value='35'/>
      <enumerator name='CPP_LSHIFT_EQ' value='36'/>
      <enumerator name='CPP_HASH' value='37'/>
      <enumerator name='CPP_PASTE' value='38'/>
      <enumerator name='CPP_OPEN_SQUARE' value='39'/>
      <enumerator name='CPP_CLOSE_SQUARE' value='40'/>
      <enumerator name='CPP_OPEN_BRACE' value='41'/>
      <enumerator name='CPP_CLOSE_BRACE' value='42'/>
      <enumerator name='CPP_SEMICOLON' value='43'/>
      <enumerator name='CPP_ELLIPSIS' value='44'/>
      <enumerator name='CPP_PLUS_PLUS' value='45'/>
      <enumerator name='CPP_MINUS_MINUS' value='46'/>
      <enumerator name='CPP_DEREF' value='47'/>
      <enumerator name='CPP_DOT' value='48'/>
      <enumerator name='CPP_SCOPE' value='49'/>
      <enumerator name='CPP_DEREF_STAR' value='50'/>
      <enumerator name='CPP_DOT_STAR' value='51'/>
      <enumerator name='CPP_ATSIGN' value='52'/>
      <enumerator name='CPP_NAME' value='53'/>
      <enumerator name='CPP_AT_NAME' value='54'/>
      <enumerator name='CPP_NUMBER' value='55'/>
      <enumerator name='CPP_CHAR' value='56'/>
      <enumerator name='CPP_WCHAR' value='57'/>
      <enumerator name='CPP_CHAR16' value='58'/>
      <enumerator name='CPP_CHAR32' value='59'/>
      <enumerator name='CPP_OTHER' value='60'/>
      <enumerator name='CPP_STRING' value='61'/>
      <enumerator name='CPP_WSTRING' value='62'/>
      <enumerator name='CPP_STRING16' value='63'/>
      <enumerator name='CPP_STRING32' value='64'/>
      <enumerator name='CPP_UTF8STRING' value='65'/>
      <enumerator name='CPP_OBJC_STRING' value='66'/>
      <enumerator name='CPP_HEADER_NAME' value='67'/>
      <enumerator name='CPP_CHAR_USERDEF' value='68'/>
      <enumerator name='CPP_WCHAR_USERDEF' value='69'/>
      <enumerator name='CPP_CHAR16_USERDEF' value='70'/>
      <enumerator name='CPP_CHAR32_USERDEF' value='71'/>
      <enumerator name='CPP_STRING_USERDEF' value='72'/>
      <enumerator name='CPP_WSTRING_USERDEF' value='73'/>
      <enumerator name='CPP_STRING16_USERDEF' value='74'/>
      <enumerator name='CPP_STRING32_USERDEF' value='75'/>
      <enumerator name='CPP_UTF8STRING_USERDEF' value='76'/>
      <enumerator name='CPP_COMMENT' value='77'/>
      <enumerator name='CPP_MACRO_ARG' value='78'/>
      <enumerator name='CPP_PRAGMA' value='79'/>
      <enumerator name='CPP_PRAGMA_EOL' value='80'/>
      <enumerator name='CPP_PADDING' value='81'/>
      <enumerator name='N_TTYPES' value='82'/>
      <enumerator name='CPP_LAST_EQ' value='13'/>
      <enumerator name='CPP_FIRST_DIGRAPH' value='37'/>
      <enumerator name='CPP_LAST_PUNCTUATOR' value='52'/>
      <enumerator name='CPP_LAST_CPP_OP' value='26'/>
    </enum-decl>
    <class-decl name='cpp_string' size-in-bits='128' is-struct='yes' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='173' column='1' id='77917e6a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='text' type-id='354f7eb9' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='175' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpp_macro_arg' size-in-bits='32' is-struct='yes' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='206' column='1' id='711e6a06'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arg_no' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='208' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpp_identifier' size-in-bits='64' is-struct='yes' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='212' column='1' id='4dc97ec4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='6646eec7' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='218' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpp_token' size-in-bits='192' is-struct='yes' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='223' column='1' id='7df866d4'>
      <member-type access='public'>
        <union-decl name='cpp_token_u' size-in-bits='128' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='228' column='1' id='edf08776'>
          <data-member access='public'>
            <var-decl name='node' type-id='4dc97ec4' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='231' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='source' type-id='f3cb4142' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='234' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='str' type-id='77917e6a' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='237' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='macro_arg' type-id='711e6a06' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='240' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='token_no' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='244' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='pragma' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='247' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_loc' type-id='a4ae40b1' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type' type-id='a3a7bd6a' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='flags' type-id='8efea9e5' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='val' type-id='edf08776' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='248' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='node_type' filepath='../.././libcpp/include/cpplib.h' line='614' column='1' id='776c9ea1'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='NT_VOID' value='0'/>
      <enumerator name='NT_MACRO' value='1'/>
      <enumerator name='NT_ASSERTION' value='2'/>
    </enum-decl>
    <enum-decl name='cpp_builtin_type' filepath='../.././libcpp/include/cpplib.h' line='623' column='1' id='01dc23f6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BT_SPECLINE' value='0'/>
      <enumerator name='BT_DATE' value='1'/>
      <enumerator name='BT_FILE' value='2'/>
      <enumerator name='BT_BASE_FILE' value='3'/>
      <enumerator name='BT_INCLUDE_LEVEL' value='4'/>
      <enumerator name='BT_TIME' value='5'/>
      <enumerator name='BT_STDC' value='6'/>
      <enumerator name='BT_PRAGMA' value='7'/>
      <enumerator name='BT_TIMESTAMP' value='8'/>
      <enumerator name='BT_COUNTER' value='9'/>
      <enumerator name='BT_FIRST_USER' value='10'/>
      <enumerator name='BT_LAST_USER' value='41'/>
    </enum-decl>
    <union-decl name='_cpp_hashnode_value' size-in-bits='64' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='665' column='1' id='fbabea4d'>
      <data-member access='public'>
        <var-decl name='macro' type-id='0494dcdd' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='667' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='answers' type-id='8aa8dcaf' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='669' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='builtin' type-id='01dc23f6' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='671' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='arg_index' type-id='8efea9e5' visibility='default' filepath='../.././libcpp/include/cpplib.h' line='673' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='ht_identifier' size-in-bits='128' is-struct='yes' visibility='default' filepath='../.././libcpp/include/symtab.h' line='32' column='1' id='58342aa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='354f7eb9' visibility='default' filepath='../.././libcpp/include/symtab.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/symtab.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='hash_value' type-id='f0981eeb' visibility='default' filepath='../.././libcpp/include/symtab.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='a8c7fb57' size-in-bits='64' id='8aa8dcaf'/>
    <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
