<abi-corpus version='2.1' path='data/test-read-dwarf/test14-pr18893.so' soname='libGLU.so.1'>
  <elf-needed>
    <dependency name='libGL.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='gluBeginCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild1DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild1DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild2DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild2DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gluEndTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluErrorString' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetString' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluLoadSamplingMatrices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluLookAt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewNurbsRenderer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewQuadric' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewTess' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNextContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallbackData' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallbackDataEXT' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluOrtho2D' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPartialDisk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPerspective' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPickMatrix' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPwlCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricDrawStyle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricNormals' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricOrientation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricTexture' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluScaleImage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluSphere' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessBeginContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessEndContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessEndPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessNormal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessVertex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluUnProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluUnProject4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='libnurbs/interface/glcurveval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='5120' id='8ac42fbe'>
      <subrange length='160' type-id='7359adad' id='d20f9a26'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='1280' id='2ce43ee1'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <class-decl name='curveEvalMachine' size-in-bits='6592' is-struct='yes' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='55' column='1' id='39487693'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='k' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ustride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctlpoints' type-id='8ac42fbe' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ucoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='curveEvalMachine' type-id='39487693' filepath='libnurbs/interface/glcurveval.h' line='64' column='1' id='a7431a56'/>
    <class-decl name='CachingEvaluator' size-in-bits='64' visibility='default' filepath='libnurbs/internals/cachingeval.h' line='39' column='1' id='98511c0f'>
      <member-type access='private'>
        <enum-decl name='ServiceMode' filepath='libnurbs/internals/cachingeval.h' line='42' column='1' id='85ef429a'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='play' value='0'/>
          <enumerator name='record' value='1'/>
          <enumerator name='playAndRecord' value='2'/>
        </enum-decl>
      </member-type>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~CachingEvaluator' filepath='libnurbs/internals/cachingeval.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='canRecord' mangled-name='_ZN16CachingEvaluator9canRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='canPlayAndRecord' mangled-name='_ZN16CachingEvaluator16canPlayAndRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='createHandle' mangled-name='_ZN16CachingEvaluator12createHandleEi' filepath='libnurbs/internals/cachingeval.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='beginOutput' mangled-name='_ZN16CachingEvaluator11beginOutputENS_11ServiceModeEi' filepath='libnurbs/internals/cachingeval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='85ef429a'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <function-decl name='endOutput' mangled-name='_ZN16CachingEvaluator9endOutputEv' filepath='libnurbs/internals/cachingeval.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='7'>
        <function-decl name='discardRecording' mangled-name='_ZN16CachingEvaluator16discardRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='8'>
        <function-decl name='playRecording' mangled-name='_ZN16CachingEvaluator13playRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d4b6ed87' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='REAL' type-id='a6c45d85' filepath='libnurbs/internals/types.h' line='41' column='1' id='234bc418'/>
    <pointer-type-def type-id='22b18ed5' size-in-bits='64' id='11a0d165'/>
    <pointer-type-def type-id='98511c0f' size-in-bits='64' id='d4b6ed87'/>
    <pointer-type-def type-id='6abc0132' size-in-bits='64' id='a3f18a30'/>
    <pointer-type-def type-id='8d4b0ae2' size-in-bits='64' id='83a254c0'/>
    <pointer-type-def type-id='234bc418' size-in-bits='64' id='c0eda015'/>
    <qualified-type-def type-id='46496ee3' const='yes' id='9d5e4f33'/>
    <pointer-type-def type-id='9d5e4f33' size-in-bits='64' id='d476845b'/>
    <pointer-type-def type-id='a7431a56' size-in-bits='64' id='8278cb23'/>
    <pointer-type-def type-id='6485bd28' size-in-bits='64' id='318ea842'/>
    <pointer-type-def type-id='f267cc92' size-in-bits='64' id='5a82918c'/>
    <class-decl name='CurveMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='6abc0132'/>
    <class-decl name='OpenGLCurveEvaluator' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='66' column='1' is-declaration-only='yes' id='8d4b0ae2'>
      <base-class access='public' layout-offset-in-bits='0' type-id='22b18ed5'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='em_vertex' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='102' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6656'>
        <var-decl name='em_normal' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='103' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13248'>
        <var-decl name='em_color' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='104' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19840'>
        <var-decl name='em_texcoord' type-id='a7431a56' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26432'>
        <var-decl name='vertex_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26464'>
        <var-decl name='normal_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26496'>
        <var-decl name='color_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26528'>
        <var-decl name='texcoord_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26560'>
        <var-decl name='global_grid_u0' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26592'>
        <var-decl name='global_grid_u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <var-decl name='global_grid_nu' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26688'>
        <var-decl name='beginCallBackN' type-id='30135957' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26752'>
        <var-decl name='endCallBackN' type-id='953b12f8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26816'>
        <var-decl name='vertexCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26880'>
        <var-decl name='normalCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26944'>
        <var-decl name='colorCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27008'>
        <var-decl name='texcoordCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27072'>
        <var-decl name='beginCallBackData' type-id='5f8a287b' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27136'>
        <var-decl name='endCallBackData' type-id='b7f9d8e6' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27200'>
        <var-decl name='vertexCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27264'>
        <var-decl name='normalCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27328'>
        <var-decl name='colorCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <var-decl name='texcoordCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <var-decl name='userData' type-id='eaa32e2f' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <var-decl name='output_triangles' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='154' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='addMap' mangled-name='_ZN20OpenGLCurveEvaluator6addMapEP8CurveMap' filepath='libnurbs/interface/glcurveval.cc' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='a3f18a30'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='putCallBack' mangled-name='_ZN20OpenGLCurveEvaluator11putCallBackEjPFvvE' filepath='libnurbs/interface/glcurveval.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='055aa60e'/>
          <parameter type-id='9fac4a53'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='beginCallBack' mangled-name='_ZN20OpenGLCurveEvaluator13beginCallBackEjPv' filepath='libnurbs/interface/glcurveval.cc' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='055aa60e'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='endCallBack' mangled-name='_ZN20OpenGLCurveEvaluator11endCallBackEPv' filepath='libnurbs/interface/glcurveval.cc' line='359' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='vertexCallBack' mangled-name='_ZN20OpenGLCurveEvaluator14vertexCallBackEPKfPv' filepath='libnurbs/interface/glcurveval.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='normalCallBack' mangled-name='_ZN20OpenGLCurveEvaluator14normalCallBackEPKfPv' filepath='libnurbs/interface/glcurveval.cc' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='colorCallBack' mangled-name='_ZN20OpenGLCurveEvaluator13colorCallBackEPKfPv' filepath='libnurbs/interface/glcurveval.cc' line='387' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='texcoordCallBack' mangled-name='_ZN20OpenGLCurveEvaluator16texcoordCallBackEPKfPv' filepath='libnurbs/interface/glcurveval.cc' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='evalpoint1i' mangled-name='_ZN20OpenGLCurveEvaluator11evalpoint1iEl' filepath='libnurbs/interface/glcurveval.cc' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_callback_userData' mangled-name='_ZN20OpenGLCurveEvaluator21set_callback_userDataEPv' filepath='libnurbs/interface/glcurveval.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='put_vertices_call_back' mangled-name='_ZN20OpenGLCurveEvaluator22put_vertices_call_backEi' filepath='libnurbs/interface/glcurveval.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inPreEvaluate' mangled-name='_ZN20OpenGLCurveEvaluator13inPreEvaluateEifPf' filepath='libnurbs/interface/incurveeval.cc' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inMap1f' mangled-name='_ZN20OpenGLCurveEvaluator7inMap1fEiiffiiPf' filepath='libnurbs/interface/incurveeval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inDoDomain1' mangled-name='_ZN20OpenGLCurveEvaluator11inDoDomain1EP16curveEvalMachinefPf' filepath='libnurbs/interface/incurveeval.cc' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='8278cb23'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inDoEvalCoord1' mangled-name='_ZN20OpenGLCurveEvaluator14inDoEvalCoord1Ef' filepath='libnurbs/interface/incurveeval.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inMapMesh1f' mangled-name='_ZN20OpenGLCurveEvaluator11inMapMesh1fEii' filepath='libnurbs/interface/incurveeval.cc' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <function-decl name='domain1f' mangled-name='_ZN20OpenGLCurveEvaluator8domain1fEff' filepath='libnurbs/interface/glcurveval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <function-decl name='range1f' mangled-name='_ZN20OpenGLCurveEvaluator7range1fElPfS0_' filepath='libnurbs/interface/glcurveval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN20OpenGLCurveEvaluator6enableEl' filepath='libnurbs/interface/glcurveval.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN20OpenGLCurveEvaluator7disableEl' filepath='libnurbs/interface/glcurveval.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <function-decl name='bgnmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8bgnmap1fEl' filepath='libnurbs/interface/glcurveval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <function-decl name='map1f' mangled-name='_ZN20OpenGLCurveEvaluator5map1fElffllPf' filepath='libnurbs/interface/glcurveval.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <function-decl name='mapgrid1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapgrid1fElff' filepath='libnurbs/interface/glcurveval.cc' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <function-decl name='mapmesh1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapmesh1fElll' filepath='libnurbs/interface/glcurveval.cc' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <function-decl name='evalcoord1f' mangled-name='_ZN20OpenGLCurveEvaluator11evalcoord1fElf' filepath='libnurbs/interface/glcurveval.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <function-decl name='endmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8endmap1fEv' filepath='libnurbs/interface/glcurveval.cc' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <function-decl name='bgnline' mangled-name='_ZN20OpenGLCurveEvaluator7bgnlineEv' filepath='libnurbs/interface/glcurveval.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <function-decl name='endline' mangled-name='_ZN20OpenGLCurveEvaluator7endlineEv' filepath='libnurbs/interface/glcurveval.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='83a254c0' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='BasicCurveEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/internals/basiccrveval.h' line='43' column='1' is-declaration-only='yes' id='22b18ed5'>
      <base-class access='public' layout-offset-in-bits='0' type-id='98511c0f'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~BasicCurveEvaluator' filepath='libnurbs/internals/basiccrveval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='domain1f' mangled-name='_ZN19BasicCurveEvaluator8domain1fEff' filepath='libnurbs/internals/basiccrveval.cc' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='range1f' mangled-name='_ZN19BasicCurveEvaluator7range1fElPfS0_' filepath='libnurbs/internals/basiccrveval.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN19BasicCurveEvaluator6enableEl' filepath='libnurbs/internals/basiccrveval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN19BasicCurveEvaluator7disableEl' filepath='libnurbs/internals/basiccrveval.cc' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='bgnmap1f' mangled-name='_ZN19BasicCurveEvaluator8bgnmap1fEl' filepath='libnurbs/internals/basiccrveval.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='map1f' mangled-name='_ZN19BasicCurveEvaluator5map1fElffllPf' filepath='libnurbs/internals/basiccrveval.cc' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='mapgrid1f' mangled-name='_ZN19BasicCurveEvaluator9mapgrid1fElff' filepath='libnurbs/internals/basiccrveval.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='mapmesh1f' mangled-name='_ZN19BasicCurveEvaluator9mapmesh1fElll' filepath='libnurbs/internals/basiccrveval.cc' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='evalcoord1f' mangled-name='_ZN19BasicCurveEvaluator11evalcoord1fElf' filepath='libnurbs/internals/basiccrveval.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='endmap1f' mangled-name='_ZN19BasicCurveEvaluator8endmap1fEv' filepath='libnurbs/internals/basiccrveval.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='bgnline' mangled-name='_ZN19BasicCurveEvaluator7bgnlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='endline' mangled-name='_ZN19BasicCurveEvaluator7endlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='11a0d165' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <function-type size-in-bits='64' id='6485bd28'>
      <parameter type-id='d476845b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f267cc92'>
      <parameter type-id='d476845b'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glinterface.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='GLUnurbs' size-in-bits='1149440' is-struct='yes' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='49' column='1' id='e83497bd'>
      <base-class access='public' layout-offset-in-bits='0' type-id='5c7cffcb'/>
      <data-member access='public' layout-offset-in-bits='47616'>
        <var-decl name='errorCallback' type-id='c68de275' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='71' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47680'>
        <var-decl name='autoloadmode' type-id='e482d915' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47744'>
        <var-decl name='surfaceEvaluator' type-id='98206f26' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1121792'>
        <var-decl name='curveEvaluator' type-id='8d4b0ae2' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1149376'>
        <var-decl name='callbackFlag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='143' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='setNurbsCallbackData' mangled-name='_ZN8GLUnurbs20setNurbsCallbackDataEPv' filepath='libnurbs/interface/glrenderer.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='putSurfCallBack' mangled-name='_ZN8GLUnurbs15putSurfCallBackEjPFvvE' filepath='libnurbs/interface/glrenderer.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='055aa60e'/>
          <parameter type-id='9fac4a53'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='postError' mangled-name='_ZN8GLUnurbs9postErrorEi' filepath='libnurbs/interface/glrenderer.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getautoloadmode' mangled-name='_ZN8GLUnurbs15getautoloadmodeEv' filepath='libnurbs/interface/glrenderer.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='e482d915'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='is_callback' mangled-name='_ZN8GLUnurbs11is_callbackEv' filepath='libnurbs/interface/glrenderer.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='setautoloadmode' mangled-name='_ZN8GLUnurbs15setautoloadmodeEf' filepath='libnurbs/interface/glrenderer.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='a6c45d85'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='put_callbackFlag' mangled-name='_ZN8GLUnurbs16put_callbackFlagEi' filepath='libnurbs/interface/glrenderer.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='LOD_eval_list' mangled-name='_ZN8GLUnurbs13LOD_eval_listEi' filepath='libnurbs/interface/glrenderer.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='GLUnurbs' filepath='libnurbs/interface/glrenderer.cc' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='transform4d' mangled-name='_ZN8GLUnurbs11transform4dEPfS0_PA4_f' filepath='libnurbs/interface/glrenderer.cc' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5d68ba5a'/>
          <parameter type-id='5d68ba5a'/>
          <parameter type-id='09324958'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='multmatrix4d' mangled-name='_ZN8GLUnurbs12multmatrix4dEPA4_fPA4_KfS4_' filepath='libnurbs/interface/glrenderer.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='09324958'/>
          <parameter type-id='09324958'/>
          <parameter type-id='09324958'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='loadCullingMatrix' mangled-name='_ZN8GLUnurbs17loadCullingMatrixEPA4_f' filepath='libnurbs/interface/glrenderer.cc' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='09324958'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='loadSamplingMatrix' mangled-name='_ZN8GLUnurbs18loadSamplingMatrixEPA4_KfPKi' filepath='libnurbs/interface/glrenderer.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='09324958'/>
          <parameter type-id='6b122b76'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='useGLMatrices' mangled-name='_ZN8GLUnurbs13useGLMatricesEPKfS1_PKi' filepath='libnurbs/interface/glrenderer.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='6b122b76'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='setSamplingMatrixIdentity' mangled-name='_ZN8GLUnurbs25setSamplingMatrixIdentityEv' filepath='libnurbs/interface/glrenderer.cc' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='grabGLMatrix' mangled-name='_ZN8GLUnurbs12grabGLMatrixEPA4_f' filepath='libnurbs/interface/glrenderer.cc' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='09324958'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='loadGLMatrices' mangled-name='_ZN8GLUnurbs14loadGLMatricesEv' filepath='libnurbs/interface/glrenderer.cc' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='bgnrender' mangled-name='_ZN8GLUnurbs9bgnrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='endrender' mangled-name='_ZN8GLUnurbs9endrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='errorHandler' mangled-name='_ZN8GLUnurbs12errorHandlerEi' filepath='libnurbs/interface/glrenderer.cc' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='129fea6d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='e83497bd' size-in-bits='64' id='129fea6d'/>
    <pointer-type-def type-id='98206f26' size-in-bits='64' id='a8b7100c'/>
    <pointer-type-def type-id='a6c45d85' size-in-bits='64' id='361f7a7d'/>
    <function-decl name='gluNewNurbsRenderer' mangled-name='gluNewNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNewNurbsRenderer'>
      <return type-id='129fea6d'/>
    </function-decl>
    <function-decl name='gluDeleteNurbsRenderer' mangled-name='gluDeleteNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluDeleteNurbsRenderer'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluBeginSurface' mangled-name='gluBeginSurface' filepath='libnurbs/interface/glinterface.cc' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginSurface'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluBeginCurve' mangled-name='gluBeginCurve' filepath='libnurbs/interface/glinterface.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginCurve'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluEndCurve' mangled-name='gluEndCurve' filepath='libnurbs/interface/glinterface.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndCurve'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluEndSurface' mangled-name='gluEndSurface' filepath='libnurbs/interface/glinterface.cc' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndSurface'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluBeginTrim' mangled-name='gluBeginTrim' filepath='libnurbs/interface/glinterface.cc' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginTrim'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluEndTrim' mangled-name='gluEndTrim' filepath='libnurbs/interface/glinterface.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndTrim'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluPwlCurve' mangled-name='gluPwlCurve' filepath='libnurbs/interface/glinterface.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluPwlCurve'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='82e13008' name='count' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='361f7a7d' name='array' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='82e13008' name='stride' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <parameter type-id='055aa60e' name='type' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsCurve' mangled-name='gluNurbsCurve' filepath='libnurbs/interface/glinterface.cc' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCurve'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='82e13008' name='nknots' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='361f7a7d' name='knot' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='82e13008' name='stride' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='361f7a7d' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <parameter type-id='82e13008' name='order' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <parameter type-id='055aa60e' name='type' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsSurface' mangled-name='gluNurbsSurface' filepath='libnurbs/interface/glinterface.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsSurface'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='82e13008' name='sknot_count' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='5d68ba5a' name='sknot' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='82e13008' name='tknot_count' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <parameter type-id='5d68ba5a' name='tknot' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <parameter type-id='82e13008' name='s_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <parameter type-id='82e13008' name='t_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <parameter type-id='5d68ba5a' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='82e13008' name='sorder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='82e13008' name='torder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='055aa60e' name='type' filepath='libnurbs/interface/glinterface.cc' line='203' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluLoadSamplingMatrices' mangled-name='gluLoadSamplingMatrices' filepath='libnurbs/interface/glinterface.cc' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluLoadSamplingMatrices'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <parameter type-id='d476845b' name='modelMatrix' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <parameter type-id='d476845b' name='projMatrix' filepath='libnurbs/interface/glinterface.cc' line='236' column='1'/>
      <parameter type-id='6b122b76' name='viewport' filepath='libnurbs/interface/glinterface.cc' line='237' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsProperty' mangled-name='gluNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsProperty'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <parameter type-id='055aa60e' name='property' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <parameter type-id='46496ee3' name='value' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluGetNurbsProperty' mangled-name='gluGetNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluGetNurbsProperty'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <parameter type-id='055aa60e' name='property' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <parameter type-id='5d68ba5a' name='value' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsCallback' mangled-name='gluNurbsCallback' filepath='libnurbs/interface/glinterface.cc' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallback'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <parameter type-id='055aa60e' name='which' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <parameter type-id='9fac4a53' name='fn' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsCallbackDataEXT' mangled-name='gluNurbsCallbackDataEXT' filepath='libnurbs/interface/glinterface.cc' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackDataEXT'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <parameter type-id='eaa32e2f' name='userData' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='gluNurbsCallbackData' mangled-name='gluNurbsCallbackData' filepath='libnurbs/interface/glinterface.cc' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackData'>
      <parameter type-id='129fea6d' name='r' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <parameter type-id='eaa32e2f' name='userData' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='OpenGLSurfaceEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='100' column='1' is-declaration-only='yes' id='98206f26'>
      <base-class access='public' layout-offset-in-bits='0' type-id='f37336ad'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='vertexCache' type-id='25b51a5f' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='180' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='tmeshing' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='181' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <var-decl name='which' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='182' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='vcount' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='183' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='gl_polygon_mode' type-id='89ff3d35' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='185' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='global_bpm' type-id='8b4ddf21' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='output_triangles' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='beginCallBackN' type-id='30135957' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='endCallBackN' type-id='953b12f8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='vertexCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='normalCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='colorCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='texcoordCallBackN' type-id='318ea842' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='beginCallBackData' type-id='5f8a287b' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='200' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1024'>
        <var-decl name='endCallBackData' type-id='b7f9d8e6' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='201' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='vertexCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='normalCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <var-decl name='colorCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='204' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <var-decl name='texcoordCallBackData' type-id='5a82918c' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='205' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <var-decl name='userData' type-id='eaa32e2f' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='LOD_eval_level' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1440'>
        <var-decl name='global_uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='231' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='global_vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1504'>
        <var-decl name='global_uprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='233' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='global_vprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='234' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1568'>
        <var-decl name='global_vprime_BV' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='235' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='global_uprime_BU' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1632'>
        <var-decl name='global_uorder_BV' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='global_vorder_BV' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='238' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1696'>
        <var-decl name='global_uorder_BU' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='239' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <var-decl name='global_vorder_BU' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='240' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1760'>
        <var-decl name='global_ucoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3040'>
        <var-decl name='global_vcoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='243' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4320'>
        <var-decl name='global_ucoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='244' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5600'>
        <var-decl name='global_vcoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6880'>
        <var-decl name='global_BV' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='247' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='12000'>
        <var-decl name='global_PBV' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='248' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='17120'>
        <var-decl name='global_BU' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='249' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='22240'>
        <var-decl name='global_PBU' type-id='f343e529' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='250' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <var-decl name='global_baseData' type-id='c0eda015' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <var-decl name='global_ev_k' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='253' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27488'>
        <var-decl name='global_ev_u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='254' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <var-decl name='global_ev_u2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='255' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27552'>
        <var-decl name='global_ev_ustride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='256' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27584'>
        <var-decl name='global_ev_uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='257' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27616'>
        <var-decl name='global_ev_v1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='258' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27648'>
        <var-decl name='global_ev_v2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='259' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27680'>
        <var-decl name='global_ev_vstride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='260' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27712'>
        <var-decl name='global_ev_vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='261' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27744'>
        <var-decl name='global_ev_ctlPoints' type-id='65bb74af' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='262' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232544'>
        <var-decl name='global_grid_u0' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='264' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232576'>
        <var-decl name='global_grid_u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='265' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232608'>
        <var-decl name='global_grid_nu' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='266' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232640'>
        <var-decl name='global_grid_v0' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='267' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232672'>
        <var-decl name='global_grid_v1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='268' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232704'>
        <var-decl name='global_grid_nv' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='269' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232736'>
        <var-decl name='em_vertex' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='349' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='443008'>
        <var-decl name='em_normal' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='350' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='653280'>
        <var-decl name='em_color' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='351' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='863552'>
        <var-decl name='em_texcoord' type-id='a83411a7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073824'>
        <var-decl name='auto_normal_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='354' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073856'>
        <var-decl name='callback_auto_normal' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='356' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073888'>
        <var-decl name='vertex_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073920'>
        <var-decl name='normal_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073952'>
        <var-decl name='color_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073984'>
        <var-decl name='texcoord_flag' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='360' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='set_callback_userData' mangled-name='_ZN22OpenGLSurfaceEvaluator21set_callback_userDataEPv' filepath='libnurbs/interface/glsurfeval.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='put_vertices_call_back' mangled-name='_ZN22OpenGLSurfaceEvaluator22put_vertices_call_backEi' filepath='libnurbs/interface/glsurfeval.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='putCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator11putCallBackEjPFvvE' filepath='libnurbs/interface/glsurfeval.cc' line='1190' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='055aa60e'/>
          <parameter type-id='9fac4a53'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='beginCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator13beginCallBackEjPv' filepath='libnurbs/interface/glsurfeval.cc' line='1237' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='055aa60e'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='endCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator11endCallBackEPv' filepath='libnurbs/interface/glsurfeval.cc' line='1246' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='vertexCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator14vertexCallBackEPKfPv' filepath='libnurbs/interface/glsurfeval.cc' line='1255' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='normalCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator14normalCallBackEPKfPv' filepath='libnurbs/interface/glsurfeval.cc' line='1265' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='colorCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator13colorCallBackEPKfPv' filepath='libnurbs/interface/glsurfeval.cc' line='1274' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='texcoordCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator16texcoordCallBackEPKfPv' filepath='libnurbs/interface/glsurfeval.cc' line='1283' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='d476845b'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='coord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7coord2fEff' filepath='libnurbs/interface/glsurfeval.cc' line='1106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='point2i' mangled-name='_ZN22OpenGLSurfaceEvaluator7point2iEll' filepath='libnurbs/interface/glsurfeval.cc' line='1069' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='newtmeshvert' mangled-name='_ZN22OpenGLSurfaceEvaluator12newtmeshvertEff' filepath='libnurbs/interface/glsurfeval.cc' line='1160' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='newtmeshvert' mangled-name='_ZN22OpenGLSurfaceEvaluator12newtmeshvertEll' filepath='libnurbs/interface/glsurfeval.cc' line='1134' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='LOD_eval_list' mangled-name='_ZN22OpenGLSurfaceEvaluator13LOD_eval_listEi' filepath='libnurbs/interface/glsurfeval.cc' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inMapGrid2f' mangled-name='_ZN22OpenGLSurfaceEvaluator11inMapGrid2fEiffiff' filepath='libnurbs/interface/insurfeval.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inComputeFirstPartials' mangled-name='_ZN22OpenGLSurfaceEvaluator22inComputeFirstPartialsEPfS0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='501' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inPreEvaluate' mangled-name='_ZN22OpenGLSurfaceEvaluator13inPreEvaluateEifPf' filepath='libnurbs/interface/insurfeval.cc' line='1022' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inPreEvaluateWithDeriv' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateWithDerivEifPfS0_' filepath='libnurbs/interface/insurfeval.cc' line='1066' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inDoDomain2WithDerivs' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoDomain2WithDerivsEiffffiffiPfS0_S0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='949' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inDoDomain2WithDerivsBV' mangled-name='_ZN22OpenGLSurfaceEvaluator23inDoDomain2WithDerivsBVEiffffiffiPfS0_S0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='903' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inDoDomain2WithDerivsBU' mangled-name='_ZN22OpenGLSurfaceEvaluator23inDoDomain2WithDerivsBUEiffffiffiPfS0_S0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='868' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inPreEvaluateBU' mangled-name='_ZN22OpenGLSurfaceEvaluator15inPreEvaluateBUEiiifPf' filepath='libnurbs/interface/insurfeval.cc' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inPreEvaluateBV' mangled-name='_ZN22OpenGLSurfaceEvaluator15inPreEvaluateBVEiiifPf' filepath='libnurbs/interface/insurfeval.cc' line='809' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inEvalULine' mangled-name='_ZN22OpenGLSurfaceEvaluator11inEvalULineEifPfiPA3_fS2_' filepath='libnurbs/interface/insurfeval.cc' line='1125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='166c4ea0'/>
          <parameter type-id='166c4ea0'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inEvalVLine' mangled-name='_ZN22OpenGLSurfaceEvaluator11inEvalVLineEifPfiPA3_fS2_' filepath='libnurbs/interface/insurfeval.cc' line='1144' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='166c4ea0'/>
          <parameter type-id='166c4ea0'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inMap2fEM' mangled-name='_ZN22OpenGLSurfaceEvaluator9inMap2fEMEiiffiiffiiPf' filepath='libnurbs/interface/insurfeval.cc' line='1540' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inDoDomain2WithDerivsEM' mangled-name='_ZN22OpenGLSurfaceEvaluator23inDoDomain2WithDerivsEMEP15surfEvalMachineffPfS2_S2_' filepath='libnurbs/interface/insurfeval.cc' line='1600' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='6a947bf6'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inDoDomain2EM' mangled-name='_ZN22OpenGLSurfaceEvaluator13inDoDomain2EMEP15surfEvalMachineffPf' filepath='libnurbs/interface/insurfeval.cc' line='1653' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='6a947bf6'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inEvalVStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator12inEvalVStripEifPfifS0_' filepath='libnurbs/interface/insurfeval.cc' line='1355' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inEvalUStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator12inEvalUStripEifPfifS0_' filepath='libnurbs/interface/insurfeval.cc' line='1166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inComputeNormal2' mangled-name='_ZN22OpenGLSurfaceEvaluator16inComputeNormal2EPfS0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inDoEvalCoord2EM' mangled-name='_ZN22OpenGLSurfaceEvaluator16inDoEvalCoord2EMEff' filepath='libnurbs/interface/insurfeval.cc' line='1702' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inBPMEvalEM' mangled-name='_ZN22OpenGLSurfaceEvaluator11inBPMEvalEMEP15bezierPatchMesh' filepath='libnurbs/interface/insurfeval.cc' line='1826' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='8b4ddf21'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inBPMListEvalEM' mangled-name='_ZN22OpenGLSurfaceEvaluator15inBPMListEvalEMEP15bezierPatchMesh' filepath='libnurbs/interface/insurfeval.cc' line='2056' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='8b4ddf21'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inDoEvalCoord2' mangled-name='_ZN22OpenGLSurfaceEvaluator14inDoEvalCoord2EffPfS0_' filepath='libnurbs/interface/insurfeval.cc' line='541' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inEvalMesh2' mangled-name='_ZN22OpenGLSurfaceEvaluator11inEvalMesh2Eiiii' filepath='libnurbs/interface/insurfeval.cc' line='400' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inEvalCoord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator13inEvalCoord2fEff' filepath='libnurbs/interface/insurfeval.cc' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inEvalPoint2' mangled-name='_ZN22OpenGLSurfaceEvaluator12inEvalPoint2Eii' filepath='libnurbs/interface/insurfeval.cc' line='362' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inMap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7inMap2fEiffiiffiiPf' filepath='libnurbs/interface/insurfeval.cc' line='444' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inBPMEval' mangled-name='_ZN22OpenGLSurfaceEvaluator9inBPMEvalEP15bezierPatchMesh' filepath='libnurbs/interface/insurfeval.cc' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='8b4ddf21'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='inBPMListEval' mangled-name='_ZN22OpenGLSurfaceEvaluator13inBPMListEvalEP15bezierPatchMesh' filepath='libnurbs/interface/insurfeval.cc' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='8b4ddf21'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='range2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/interface/glsurfeval.cc' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='domain2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8domain2fEffff' filepath='libnurbs/interface/glsurfeval.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN22OpenGLSurfaceEvaluator6enableEl' filepath='libnurbs/interface/glsurfeval.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN22OpenGLSurfaceEvaluator7disableEl' filepath='libnurbs/interface/glsurfeval.cc' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='bgnmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/interface/glsurfeval.cc' line='739' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='map2f' mangled-name='_ZN22OpenGLSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/interface/glsurfeval.cc' line='872' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='mapgrid2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/interface/glsurfeval.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='mapmesh2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/interface/glsurfeval.cc' line='946' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='evalcoord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/interface/glsurfeval.cc' line='1042' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='evalpoint2i' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/interface/glsurfeval.cc' line='1059' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='endmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8endmap2fEv' filepath='libnurbs/interface/glsurfeval.cc' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='polymode' mangled-name='_ZN22OpenGLSurfaceEvaluator8polymodeEl' filepath='libnurbs/interface/glsurfeval.cc' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='bgnline' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgnlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='endline' mangled-name='_ZN22OpenGLSurfaceEvaluator7endlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='bgnclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='endclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='bgntmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='swaptmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='endtmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8endtmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='bgnqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='712' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='endqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9endqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='725' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='bgntfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgntfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='endtfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7endtfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='evalUStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='evalVStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='530' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN22OpenGLSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='321' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a8b7100c' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glrenderer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='46496ee3' size-in-bits='128' id='d68dc862'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <typedef-decl name='errorCallbackType' type-id='30135957' filepath='libnurbs/interface/glrenderer.h' line='46' column='1' id='c68de275'/>
    <pointer-type-def type-id='d68dc862' size-in-bits='64' id='09324958'/>
    <class-decl name='NurbsTessellator' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='53' column='1' is-declaration-only='yes' id='5c7cffcb'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='renderhints' type-id='14066291' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='104' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='maplist' type-id='90b97905' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='105' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3008'>
        <var-decl name='backend' type-id='8abb1ec7' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3648'>
        <var-decl name='subdivider' type-id='62291dde' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24064'>
        <var-decl name='jumpbuffer' type-id='0e86d3eb' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24128'>
        <var-decl name='o_pwlcurvePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <var-decl name='o_nurbscurvePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='29120'>
        <var-decl name='o_curvePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='31616'>
        <var-decl name='o_trimPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='34112'>
        <var-decl name='o_surfacePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='36608'>
        <var-decl name='o_nurbssurfacePool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='39104'>
        <var-decl name='propertyPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='41600'>
        <var-decl name='quiltPool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='44096'>
        <var-decl name='extTrimVertexPool' type-id='95c1e8c1' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46720'>
        <var-decl name='inSurface' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='148' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46752'>
        <var-decl name='inCurve' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='149' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46784'>
        <var-decl name='inTrim' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46816'>
        <var-decl name='isCurveModified' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='151' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46848'>
        <var-decl name='isTrimModified' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='152' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46880'>
        <var-decl name='isSurfaceModified' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46912'>
        <var-decl name='isDataValid' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46944'>
        <var-decl name='numTrims' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='155' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46976'>
        <var-decl name='playBack' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='156' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47040'>
        <var-decl name='nextTrim' type-id='9b0953ab' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='158' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47104'>
        <var-decl name='nextCurve' type-id='051d3536' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47168'>
        <var-decl name='nextNurbscurve' type-id='8cd6e64e' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47232'>
        <var-decl name='nextPwlcurve' type-id='5877a025' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='161' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47296'>
        <var-decl name='nextNurbssurface' type-id='6597deda' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47360'>
        <var-decl name='currentSurface' type-id='1d8fd45c' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='164' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47424'>
        <var-decl name='currentTrim' type-id='bc1314a3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='165' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47488'>
        <var-decl name='currentCurve' type-id='75b98f98' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='166' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47552'>
        <var-decl name='dl' type-id='7f27e761' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='168' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='15a0d7b1'/>
          <parameter type-id='e2ef5a99'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='playRecording' mangled-name='_ZN16NurbsTessellator13playRecordingEPv' filepath='libnurbs/internals/nurbsinterfac.cc' line='529' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='endRecording' mangled-name='_ZN16NurbsTessellator12endRecordingEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='522' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='beginRecording' mangled-name='_ZN16NurbsTessellator14beginRecordingEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='515' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='eaa32e2f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='discardRecording' mangled-name='_ZN16NurbsTessellator16discardRecordingEPv' filepath='libnurbs/internals/nurbsinterfac.cc' line='509' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='defineMap' mangled-name='_ZN16NurbsTessellator9defineMapElll' filepath='libnurbs/internals/nurbsinterfac.cc' line='503' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='redefineMaps' mangled-name='_ZN16NurbsTessellator12redefineMapsEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='497' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setnurbsproperty' mangled-name='_ZN16NurbsTessellator16setnurbspropertyEllPfll' filepath='libnurbs/internals/nurbsinterfac.cc' line='474' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setnurbsproperty' mangled-name='_ZN16NurbsTessellator16setnurbspropertyEllPf' filepath='libnurbs/internals/nurbsinterfac.cc' line='451' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='getnurbsproperty' mangled-name='_ZN16NurbsTessellator16getnurbspropertyEllPf' filepath='libnurbs/internals/nurbsinterfac.cc' line='431' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='getnurbsproperty' mangled-name='_ZN16NurbsTessellator16getnurbspropertyElPf' filepath='libnurbs/internals/nurbsinterfac.cc' line='415' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='endtrim' mangled-name='_ZN16NurbsTessellator7endtrimEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='endsurface' mangled-name='_ZN16NurbsTessellator10endsurfaceEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='endcurve' mangled-name='_ZN16NurbsTessellator8endcurveEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='bgnsurface' mangled-name='_ZN16NurbsTessellator10bgnsurfaceEl' filepath='libnurbs/internals/nurbsinterfac.cc' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='bgntrim' mangled-name='_ZN16NurbsTessellator7bgntrimEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='bgncurve' mangled-name='_ZN16NurbsTessellator8bgncurveEl' filepath='libnurbs/internals/nurbsinterfac.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setnurbsproperty' mangled-name='_ZN16NurbsTessellator16setnurbspropertyElf' filepath='libnurbs/internals/nurbsinterfac.cc' line='373' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='a6c45d85'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='pwlcurve' mangled-name='_ZN16NurbsTessellator8pwlcurveElPfll' filepath='libnurbs/internals/nurbsinterfac.cc' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setnurbsproperty' mangled-name='_ZN16NurbsTessellator16setnurbspropertyEllf' filepath='libnurbs/internals/nurbsinterfac.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='a6c45d85'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nurbscurve' mangled-name='_ZN16NurbsTessellator10nurbscurveElPflS0_ll' filepath='libnurbs/internals/nurbsinterfac.cc' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nurbssurface' mangled-name='_ZN16NurbsTessellator12nurbssurfaceElPflS0_llS0_lll' filepath='libnurbs/internals/nurbsinterfac.cc' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_freenurbsproperty' mangled-name='_ZN16NurbsTessellator20do_freenurbspropertyEP8Property' filepath='libnurbs/internals/nurbstess.cc' line='636' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='0d7c2c66'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_freepwlcurve' mangled-name='_ZN16NurbsTessellator15do_freepwlcurveEP10O_pwlcurve' filepath='libnurbs/internals/nurbstess.cc' line='450' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='9683ca4d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_freebgncurve' mangled-name='_ZN16NurbsTessellator15do_freebgncurveEP7O_curve' filepath='libnurbs/internals/nurbstess.cc' line='456' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='75b98f98'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_freebgntrim' mangled-name='_ZN16NurbsTessellator14do_freebgntrimEP6O_trim' filepath='libnurbs/internals/nurbstess.cc' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bc1314a3'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_freebgnsurface' mangled-name='_ZN16NurbsTessellator17do_freebgnsurfaceEP9O_surface' filepath='libnurbs/internals/nurbstess.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='1d8fd45c'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='resetObjects' mangled-name='_ZN16NurbsTessellator12resetObjectsEv' filepath='libnurbs/internals/nurbstess.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_domain_distance_u_rate' mangled-name='_ZN16NurbsTessellator26set_domain_distance_u_rateEf' filepath='libnurbs/internals/nurbstess.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_domain_distance_v_rate' mangled-name='_ZN16NurbsTessellator26set_domain_distance_v_rateEf' filepath='libnurbs/internals/nurbstess.cc' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_is_domain_distance_sampling' mangled-name='_ZN16NurbsTessellator31set_is_domain_distance_samplingEi' filepath='libnurbs/internals/nurbstess.cc' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_nurbserror' mangled-name='_ZN16NurbsTessellator13do_nurbserrorEi' filepath='libnurbs/internals/nurbstess.cc' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_endtrim' mangled-name='_ZN16NurbsTessellator10do_endtrimEv' filepath='libnurbs/internals/nurbstess.cc' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_check_knots' mangled-name='_ZN16NurbsTessellator14do_check_knotsEP10KnotvectorPKc' filepath='libnurbs/internals/nurbstess.cc' line='678' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='e61af16a'/>
          <parameter type-id='80f4b756'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_setnurbsproperty2' mangled-name='_ZN16NurbsTessellator20do_setnurbsproperty2EP8Property' filepath='libnurbs/internals/nurbstess.cc' line='657' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='0d7c2c66'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_setnurbsproperty' mangled-name='_ZN16NurbsTessellator19do_setnurbspropertyEP8Property' filepath='libnurbs/internals/nurbstess.cc' line='649' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='0d7c2c66'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_nurbssurface' mangled-name='_ZN16NurbsTessellator15do_nurbssurfaceEP14O_nurbssurface' filepath='libnurbs/internals/nurbstess.cc' line='598' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='c8fdd5d4'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_bgnsurface' mangled-name='_ZN16NurbsTessellator13do_bgnsurfaceEP9O_surface' filepath='libnurbs/internals/nurbstess.cc' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='1d8fd45c'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_freenurbssurface' mangled-name='_ZN16NurbsTessellator19do_freenurbssurfaceEP14O_nurbssurface' filepath='libnurbs/internals/nurbstess.cc' line='585' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='c8fdd5d4'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_freenurbscurve' mangled-name='_ZN16NurbsTessellator17do_freenurbscurveEP12O_nurbscurve' filepath='libnurbs/internals/nurbstess.cc' line='520' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='d8d22910'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_freecurveall' mangled-name='_ZN16NurbsTessellator15do_freecurveallEP7O_curve' filepath='libnurbs/internals/nurbstess.cc' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='75b98f98'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_freeall' mangled-name='_ZN16NurbsTessellator10do_freeallEv' filepath='libnurbs/internals/nurbstess.cc' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_nurbscurve' mangled-name='_ZN16NurbsTessellator13do_nurbscurveEP12O_nurbscurve' filepath='libnurbs/internals/nurbstess.cc' line='534' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='d8d22910'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_pwlcurve' mangled-name='_ZN16NurbsTessellator11do_pwlcurveEP10O_pwlcurve' filepath='libnurbs/internals/nurbstess.cc' line='468' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='9683ca4d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_bgncurve' mangled-name='_ZN16NurbsTessellator11do_bgncurveEP7O_curve' filepath='libnurbs/internals/nurbstess.cc' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='75b98f98'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_bgntrim' mangled-name='_ZN16NurbsTessellator10do_bgntrimEP6O_trim' filepath='libnurbs/internals/nurbstess.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='bc1314a3'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_endsurface' mangled-name='_ZN16NurbsTessellator13do_endsurfaceEv' filepath='libnurbs/internals/nurbstess.cc' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='do_endcurve' mangled-name='_ZN16NurbsTessellator11do_endcurveEv' filepath='libnurbs/internals/nurbstess.cc' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='bgnrender' mangled-name='_ZN16NurbsTessellator9bgnrenderEv' filepath='libnurbs/internals/nurbstess.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='endrender' mangled-name='_ZN16NurbsTessellator9endrenderEv' filepath='libnurbs/internals/nurbstess.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='makeobj' mangled-name='_ZN16NurbsTessellator7makeobjEi' filepath='libnurbs/internals/nurbstess.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='closeobj' mangled-name='_ZN16NurbsTessellator8closeobjEv' filepath='libnurbs/internals/nurbstess.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <function-decl name='errorHandler' mangled-name='_ZN16NurbsTessellator12errorHandlerEi' filepath='libnurbs/internals/nurbstess.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5139c56b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glsurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='82e13008' size-in-bits='64' id='89ff3d35'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='64' id='5df3d5e7'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='96' id='61f61aca'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='234bc418' size-in-bits='5120' id='f343e529'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='204800' id='65bb74af'>
      <subrange length='6400' type-id='7359adad' id='9685bc87'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='861154a2' size-in-bits='192' id='25b51a5f'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='128' id='6136feaa'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <class-decl name='bezierPatch' size-in-bits='384' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='36' column='1' id='d9a4bc34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='umin' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vmin' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='umax' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vmax' type-id='a6c45d85' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dimension' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctlpoints' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bezierPatch' type-id='d9a4bc34' filepath='libnurbs/interface/bezierPatch.h' line='65' column='1' id='56988107'/>
    <class-decl name='bezierPatchMesh' size-in-bits='960' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='39' column='1' id='2b73b139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bpatch' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bpatch_normal' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bpatch_texcoord' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bpatch_color' type-id='4dcc1bd2' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='UVarray' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='length_array' type-id='7292109c' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type_array' type-id='157c88ff' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='size_UVarray' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='index_UVarray' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size_length_array' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='index_length_array' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='counter' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='type' type-id='055aa60e' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='vertex_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='normal_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='color_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='texcoord_array' type-id='361f7a7d' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='next' type-id='8b4ddf21' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bezierPatchMesh' type-id='2b73b139' filepath='libnurbs/interface/bezierPatchMesh.h' line='66' column='1' id='bc89f3ba'/>
    <class-decl name='surfEvalMachine' size-in-bits='210272' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='63' column='1' id='30d622a0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vprime' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='u2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ustride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='v1' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v2' type-id='234bc418' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='vstride' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vorder' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ctlPoints' type-id='65bb74af' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='205152'>
        <var-decl name='ucoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='206432'>
        <var-decl name='vcoeff' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='207712'>
        <var-decl name='ucoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208992'>
        <var-decl name='vcoeffDeriv' type-id='2ce43ee1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='surfEvalMachine' type-id='30d622a0' filepath='libnurbs/interface/glsurfeval.h' line='80' column='1' id='a83411a7'/>
    <class-decl name='StoredVertex' size-in-bits='256' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='84' column='1' id='5c601ee4'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='95e97e5e' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='coord' type-id='5df3d5e7' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='96' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='point' type-id='6136feaa' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='97' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='861154a2' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='861154a2' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='saveEvalCoord' mangled-name='_ZN12StoredVertex13saveEvalCoordEff' filepath='libnurbs/interface/glsurfeval.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='861154a2' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='saveEvalPoint' mangled-name='_ZN12StoredVertex13saveEvalPointEll' filepath='libnurbs/interface/glsurfeval.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='861154a2' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='invoke' mangled-name='_ZN12StoredVertex6invokeEP22OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='861154a2' is-artificial='yes'/>
          <parameter type-id='a8b7100c'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='f37336ad' size-in-bits='64' id='eeef6d7d'/>
    <pointer-type-def type-id='055aa60e' size-in-bits='64' id='157c88ff'/>
    <pointer-type-def type-id='61f61aca' size-in-bits='64' id='166c4ea0'/>
    <pointer-type-def type-id='5c601ee4' size-in-bits='64' id='861154a2'/>
    <pointer-type-def type-id='c260421a' size-in-bits='64' id='643ec8f8'/>
    <pointer-type-def type-id='d9a4bc34' size-in-bits='64' id='4dcc1bd2'/>
    <pointer-type-def type-id='2b73b139' size-in-bits='64' id='8b4ddf21'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='a83411a7' size-in-bits='64' id='6a947bf6'/>
    <class-decl name='SurfaceMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='c260421a'/>
    <class-decl name='BasicSurfaceEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/internals/basicsurfeval.h' line='43' column='1' is-declaration-only='yes' id='f37336ad'>
      <base-class access='public' layout-offset-in-bits='0' type-id='98511c0f'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~BasicSurfaceEvaluator' filepath='libnurbs/internals/basicsurfeval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='range2f' mangled-name='_ZN21BasicSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/internals/basicsurfeval.cc' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='domain2f' mangled-name='_ZN21BasicSurfaceEvaluator8domain2fEffff' filepath='libnurbs/internals/basicsurfeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN21BasicSurfaceEvaluator6enableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN21BasicSurfaceEvaluator7disableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='bgnmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/internals/basicsurfeval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='map2f' mangled-name='_ZN21BasicSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/internals/basicsurfeval.cc' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='mapgrid2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/internals/basicsurfeval.cc' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='mapmesh2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/internals/basicsurfeval.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='evalcoord2f' mangled-name='_ZN21BasicSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/internals/basicsurfeval.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='evalpoint2i' mangled-name='_ZN21BasicSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/internals/basicsurfeval.cc' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='endmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8endmap2fEv' filepath='libnurbs/internals/basicsurfeval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='polymode' mangled-name='_ZN21BasicSurfaceEvaluator8polymodeEl' filepath='libnurbs/internals/basicsurfeval.cc' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='bgnline' mangled-name='_ZN21BasicSurfaceEvaluator7bgnlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='endline' mangled-name='_ZN21BasicSurfaceEvaluator7endlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='bgnclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='endclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='bgntmesh' mangled-name='_ZN21BasicSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='swaptmesh' mangled-name='_ZN21BasicSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='endtmesh' mangled-name='_ZN21BasicSurfaceEvaluator8endtmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='bgnqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='endqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9endqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='bgntfan' mangled-name='_ZN21BasicSurfaceEvaluator7bgntfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='endtfan' mangled-name='_ZN21BasicSurfaceEvaluator7endtfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='evalUStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='evalVStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='34'>
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN21BasicSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='35'>
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='36'>
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='37'>
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='38'>
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eeef6d7d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/insurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='2048' id='2e646d82'>
      <subrange length='32' type-id='7359adad' id='ae5bde82'/>
    </array-type-def>
    <typedef-decl name='size_t' type-id='7359adad' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='b59d7dce'/>
    <typedef-decl name='Arc_ptr' type-id='70a74e83' filepath='libnurbs/internals/arc.h' line='50' column='1' id='c118b035'/>
    <enum-decl name='arc_side' filepath='libnurbs/internals/arc.h' line='52' column='1' id='45273cc6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='arc_none' value='0'/>
      <enumerator name='arc_right' value='1'/>
      <enumerator name='arc_top' value='2'/>
      <enumerator name='arc_left' value='3'/>
      <enumerator name='arc_bottom' value='4'/>
    </enum-decl>
    <class-decl name='Arc' size-in-bits='448' is-struct='yes' visibility='default' filepath='libnurbs/internals/arc.h' line='55' column='1' id='e4a01a13'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' static='yes'>
        <var-decl name='bezier_tag' type-id='2448a865' mangled-name='_ZN3Arc10bezier_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='arc_tag' type-id='2448a865' mangled-name='_ZN3Arc7arc_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='tail_tag' type-id='2448a865' mangled-name='_ZN3Arc8tail_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='c118b035' visibility='default' filepath='libnurbs/internals/arc.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='c118b035' visibility='default' filepath='libnurbs/internals/arc.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='link' type-id='c118b035' visibility='default' filepath='libnurbs/internals/arc.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bezierArc' type-id='26518268' visibility='default' filepath='libnurbs/internals/arc.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pwlArc' type-id='561d7e7a' visibility='default' filepath='libnurbs/internals/arc.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/arc.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nuid' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/arc.h' line='67' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <parameter type-id='70a74e83'/>
          <parameter type-id='561d7e7a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <parameter type-id='45273cc6'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clearside' mangled-name='_ZN3Arc9clearsideEv' filepath='libnurbs/internals/arc.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clearbezier' mangled-name='_ZN3Arc11clearbezierEv' filepath='libnurbs/internals/arc.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='setside' mangled-name='_ZN3Arc7setsideE8arc_side' filepath='libnurbs/internals/arc.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <parameter type-id='45273cc6'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='tail' mangled-name='_ZN3Arc4tailEv' filepath='libnurbs/internals/arc.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='c0eda015'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='rhead' mangled-name='_ZN3Arc5rheadEv' filepath='libnurbs/internals/arc.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='c0eda015'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='show' mangled-name='_ZN3Arc4showEv' filepath='libnurbs/internals/arc.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='isbezier' mangled-name='_ZN3Arc8isbezierEv' filepath='libnurbs/internals/arc.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='bd54fe1a'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='makeSide' mangled-name='_ZN3Arc8makeSideEP6PwlArc8arc_side' filepath='libnurbs/internals/arc.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <parameter type-id='561d7e7a'/>
          <parameter type-id='45273cc6'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='numpts' mangled-name='_ZN3Arc6numptsEv' filepath='libnurbs/internals/arc.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='markverts' mangled-name='_ZN3Arc9markvertsEv' filepath='libnurbs/internals/arc.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getextrema' mangled-name='_ZN3Arc10getextremaEPPS_' filepath='libnurbs/internals/arc.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <parameter type-id='7d392e34'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='print' mangled-name='_ZN3Arc5printEv' filepath='libnurbs/internals/arc.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='isDisconnected' mangled-name='_ZN3Arc14isDisconnectedEv' filepath='libnurbs/internals/arc.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='check' mangled-name='_ZN3Arc5checkEv' filepath='libnurbs/internals/arc.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='append' mangled-name='_ZN3Arc6appendEPS_' filepath='libnurbs/internals/arc.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <return type-id='c118b035'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getitail' mangled-name='_ZN3Arc8getitailEv' filepath='libnurbs/internals/arc.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='head' mangled-name='_ZN3Arc4headEv' filepath='libnurbs/internals/arc.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='c0eda015'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='setbezier' mangled-name='_ZN3Arc9setbezierEv' filepath='libnurbs/internals/arc.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='setmark' mangled-name='_ZN3Arc7setmarkEv' filepath='libnurbs/internals/arc.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ismarked' mangled-name='_ZN3Arc8ismarkedEv' filepath='libnurbs/internals/arc.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='bd54fe1a'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clearmark' mangled-name='_ZN3Arc9clearmarkEv' filepath='libnurbs/internals/arc.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='setitail' mangled-name='_ZN3Arc8setitailEv' filepath='libnurbs/internals/arc.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clearitail' mangled-name='_ZN3Arc10clearitailEv' filepath='libnurbs/internals/arc.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getside' mangled-name='_ZN3Arc7getsideEv' filepath='libnurbs/internals/arc.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='45273cc6'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='isTessellated' mangled-name='_ZN3Arc13isTessellatedEv' filepath='libnurbs/internals/arc.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='70a74e83' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Buffer' size-in-bits='64' visibility='default' filepath='libnurbs/internals/bufpool.h' line='45' column='1' id='036c0a83'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='2c9a42a3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Pool' size-in-bits='2496' visibility='default' filepath='libnurbs/internals/bufpool.h' line='50' column='1' id='1329513b'>
      <member-type access='protected'>
        <enum-decl name='Magic' filepath='libnurbs/internals/bufpool.h' line='70' column='1' id='ca454859'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='is_allocated' value='62369'/>
          <enumerator name='is_free' value='61858'/>
        </enum-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='freelist' type-id='2c9a42a3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='62' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='blocklist' type-id='2e646d82' visibility='default' filepath='libnurbs/internals/bufpool.h' line='63' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2112'>
        <var-decl name='nextblock' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='64' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2176'>
        <var-decl name='curblock' type-id='26a90f95' visibility='default' filepath='libnurbs/internals/bufpool.h' line='65' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2240'>
        <var-decl name='buffersize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='66' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2272'>
        <var-decl name='nextsize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='67' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2304'>
        <var-decl name='nextfree' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='68' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2336'>
        <var-decl name='initsize' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/bufpool.h' line='69' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2368'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='libnurbs/internals/bufpool.h' line='71' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2432'>
        <var-decl name='magic' type-id='ca454859' visibility='default' filepath='libnurbs/internals/bufpool.h' line='72' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='new_buffer' mangled-name='_ZN4Pool10new_bufferEv' filepath='libnurbs/internals/bufpool.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <return type-id='eaa32e2f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='clear' mangled-name='_ZN4Pool5clearEv' filepath='libnurbs/internals/bufpool.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='grow' mangled-name='_ZN4Pool4growEv' filepath='libnurbs/internals/bufpool.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='free_buffer' mangled-name='_ZN4Pool11free_bufferEPv' filepath='libnurbs/internals/bufpool.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='1aa107ab' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PooledObj' size-in-bits='8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='118' column='1' id='1feb48e7'>
      <member-function access='private' static='yes'>
        <function-decl name='operator delete' mangled-name='_ZN9PooledObjdlEPvR4Pool' filepath='libnurbs/internals/bufpool.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='16a1015f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='operator new' mangled-name='_ZN9PooledObjnwEmR4Pool' filepath='libnurbs/internals/bufpool.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='b59d7dce'/>
          <parameter type-id='16a1015f'/>
          <return type-id='eaa32e2f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deleteMe' mangled-name='_ZN9PooledObj8deleteMeER4Pool' filepath='libnurbs/internals/bufpool.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='298506af' is-artificial='yes'/>
          <parameter type-id='16a1015f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PwlArc' size-in-bits='192' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='44' column='1' id='c60dfbac'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='86e0e963' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='48' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='561d7e7a' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='561d7e7a' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='86e0e963'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='561d7e7a' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='86e0e963'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='TrimVertex' size-in-bits='128' is-struct='yes' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='43' column='1' id='a514a513'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='param' type-id='5df3d5e7' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nuid' type-id='bd54fe1a' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='e4a01a13' size-in-bits='64' id='70a74e83'/>
    <pointer-type-def type-id='c118b035' size-in-bits='64' id='7d392e34'/>
    <pointer-type-def type-id='26d417ca' size-in-bits='64' id='26518268'/>
    <pointer-type-def type-id='036c0a83' size-in-bits='64' id='2c9a42a3'/>
    <reference-type-def kind='lvalue' type-id='1329513b' size-in-bits='64' id='16a1015f'/>
    <pointer-type-def type-id='1329513b' size-in-bits='64' id='1aa107ab'/>
    <pointer-type-def type-id='1feb48e7' size-in-bits='64' id='298506af'/>
    <pointer-type-def type-id='c60dfbac' size-in-bits='64' id='561d7e7a'/>
    <pointer-type-def type-id='a514a513' size-in-bits='64' id='86e0e963'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <class-decl name='BezierArc' is-struct='yes' visibility='default' is-declaration-only='yes' id='26d417ca'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arcsorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='234bc418' size-in-bits='128' id='a201b87d'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='3' type-id='234bc418' size-in-bits='infinite' id='1e6e1d59'>
      <subrange length='infinite' id='031f2035'/>
      <subrange length='24' type-id='7359adad' id='fdd3342b'/>
      <subrange length='24' type-id='7359adad' id='fdd3342b'/>
    </array-type-def>
    <class-decl name='ArcTessellator' size-in-bits='128' visibility='default' filepath='libnurbs/internals/arctess.h' line='47' column='1' id='96a897b1'>
      <data-member access='private' static='yes'>
        <var-decl name='gl_Bernstein' type-id='1e6e1d59' mangled-name='_ZN14ArcTessellator12gl_BernsteinE' visibility='default' filepath='libnurbs/internals/arctess.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pwlarcpool' type-id='16a1015f' visibility='default' filepath='libnurbs/internals/arctess.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='trimvertexpool' type-id='7ba6b98d' visibility='default' filepath='libnurbs/internals/arctess.h' line='62' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='ArcTessellator' filepath='libnurbs/internals/arctess.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='7ba6b98d'/>
          <parameter type-id='16a1015f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ArcTessellator' filepath='libnurbs/internals/arctess.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='trim_power_coeffs' mangled-name='_ZN14ArcTessellator17trim_power_coeffsEP9BezierArcPfi' filepath='libnurbs/internals/arctess.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='26518268'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='pwl_left' mangled-name='_ZN14ArcTessellator8pwl_leftEP3Arcffff' filepath='libnurbs/internals/arctess.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='tessellateNonlinear' mangled-name='_ZN14ArcTessellator19tessellateNonlinearEP3Arcffi' filepath='libnurbs/internals/arctess.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='pwl' mangled-name='_ZN14ArcTessellator3pwlEP3Arcfffff' filepath='libnurbs/internals/arctess.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='bezier' mangled-name='_ZN14ArcTessellator6bezierEP3Arcffff' filepath='libnurbs/internals/arctess.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='pwl_bottom' mangled-name='_ZN14ArcTessellator10pwl_bottomEP3Arcffff' filepath='libnurbs/internals/arctess.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='pwl_top' mangled-name='_ZN14ArcTessellator7pwl_topEP3Arcffff' filepath='libnurbs/internals/arctess.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='pwl_right' mangled-name='_ZN14ArcTessellator9pwl_rightEP3Arcffff' filepath='libnurbs/internals/arctess.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='tessellateLinear' mangled-name='_ZN14ArcTessellator16tessellateLinearEP3Arcffi' filepath='libnurbs/internals/arctess.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='4a9e4f29' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Backend' size-in-bits='640' is-struct='yes' visibility='default' filepath='libnurbs/internals/backend.h' line='46' column='1' id='8abb1ec7'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='curveEvaluator' type-id='15a0d7b1' visibility='default' filepath='libnurbs/internals/backend.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='surfaceEvaluator' type-id='e2ef5a99' visibility='default' filepath='libnurbs/internals/backend.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='wireframetris' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='wireframequads' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='mesh' type-id='2f738f98' visibility='default' filepath='libnurbs/internals/backend.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <var-decl name='meshindex' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/backend.h' line='109' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Backend' filepath='libnurbs/internals/backend.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='15a0d7b1'/>
          <parameter type-id='e2ef5a99'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='bgnsurf' mangled-name='_ZN7Backend7bgnsurfEiil' filepath='libnurbs/internals/backend.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='patch' mangled-name='_ZN7Backend5patchEffff' filepath='libnurbs/internals/backend.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='surfbbox' mangled-name='_ZN7Backend8surfbboxElPfS0_' filepath='libnurbs/internals/backend.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='surfpts' mangled-name='_ZN7Backend7surfptsElPflliiffff' filepath='libnurbs/internals/backend.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='surfgrid' mangled-name='_ZN7Backend8surfgridEfflffl' filepath='libnurbs/internals/backend.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='surfmesh' mangled-name='_ZN7Backend8surfmeshEllll' filepath='libnurbs/internals/backend.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='endsurf' mangled-name='_ZN7Backend7endsurfEv' filepath='libnurbs/internals/backend.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='bgntfan' mangled-name='_ZN7Backend7bgntfanEv' filepath='libnurbs/internals/backend.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='endtfan' mangled-name='_ZN7Backend7endtfanEv' filepath='libnurbs/internals/backend.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='bgnqstrip' mangled-name='_ZN7Backend9bgnqstripEv' filepath='libnurbs/internals/backend.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='endqstrip' mangled-name='_ZN7Backend9endqstripEv' filepath='libnurbs/internals/backend.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='evalUStrip' mangled-name='_ZN7Backend10evalUStripEifPfifS0_' filepath='libnurbs/internals/backend.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='evalVStrip' mangled-name='_ZN7Backend10evalVStripEifPfifS0_' filepath='libnurbs/internals/backend.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='bgntmesh' mangled-name='_ZN7Backend8bgntmeshEPKc' filepath='libnurbs/internals/backend.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='tmeshvertNOGE' mangled-name='_ZN7Backend13tmeshvertNOGEEP10TrimVertex' filepath='libnurbs/internals/backend.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='86e0e963'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='tmeshvertNOGE_BU' mangled-name='_ZN7Backend16tmeshvertNOGE_BUEP10TrimVertex' filepath='libnurbs/internals/backend.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='86e0e963'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='tmeshvertNOGE_BV' mangled-name='_ZN7Backend16tmeshvertNOGE_BVEP10TrimVertex' filepath='libnurbs/internals/backend.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='86e0e963'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='preEvaluateBU' mangled-name='_ZN7Backend13preEvaluateBUEf' filepath='libnurbs/internals/backend.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='preEvaluateBV' mangled-name='_ZN7Backend13preEvaluateBVEf' filepath='libnurbs/internals/backend.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='tmeshvert' mangled-name='_ZN7Backend9tmeshvertEP10TrimVertex' filepath='libnurbs/internals/backend.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='86e0e963'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='tmeshvert' mangled-name='_ZN7Backend9tmeshvertEff' filepath='libnurbs/internals/backend.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='tmeshvert' mangled-name='_ZN7Backend9tmeshvertEP10GridVertex' filepath='libnurbs/internals/backend.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='d96ed0fb'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='tmeshvert' mangled-name='_ZN7Backend9tmeshvertEP14GridTrimVertex' filepath='libnurbs/internals/backend.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='6ae24567'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='swaptmesh' mangled-name='_ZN7Backend9swaptmeshEv' filepath='libnurbs/internals/backend.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='endtmesh' mangled-name='_ZN7Backend8endtmeshEv' filepath='libnurbs/internals/backend.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='bgnoutline' mangled-name='_ZN7Backend10bgnoutlineEv' filepath='libnurbs/internals/backend.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='linevert' mangled-name='_ZN7Backend8linevertEP10TrimVertex' filepath='libnurbs/internals/backend.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='86e0e963'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='linevert' mangled-name='_ZN7Backend8linevertEP10GridVertex' filepath='libnurbs/internals/backend.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='d96ed0fb'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='endoutline' mangled-name='_ZN7Backend10endoutlineEv' filepath='libnurbs/internals/backend.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='triangle' mangled-name='_ZN7Backend8triangleEP10TrimVertexS1_S1_' filepath='libnurbs/internals/backend.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='86e0e963'/>
          <parameter type-id='86e0e963'/>
          <parameter type-id='86e0e963'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='bgncurv' mangled-name='_ZN7Backend7bgncurvEv' filepath='libnurbs/internals/backend.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='segment' mangled-name='_ZN7Backend7segmentEff' filepath='libnurbs/internals/backend.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='curvpts' mangled-name='_ZN7Backend7curvptsElPfliff' filepath='libnurbs/internals/backend.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='curvgrid' mangled-name='_ZN7Backend8curvgridEffl' filepath='libnurbs/internals/backend.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='curvmesh' mangled-name='_ZN7Backend8curvmeshEll' filepath='libnurbs/internals/backend.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='curvpt' mangled-name='_ZN7Backend6curvptEf' filepath='libnurbs/internals/backend.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='bgnline' mangled-name='_ZN7Backend7bgnlineEv' filepath='libnurbs/internals/backend.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='endline' mangled-name='_ZN7Backend7endlineEv' filepath='libnurbs/internals/backend.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='endcurv' mangled-name='_ZN7Backend7endcurvEv' filepath='libnurbs/internals/backend.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6adb711f' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Bin' size-in-bits='128' visibility='default' filepath='libnurbs/internals/bin.h' line='44' column='1' id='55730736'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='c118b035' visibility='default' filepath='libnurbs/internals/bin.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='current' type-id='c118b035' visibility='default' filepath='libnurbs/internals/bin.h' line='47' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Bin' filepath='libnurbs/internals/bin.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Bin' filepath='libnurbs/internals/bin.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nextarc' mangled-name='_ZN3Bin7nextarcEv' filepath='libnurbs/internals/bin.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='c118b035'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='firstarc' mangled-name='_ZN3Bin8firstarcEv' filepath='libnurbs/internals/bin.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='c118b035'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='markall' mangled-name='_ZN3Bin7markallEv' filepath='libnurbs/internals/bin.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='removearc' mangled-name='_ZN3Bin9removearcEv' filepath='libnurbs/internals/bin.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='c118b035'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_this_arc' mangled-name='_ZN3Bin15remove_this_arcEP3Arc' filepath='libnurbs/internals/bin.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='numarcs' mangled-name='_ZN3Bin7numarcsEv' filepath='libnurbs/internals/bin.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='adopt' mangled-name='_ZN3Bin5adoptEv' filepath='libnurbs/internals/bin.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='show' mangled-name='_ZN3Bin4showEPKc' filepath='libnurbs/internals/bin.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='listBezier' mangled-name='_ZN3Bin10listBezierEv' filepath='libnurbs/internals/bin.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='addarc' mangled-name='_ZN3Bin6addarcEP3Arc' filepath='libnurbs/internals/bin.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='isnonempty' mangled-name='_ZN3Bin10isnonemptyEv' filepath='libnurbs/internals/bin.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6aadba9c' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Curvelist' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/curvelist.h' line='47' column='1' id='5d0beef4'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='curve' type-id='e5fec7ba' visibility='default' filepath='libnurbs/internals/curvelist.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='range' type-id='c723f882' visibility='default' filepath='libnurbs/internals/curvelist.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='needsSubdivision' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/curvelist.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='stepsize' type-id='a6c45d85' visibility='default' filepath='libnurbs/internals/curvelist.h' line='60' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <parameter type-id='ad0c8abc'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Curvelist' filepath='libnurbs/internals/curvelist.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <parameter type-id='d5ebc58e'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Curvelist' filepath='libnurbs/internals/curvelist.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='needsSamplingSubdivision' mangled-name='_ZN9Curvelist24needsSamplingSubdivisionEv' filepath='libnurbs/internals/curvelist.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getstepsize' mangled-name='_ZN9Curvelist11getstepsizeEv' filepath='libnurbs/internals/curvelist.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='cullCheck' mangled-name='_ZN9Curvelist9cullCheckEv' filepath='libnurbs/internals/curvelist.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d1ebbf42' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Flist' size-in-bits='320' visibility='default' filepath='libnurbs/internals/flist.h' line='42' column='1' id='79b62e7d'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/flist.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/flist.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='start' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/flist.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='end' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/flist.h' line='47' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='sorter' type-id='3b7cb332' visibility='default' filepath='libnurbs/internals/flist.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Flist' filepath='libnurbs/internals/flist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Flist' filepath='libnurbs/internals/flist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add' mangled-name='_ZN5Flist3addEf' filepath='libnurbs/internals/flist.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='taper' mangled-name='_ZN5Flist5taperEff' filepath='libnurbs/internals/flist.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='grow' mangled-name='_ZN5Flist4growEi' filepath='libnurbs/internals/flist.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='filter' mangled-name='_ZN5Flist6filterEv' filepath='libnurbs/internals/flist.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='6b4fa57d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='FlistSorter' size-in-bits='128' visibility='default' filepath='libnurbs/internals/flistsorter.h' line='42' column='1' id='3b7cb332'>
      <base-class access='public' layout-offset-in-bits='0' type-id='930e1102'/>
      <member-function access='private' constructor='yes'>
        <function-decl name='FlistSorter' filepath='libnurbs/internals/flistsorter.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='qsort' mangled-name='_ZN11FlistSorter5qsortEPfi' filepath='libnurbs/internals/flistsorter.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~FlistSorter' filepath='libnurbs/internals/flistsorter.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN11FlistSorter5qscmpEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN11FlistSorter5qsexcEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN11FlistSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/flistsorter.cc' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='0456e320' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='26a90f95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='JumpBuffer' size-in-bits='1600' is-struct='yes' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='56' column='1' id='46658fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='a3997015' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Patchlist' size-in-bits='640' is-struct='yes' visibility='default' filepath='libnurbs/internals/patchlist.h' line='45' column='1' id='48a81e9d'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='patch' type-id='049c92d9' visibility='default' filepath='libnurbs/internals/patchlist.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='notInBbox' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patchlist.h' line='64' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='needsSampling' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/patchlist.h' line='65' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='pspec' type-id='e0a39484' visibility='default' filepath='libnurbs/internals/patchlist.h' line='66' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Patchlist' filepath='libnurbs/internals/patchlist.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <parameter type-id='ad0c8abc'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Patchlist' filepath='libnurbs/internals/patchlist.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <parameter type-id='6a2f2849'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Patchlist' filepath='libnurbs/internals/patchlist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getRanges' mangled-name='_ZN9Patchlist9getRangesEPf' filepath='libnurbs/internals/patchlist.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='needsSamplingSubdivision' mangled-name='_ZN9Patchlist24needsSamplingSubdivisionEv' filepath='libnurbs/internals/patchlist.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='needsSubdivision' mangled-name='_ZN9Patchlist16needsSubdivisionEi' filepath='libnurbs/internals/patchlist.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='needsNonSamplingSubdivision' mangled-name='_ZN9Patchlist27needsNonSamplingSubdivisionEv' filepath='libnurbs/internals/patchlist.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='bbox' mangled-name='_ZN9Patchlist4bboxEv' filepath='libnurbs/internals/patchlist.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getstepsize' mangled-name='_ZN9Patchlist11getstepsizeEv' filepath='libnurbs/internals/patchlist.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='cullCheck' mangled-name='_ZN9Patchlist9cullCheckEv' filepath='libnurbs/internals/patchlist.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getStepsize' mangled-name='_ZN9Patchlist11getStepsizeEi' filepath='libnurbs/internals/patchlist.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='234bc418'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_uorder' mangled-name='_ZN9Patchlist10get_uorderEv' filepath='libnurbs/internals/patchlist.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_vorder' mangled-name='_ZN9Patchlist10get_vorderEv' filepath='libnurbs/internals/patchlist.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='762f3b2d' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Quilt' size-in-bits='896' is-struct='yes' visibility='default' filepath='libnurbs/internals/quilt.h' line='64' column='1' id='fb679596'>
      <base-class access='public' layout-offset-in-bits='0' type-id='1feb48e7'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mapdesc' type-id='4674ed22' visibility='default' filepath='libnurbs/internals/quilt.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cpts' type-id='c0eda015' visibility='default' filepath='libnurbs/internals/quilt.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qspec' type-id='cebeb113' visibility='default' filepath='libnurbs/internals/quilt.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='eqspec' type-id='cbe067ff' visibility='default' filepath='libnurbs/internals/quilt.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='next' type-id='ad0c8abc' visibility='default' filepath='libnurbs/internals/quilt.h' line='71' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Quilt' filepath='libnurbs/internals/quilt.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='4674ed22'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getDimension' mangled-name='_ZN5Quilt12getDimensionEv' filepath='libnurbs/internals/quilt.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='show' mangled-name='_ZN5Quilt4showEv' filepath='libnurbs/internals/quilt.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='select' mangled-name='_ZN5Quilt6selectEPfS0_' filepath='libnurbs/internals/quilt.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='findSampleRates' mangled-name='_ZN5Quilt15findSampleRatesER5FlistS1_' filepath='libnurbs/internals/quilt.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='5f4f9299'/>
          <parameter type-id='5f4f9299'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='findRates' mangled-name='_ZN5Quilt9findRatesER5FlistS1_Pf' filepath='libnurbs/internals/quilt.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='5f4f9299'/>
          <parameter type-id='5f4f9299'/>
          <parameter type-id='c0eda015'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getRange' mangled-name='_ZN5Quilt8getRangeEPfS0_iR5Flist' filepath='libnurbs/internals/quilt.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='5f4f9299'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getRange' mangled-name='_ZN5Quilt8getRangeEPfS0_R5Flist' filepath='libnurbs/internals/quilt.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='5f4f9299'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getRange' mangled-name='_ZN5Quilt8getRangeEPfS0_R5FlistS2_' filepath='libnurbs/internals/quilt.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='5f4f9299'/>
          <parameter type-id='5f4f9299'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='isCulled' mangled-name='_ZN5Quilt8isCulledEv' filepath='libnurbs/internals/quilt.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='download' mangled-name='_ZN5Quilt8downloadER7Backend' filepath='libnurbs/internals/quilt.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='6edb776b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='downloadAll' mangled-name='_ZN5Quilt11downloadAllEPfS0_R7Backend' filepath='libnurbs/internals/quilt.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='c0eda015'/>
          <parameter type-id='6edb776b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='deleteMe' mangled-name='_ZN5Quilt8deleteMeER4Pool' filepath='libnurbs/internals/quilt.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='16a1015f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='toBezier' mangled-name='_ZN5Quilt8toBezierER10KnotvectorS1_Pfl' filepath='libnurbs/internals/quilt.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='da1ade86'/>
          <parameter type-id='da1ade86'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='toBezier' mangled-name='_ZN5Quilt8toBezierER10KnotvectorPfl' filepath='libnurbs/internals/quilt.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='ad0c8abc' is-artificial='yes'/>
          <parameter type-id='da1ade86'/>
          <parameter type-id='361f7a7d'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Renderhints' size-in-bits='256' is-struct='yes' visibility='default' filepath='libnurbs/internals/renderhints.h' line='41' column='1' id='14066291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='display_method' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='errorchecking' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subdivisions' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tmp1' type-id='234bc418' visibility='default' filepath='libnurbs/internals/renderhints.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='displaydomain' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='maxsubdivisions' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wiretris' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='wirequads' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/renderhints.h' line='57' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='Renderhints' filepath='libnurbs/internals/renderhints.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c204f909' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN11Renderhints4initEv' filepath='libnurbs/internals/renderhints.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c204f909' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='isProperty' mangled-name='_ZN11Renderhints10isPropertyEl' filepath='libnurbs/internals/renderhints.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c204f909' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='setProperty' mangled-name='_ZN11Renderhints11setPropertyElf' filepath='libnurbs/internals/renderhints.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c204f909' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='getProperty' mangled-name='_ZN11Renderhints11getPropertyEl' filepath='libnurbs/internals/renderhints.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c204f909' is-artificial='yes'/>
          <parameter type-id='bd54fe1a'/>
          <return type-id='234bc418'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Subdivider' size-in-bits='20416' visibility='default' filepath='libnurbs/internals/subdivider.h' line='55' column='1' id='62291dde'>
      <member-type access='private'>
        <enum-decl name='dir' filepath='libnurbs/internals/subdivider.h' line='105' column='1' id='97aebf86'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='down' value='0'/>
          <enumerator name='same' value='1'/>
          <enumerator name='up' value='2'/>
          <enumerator name='none' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='slicer' type-id='588a6d01' visibility='default' filepath='libnurbs/internals/subdivider.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8064'>
        <var-decl name='arctessellator' type-id='96a897b1' visibility='default' filepath='libnurbs/internals/subdivider.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8192'>
        <var-decl name='arcpool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='114' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='10688'>
        <var-decl name='bezierarcpool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13184'>
        <var-decl name='pwlarcpool' type-id='1329513b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='15680'>
        <var-decl name='trimvertexpool' type-id='95c1e8c1' visibility='default' filepath='libnurbs/internals/subdivider.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18304'>
        <var-decl name='jumpbuffer' type-id='0e86d3eb' visibility='default' filepath='libnurbs/internals/subdivider.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18368'>
        <var-decl name='renderhints' type-id='ce050bed' visibility='default' filepath='libnurbs/internals/subdivider.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18432'>
        <var-decl name='backend' type-id='6edb776b' visibility='default' filepath='libnurbs/internals/subdivider.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18496'>
        <var-decl name='initialbin' type-id='55730736' visibility='default' filepath='libnurbs/internals/subdivider.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18624'>
        <var-decl name='pjarc' type-id='c118b035' visibility='default' filepath='libnurbs/internals/subdivider.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18688'>
        <var-decl name='s_index' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18720'>
        <var-decl name='t_index' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18752'>
        <var-decl name='qlist' type-id='ad0c8abc' visibility='default' filepath='libnurbs/internals/subdivider.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18816'>
        <var-decl name='spbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19136'>
        <var-decl name='tpbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19456'>
        <var-decl name='smbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19776'>
        <var-decl name='tmbrkpts' type-id='79b62e7d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20096'>
        <var-decl name='stepsizes' type-id='a201b87d' visibility='default' filepath='libnurbs/internals/subdivider.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20224'>
        <var-decl name='showDegenerate' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20256'>
        <var-decl name='isArcTypeBezier' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20288'>
        <var-decl name='domain_distance_u_rate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/subdivider.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20320'>
        <var-decl name='domain_distance_v_rate' type-id='234bc418' visibility='default' filepath='libnurbs/internals/subdivider.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20352'>
        <var-decl name='is_domain_distance_sampling' type-id='95e97e5e' visibility='default' filepath='libnurbs/internals/subdivider.h' line='190' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='Subdivider' filepath='libnurbs/internals/subdivider.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='ce050bed'/>
          <parameter type-id='6edb776b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Subdivider' filepath='libnurbs/internals/subdivider.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='bbox' mangled-name='_ZN10Subdivider4bboxEffffff' filepath='libnurbs/internals/subdivider.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='234bc418'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='ccw' mangled-name='_ZN10Subdivider3ccwEP10TrimVertexS1_S1_' filepath='libnurbs/internals/subdivider.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='86e0e963'/>
          <parameter type-id='86e0e963'/>
          <parameter type-id='86e0e963'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='bbox' mangled-name='_ZN10Subdivider4bboxEP10TrimVertexS1_S1_i' filepath='libnurbs/internals/subdivider.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='86e0e963'/>
          <parameter type-id='86e0e963'/>
          <parameter type-id='86e0e963'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ccwTurn_tl' mangled-name='_ZN10Subdivider10ccwTurn_tlEP3ArcS1_' filepath='libnurbs/internals/subdivider.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='c118b035'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ccwTurn_sr' mangled-name='_ZN10Subdivider10ccwTurn_srEP3ArcS1_' filepath='libnurbs/internals/subdivider.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='c118b035'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ccwTurn_sl' mangled-name='_ZN10Subdivider10ccwTurn_slEP3ArcS1_' filepath='libnurbs/internals/subdivider.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='c118b035'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ccwTurn_tr' mangled-name='_ZN10Subdivider10ccwTurn_trEP3ArcS1_' filepath='libnurbs/internals/subdivider.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='c118b035'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='samplingSplit' mangled-name='_ZN10Subdivider13samplingSplitER9Curvelisti' filepath='libnurbs/internals/subdivider.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='d5ebc58e'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='drawCurves' mangled-name='_ZN10Subdivider10drawCurvesEv' filepath='libnurbs/internals/subdivider.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='showingDegenerate' mangled-name='_ZN10Subdivider17showingDegenerateEv' filepath='libnurbs/internals/subdivider.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='classify_headonright_t' mangled-name='_ZN10Subdivider22classify_headonright_tER3BinS1_S1_f' filepath='libnurbs/internals/subdivider.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='classify_tailonright_t' mangled-name='_ZN10Subdivider22classify_tailonright_tER3BinS1_S1_f' filepath='libnurbs/internals/subdivider.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='classify_headonright_s' mangled-name='_ZN10Subdivider22classify_headonright_sER3BinS1_S1_f' filepath='libnurbs/internals/subdivider.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='classify_tailonright_s' mangled-name='_ZN10Subdivider22classify_tailonright_sER3BinS1_S1_f' filepath='libnurbs/internals/subdivider.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='classify_headonleft_t' mangled-name='_ZN10Subdivider21classify_headonleft_tER3BinS1_S1_f' filepath='libnurbs/internals/subdivider.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='classify_tailonleft_t' mangled-name='_ZN10Subdivider21classify_tailonleft_tER3BinS1_S1_f' filepath='libnurbs/internals/subdivider.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='classify_headonleft_s' mangled-name='_ZN10Subdivider21classify_headonleft_sER3BinS1_S1_f' filepath='libnurbs/internals/subdivider.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='classify_tailonleft_s' mangled-name='_ZN10Subdivider21classify_tailonleft_sER3BinS1_S1_f' filepath='libnurbs/internals/subdivider.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='arc_split' mangled-name='_ZN10Subdivider9arc_splitEP3Arcifi' filepath='libnurbs/internals/subdivider.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='partition' mangled-name='_ZN10Subdivider9partitionER3BinS1_S1_S1_S1_if' filepath='libnurbs/internals/subdivider.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='isMonotone' mangled-name='_ZN10Subdivider10isMonotoneEP3Arc' filepath='libnurbs/internals/subdivider.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='monotonize' mangled-name='_ZN10Subdivider10monotonizeEP3ArcR3Bin' filepath='libnurbs/internals/subdivider.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='6eadc0e8'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='tessellate' mangled-name='_ZN10Subdivider10tessellateEP3Arcf' filepath='libnurbs/internals/subdivider.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='c118b035'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='decompose' mangled-name='_ZN10Subdivider9decomposeER3Binf' filepath='libnurbs/internals/subdivider.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='6eadc0e8'/>
          <parameter type-id='234bc418'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_domain_distance_u_rate' mangled-name='_ZN10Subdivider26set_domain_distance_u_rateEf' filepath='libnurbs/internals/subdivider.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_domain_distance_v_rate' mangled-name='_ZN10Subdivider26set_domain_distance_v_rateEf' filepath='libnurbs/internals/subdivider.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='234bc418'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_is_domain_distance_sampling' mangled-name='_ZN10Subdivider31set_is_domain_distance_samplingEi' filepath='libnurbs/internals/subdivider.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='beginTrims' mangled-name='_ZN10Subdivider10beginTrimsEv' filepath='libnurbs/internals/subdivider.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='beginLoop' mangled-name='_ZN10Subdivider9beginLoopEv' filepath='libnurbs/internals/subdivider.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='endLoop' mangled-name='_ZN10Subdivider7endLoopEv' filepath='libnurbs/internals/subdivider.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='endTrims' mangled-name='_ZN10Subdivider8endTrimsEv' filepath='libnurbs/internals/subdivider.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3fc86c54' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
