<abi-corpus version='2.1' path='data/test-read-dwarf/test19-pr19023-libtcmalloc_and_profiler.so' soname='libtcmalloc_and_profiler.so.4'>
  <elf-needed>
    <dependency name='libunwind.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='GetHeapProfile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerDump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStart' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='IsHeapProfilerRunning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetEstimatedAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTV15MallocExtension' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16MmapSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16SbrkSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18DevMemSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19DefaultSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19HugetlbSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22TCMallocImplementation' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE13kPageHeapType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE14kLargeSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE16kThreadCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE17kCentralCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE18kTransferCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE21kPageHeapUnmappedType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE22kLargeUnmappedSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__free_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__malloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__memalign_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__realloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='heap_leak_checker_bcad_variable' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sys_alloc' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/base/atomicops-internals-x86.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/dynamic_annotations.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C89'>
    <function-decl name='RunningOnValgrind' mangled-name='RunningOnValgrind' filepath='src/base/dynamic_annotations.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='RunningOnValgrind'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ValgrindSlowdown' mangled-name='ValgrindSlowdown' filepath='src/base/dynamic_annotations.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ValgrindSlowdown'>
      <return type-id='a0eb0f08'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/elf_mem_image.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='128' id='92a46553'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <typedef-decl name='Elf64_Half' type-id='149c6638' filepath='/usr/include/elf.h' line='34' column='1' id='101a70d5'/>
    <typedef-decl name='Elf64_Word' type-id='8f92235e' filepath='/usr/include/elf.h' line='39' column='1' id='e57120d4'/>
    <typedef-decl name='Elf64_Xword' type-id='9c313c2d' filepath='/usr/include/elf.h' line='45' column='1' id='c87c44e4'/>
    <typedef-decl name='Elf64_Addr' type-id='9c313c2d' filepath='/usr/include/elf.h' line='50' column='1' id='e14340cf'/>
    <typedef-decl name='Elf64_Off' type-id='9c313c2d' filepath='/usr/include/elf.h' line='54' column='1' id='59ecf0a1'/>
    <typedef-decl name='Elf64_Section' type-id='149c6638' filepath='/usr/include/elf.h' line='58' column='1' id='d12d195b'/>
    <typedef-decl name='Elf64_Versym' type-id='101a70d5' filepath='/usr/include/elf.h' line='62' column='1' id='a2a635e8'/>
    <class-decl name='Elf64_Ehdr' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='88' column='1' id='ae18684e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e_ident' type-id='92a46553' visibility='default' filepath='/usr/include/elf.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='e_type' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='e_machine' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='e_version' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='e_entry' type-id='e14340cf' visibility='default' filepath='/usr/include/elf.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='e_phoff' type-id='59ecf0a1' visibility='default' filepath='/usr/include/elf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='e_shoff' type-id='59ecf0a1' visibility='default' filepath='/usr/include/elf.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='e_flags' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='e_ehsize' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='e_phentsize' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='e_phnum' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='e_shentsize' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='e_shnum' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='e_shstrndx' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Sym' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='389' column='1' id='cc5b6020'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_name' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='st_info' type-id='002ac4a6' visibility='default' filepath='/usr/include/elf.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='st_other' type-id='002ac4a6' visibility='default' filepath='/usr/include/elf.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='st_shndx' type-id='d12d195b' visibility='default' filepath='/usr/include/elf.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_value' type-id='e14340cf' visibility='default' filepath='/usr/include/elf.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_size' type-id='c87c44e4' visibility='default' filepath='/usr/include/elf.h' line='395' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Phdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='551' column='1' id='6392ff97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_type' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='p_flags' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_offset' type-id='59ecf0a1' visibility='default' filepath='/usr/include/elf.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_vaddr' type-id='e14340cf' visibility='default' filepath='/usr/include/elf.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_paddr' type-id='e14340cf' visibility='default' filepath='/usr/include/elf.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_filesz' type-id='c87c44e4' visibility='default' filepath='/usr/include/elf.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_memsz' type-id='c87c44e4' visibility='default' filepath='/usr/include/elf.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_align' type-id='c87c44e4' visibility='default' filepath='/usr/include/elf.h' line='559' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdef' size-in-bits='160' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='812' column='1' id='67df529d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vd_version' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='vd_flags' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vd_ndx' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vd_cnt' type-id='101a70d5' visibility='default' filepath='/usr/include/elf.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vd_hash' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vd_aux' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vd_next' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='819' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdaux' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='849' column='1' id='14241928'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vda_name' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='850' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vda_next' type-id='e57120d4' visibility='default' filepath='/usr/include/elf.h' line='851' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='8efea9e5' filepath='/usr/include/stdint.h' line='50' column='1' id='149c6638'/>
    <pointer-type-def type-id='8218d397' size-in-bits='64' id='c3afe33f'/>
    <pointer-type-def type-id='2318e2fb' size-in-bits='64' id='dab1a32b'/>
    <reference-type-def kind='lvalue' type-id='a0ebd015' size-in-bits='64' id='56ac1951'/>
    <pointer-type-def type-id='a0ebd015' size-in-bits='64' id='52ac1305'/>
    <qualified-type-def type-id='ae18684e' const='yes' id='ea86af8f'/>
    <pointer-type-def type-id='ea86af8f' size-in-bits='64' id='d70680bf'/>
    <qualified-type-def type-id='6392ff97' const='yes' id='b896fae6'/>
    <pointer-type-def type-id='b896fae6' size-in-bits='64' id='61accf24'/>
    <qualified-type-def type-id='cc5b6020' const='yes' id='b126f863'/>
    <pointer-type-def type-id='b126f863' size-in-bits='64' id='2958daeb'/>
    <qualified-type-def type-id='14241928' const='yes' id='9ad92567'/>
    <pointer-type-def type-id='9ad92567' size-in-bits='64' id='10d5b837'/>
    <qualified-type-def type-id='67df529d' const='yes' id='7a2255e0'/>
    <pointer-type-def type-id='7a2255e0' size-in-bits='64' id='0e0d0cfe'/>
    <qualified-type-def type-id='a2a635e8' const='yes' id='6bd6ded8'/>
    <pointer-type-def type-id='6bd6ded8' size-in-bits='64' id='b540f6f6'/>
    <qualified-type-def type-id='e57120d4' const='yes' id='21188f44'/>
    <pointer-type-def type-id='21188f44' size-in-bits='64' id='87a9ca2a'/>
    <qualified-type-def type-id='8218d397' const='yes' id='431a7e1c'/>
    <pointer-type-def type-id='431a7e1c' size-in-bits='64' id='d8b4af02'/>
    <qualified-type-def type-id='2318e2fb' const='yes' id='d4ebdc30'/>
    <reference-type-def kind='lvalue' type-id='d4ebdc30' size-in-bits='64' id='454b76a2'/>
    <pointer-type-def type-id='d4ebdc30' size-in-bits='64' id='494b7cee'/>
    <qualified-type-def type-id='a0ebd015' const='yes' id='9de051e6'/>
    <reference-type-def kind='lvalue' type-id='9de051e6' size-in-bits='64' id='4820b140'/>
    <pointer-type-def type-id='9de051e6' size-in-bits='64' id='5420c424'/>
    <namespace-decl name='base'>
      <class-decl name='ElfMemImage' size-in-bits='576' visibility='default' filepath='./src/base/elf_mem_image.h' line='56' column='1' id='8218d397'>
        <member-type access='private'>
          <class-decl name='SymbolInfo' size-in-bits='256' is-struct='yes' visibility='default' filepath='./src/base/elf_mem_image.h' line='64' column='1' id='2318e2fb'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='name' type-id='80f4b756' visibility='default' filepath='./src/base/elf_mem_image.h' line='65' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='version' type-id='80f4b756' visibility='default' filepath='./src/base/elf_mem_image.h' line='66' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='address' type-id='eaa32e2f' visibility='default' filepath='./src/base/elf_mem_image.h' line='68' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='symbol' type-id='2958daeb' visibility='default' filepath='./src/base/elf_mem_image.h' line='69' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='SymbolIterator' size-in-bits='384' visibility='default' filepath='./src/base/elf_mem_image.h' line='73' column='1' id='a0ebd015'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='info_' type-id='2318e2fb' visibility='default' filepath='./src/base/elf_mem_image.h' line='84' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <var-decl name='index_' type-id='95e97e5e' visibility='default' filepath='./src/base/elf_mem_image.h' line='85' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='320'>
              <var-decl name='image_' type-id='83be723c' visibility='default' filepath='./src/base/elf_mem_image.h' line='86' column='1'/>
            </data-member>
            <member-function access='private' constructor='yes'>
              <function-decl name='SymbolIterator' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi' filepath='./src/base/elf_mem_image.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi'>
                <parameter type-id='52ac1305' is-artificial='yes'/>
                <parameter type-id='eaa32e2f'/>
                <parameter type-id='95e97e5e'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator-&gt;' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorptEv' filepath='./src/base/elf_mem_image.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorptEv'>
                <parameter type-id='5420c424' is-artificial='yes'/>
                <return type-id='494b7cee'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator*' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratordeEv' filepath='./src/base/elf_mem_image.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratordeEv'>
                <parameter type-id='5420c424' is-artificial='yes'/>
                <return type-id='454b76a2'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator==' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_' filepath='./src/base/elf_mem_image.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_'>
                <parameter type-id='5420c424' is-artificial='yes'/>
                <parameter type-id='4820b140'/>
                <return type-id='c894953d'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator!=' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_' filepath='./src/base/elf_mem_image.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_'>
                <parameter type-id='5420c424' is-artificial='yes'/>
                <parameter type-id='4820b140'/>
                <return type-id='c894953d'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='Update' mangled-name='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi' filepath='./src/base/elf_mem_image.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi'>
                <parameter type-id='52ac1305' is-artificial='yes'/>
                <parameter type-id='95e97e5e'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator++' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorppEv' filepath='./src/base/elf_mem_image.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorppEv'>
                <parameter type-id='52ac1305' is-artificial='yes'/>
                <return type-id='56ac1951'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='kInvalidBase' type-id='83be723c' mangled-name='_ZN4base11ElfMemImage12kInvalidBaseE' visibility='default' filepath='./src/base/elf_mem_image.h' line='59' column='1' elf-symbol-id='_ZN4base11ElfMemImage12kInvalidBaseE'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='ehdr_' type-id='d70680bf' visibility='default' filepath='./src/base/elf_mem_image.h' line='120' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='dynsym_' type-id='2958daeb' visibility='default' filepath='./src/base/elf_mem_image.h' line='121' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='versym_' type-id='b540f6f6' visibility='default' filepath='./src/base/elf_mem_image.h' line='122' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='verdef_' type-id='0e0d0cfe' visibility='default' filepath='./src/base/elf_mem_image.h' line='123' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='hash_' type-id='87a9ca2a' visibility='default' filepath='./src/base/elf_mem_image.h' line='124' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='dynstr_' type-id='80f4b756' visibility='default' filepath='./src/base/elf_mem_image.h' line='125' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='strsize_' type-id='b59d7dce' visibility='default' filepath='./src/base/elf_mem_image.h' line='126' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <var-decl name='verdefnum_' type-id='b59d7dce' visibility='default' filepath='./src/base/elf_mem_image.h' line='127' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='512'>
          <var-decl name='link_base_' type-id='e14340cf' visibility='default' filepath='./src/base/elf_mem_image.h' line='128' column='1'/>
        </data-member>
        <member-function access='private' constructor='yes'>
          <function-decl name='ElfMemImage' mangled-name='_ZN4base11ElfMemImageC1EPKv' filepath='./src/base/elf_mem_image.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImageC1EPKv'>
            <parameter type-id='c3afe33f' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='IsPresent' mangled-name='_ZNK4base11ElfMemImage9IsPresentEv' filepath='./src/base/elf_mem_image.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetNumSymbols' mangled-name='_ZNK4base11ElfMemImage13GetNumSymbolsEv' filepath='./src/base/elf_mem_image.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage13GetNumSymbolsEv'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <return type-id='95e97e5e'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdefAux' mangled-name='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' filepath='./src/base/elf_mem_image.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='0e0d0cfe'/>
            <return type-id='10d5b837'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='end' mangled-name='_ZNK4base11ElfMemImage3endEv' filepath='./src/base/elf_mem_image.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage3endEv'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <return type-id='a0ebd015'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerstr' mangled-name='_ZNK4base11ElfMemImage9GetVerstrEj' filepath='./src/base/elf_mem_image.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerstrEj'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='e57120d4'/>
            <return type-id='80f4b756'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdef' mangled-name='_ZNK4base11ElfMemImage9GetVerdefEi' filepath='./src/base/elf_mem_image.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerdefEi'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='0e0d0cfe'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetSymAddr' mangled-name='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' filepath='./src/base/elf_mem_image.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='2958daeb'/>
            <return type-id='eaa32e2f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynstr' mangled-name='_ZNK4base11ElfMemImage9GetDynstrEj' filepath='./src/base/elf_mem_image.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynstrEj'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='e57120d4'/>
            <return type-id='80f4b756'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetPhdr' mangled-name='_ZNK4base11ElfMemImage7GetPhdrEi' filepath='./src/base/elf_mem_image.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage7GetPhdrEi'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='61accf24'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Init' mangled-name='_ZN4base11ElfMemImage4InitEPKv' filepath='./src/base/elf_mem_image.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage4InitEPKv'>
            <parameter type-id='c3afe33f' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVersym' mangled-name='_ZNK4base11ElfMemImage9GetVersymEi' filepath='./src/base/elf_mem_image.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVersymEi'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='b540f6f6'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynsym' mangled-name='_ZNK4base11ElfMemImage9GetDynsymEi' filepath='./src/base/elf_mem_image.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynsymEi'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <return type-id='2958daeb'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='begin' mangled-name='_ZNK4base11ElfMemImage5beginEv' filepath='./src/base/elf_mem_image.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage5beginEv'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <return type-id='a0ebd015'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' filepath='./src/base/elf_mem_image.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='dab1a32b'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' filepath='./src/base/elf_mem_image.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE'>
            <parameter type-id='d8b4af02' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='95e97e5e'/>
            <parameter type-id='dab1a32b'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/linuxthreads.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <typedef-decl name='ListAllProcessThreadsCallBack' type-id='0b53525f' filepath='./src/base/thread_lister.h' line='48' column='1' id='6abb23d6'/>
    <typedef-decl name='__pid_t' type-id='95e97e5e' filepath='/usr/include/bits/types.h' line='143' column='1' id='3629bad8'/>
    <typedef-decl name='pid_t' type-id='3629bad8' filepath='/usr/include/sched.h' line='37' column='1' id='587f89d2'/>
    <pointer-type-def type-id='81589a53' size-in-bits='64' id='0b53525f'/>
    <pointer-type-def type-id='587f89d2' size-in-bits='64' id='6d654359'/>
    <function-decl name='TCMalloc_ListAllProcessThreads' mangled-name='TCMalloc_ListAllProcessThreads' filepath='src/base/linuxthreads.cc' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ListAllProcessThreads'>
      <parameter type-id='eaa32e2f' name='parameter' filepath='src/base/linuxthreads.cc' line='551' column='1'/>
      <parameter type-id='6abb23d6' name='callback' filepath='src/base/linuxthreads.cc' line='552' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='TCMalloc_ResumeAllProcessThreads' mangled-name='TCMalloc_ResumeAllProcessThreads' filepath='src/base/linuxthreads.cc' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ResumeAllProcessThreads'>
      <parameter type-id='95e97e5e' name='num_threads' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <parameter type-id='6d654359' name='thread_pids' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='81589a53'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='6d654359'/>
      <parameter type-id='38f76a2a'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/logging.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead'>
      <var-decl name='FLAGS_verbose' type-id='93e3c360' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE' visibility='default' filepath='./src/base/logging.h' line='76' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE'/>
      <var-decl name='FLAGS_noverbose' type-id='a84c031d' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE' visibility='default' filepath='src/base/logging.cc' line='40' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE'/>
    </namespace-decl>
    <function-decl name='RawOpenForWriting' mangled-name='_Z17RawOpenForWritingPKc' filepath='src/base/logging.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17RawOpenForWritingPKc'>
      <parameter type-id='80f4b756' name='filename' filepath='src/base/logging.cc' line='90' column='1'/>
      <return type-id='97ef4358'/>
    </function-decl>
    <function-decl name='RawWrite' mangled-name='_Z8RawWriteiPKcm' filepath='src/base/logging.cc' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawWriteiPKcm'>
      <parameter type-id='97ef4358' name='fd' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='80f4b756' name='buf' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='src/base/logging.cc' line='94' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='RawClose' mangled-name='_Z8RawClosei' filepath='src/base/logging.cc' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawClosei'>
      <parameter type-id='97ef4358'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/low_level_alloc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='742e7627' size-in-bits='1920' id='187771b6'>
      <subrange length='30' type-id='7359adad' id='6a6183a4'/>
    </array-type-def>
    <pointer-type-def type-id='0bc47fdf' size-in-bits='64' id='742e7627'/>
    <namespace-decl name='low_level_alloc_internal'>
      <class-decl name='AllocList' size-in-bits='2240' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='67' column='1' id='0bc47fdf'>
        <member-type access='public'>
          <class-decl name='Header' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='68' column='1' id='6a1c52b6'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='33dbba72' visibility='default' filepath='src/base/low_level_alloc.cc' line='69' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='magic' type-id='33dbba72' visibility='default' filepath='src/base/low_level_alloc.cc' line='71' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='arena' type-id='6af4b8a9' visibility='default' filepath='src/base/low_level_alloc.cc' line='72' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='dummy_for_alignment' type-id='eaa32e2f' visibility='default' filepath='src/base/low_level_alloc.cc' line='73' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='header' type-id='6a1c52b6' visibility='default' filepath='src/base/low_level_alloc.cc' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='levels' type-id='95e97e5e' visibility='default' filepath='src/base/low_level_alloc.cc' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='next' type-id='187771b6' visibility='default' filepath='src/base/low_level_alloc.cc' line='79' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='CycleClock' size-in-bits='8' is-struct='yes' visibility='default' filepath='./src/base/cycleclock.h' line='79' column='1' id='0e0a5479'>
      <member-function access='public' static='yes'>
        <function-decl name='Now' mangled-name='_ZN10CycleClock3NowEv' filepath='./src/base/cycleclock.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <return type-id='27dc5d97'/>
        </function-decl>
      </member-function>
    </class-decl>
    <namespace-decl name='base'>
      <function-decl name='SubmitSpinLockProfileData' mangled-name='_ZN4base25SubmitSpinLockProfileDataEPKvl' filepath='./src/base/synchronization_profiling.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base25SubmitSpinLockProfileDataEPKvl'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='27dc5d97'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock_internal.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='c9c48124' const='yes' id='1664b4f5'/>
    <pointer-type-def type-id='1664b4f5' size-in-bits='64' id='1f88bb0d'/>
    <namespace-decl name='base'>
      <namespace-decl name='subtle'>
        <function-decl name='Acquire_Load' filepath='./src/base/atomicops-internals-x86.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='731877ca'/>
          <return type-id='a0e74fd8'/>
        </function-decl>
      </namespace-decl>
      <namespace-decl name='internal'>
        <class-decl name='SpinLockWaitTransition' size-in-bits='96' is-struct='yes' visibility='default' filepath='./src/base/spinlock_internal.h' line='48' column='1' id='c9c48124'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='from' type-id='93e3c360' visibility='default' filepath='./src/base/spinlock_internal.h' line='49' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='to' type-id='93e3c360' visibility='default' filepath='./src/base/spinlock_internal.h' line='50' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='done' type-id='c894953d' visibility='default' filepath='./src/base/spinlock_internal.h' line='51' column='1'/>
          </data-member>
        </class-decl>
        <function-decl name='SpinLockDelay' mangled-name='_ZN4base8internal13SpinLockDelayEPViii' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal13SpinLockDelayEPViii'>
          <parameter type-id='fd92fe1b'/>
          <parameter type-id='93e3c360'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
        <function-decl name='SpinLockWake' mangled-name='_ZN4base8internal12SpinLockWakeEPVib' filepath='./src/base/spinlock_linux-inl.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWakeEPVib'>
          <parameter type-id='fd92fe1b'/>
          <parameter type-id='c894953d'/>
          <return type-id='48b5725f'/>
        </function-decl>
        <function-decl name='SpinLockWait' mangled-name='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE' filepath='src/base/spinlock_internal.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE'>
          <parameter type-id='fd92fe1b'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='1f88bb0d'/>
          <return type-id='93e3c360'/>
        </function-decl>
      </namespace-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/sysinfo.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='80' id='f0110942'>
      <subrange length='10' type-id='7359adad' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='40960' id='b26cd749'>
      <subrange length='5120' type-id='7359adad' id='797fed41'/>
    </array-type-def>
    <class-decl name='ProcMapsIterator' size-in-bits='640' visibility='default' filepath='./src/base/sysinfo.h' line='102' column='1' id='96b1e518'>
      <member-type access='private'>
        <class-decl name='Buffer' size-in-bits='40960' is-struct='yes' visibility='default' filepath='./src/base/sysinfo.h' line='104' column='1' id='be328ace'>
          <data-member access='public' static='yes'>
            <var-decl name='kBufSize' type-id='d0fa5dde' visibility='default' filepath='./src/base/sysinfo.h' line='110' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf_' type-id='b26cd749' visibility='default' filepath='./src/base/sysinfo.h' line='112' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='ibuf_' type-id='26a90f95' visibility='default' filepath='./src/base/sysinfo.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='stext_' type-id='26a90f95' visibility='default' filepath='./src/base/sysinfo.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='etext_' type-id='26a90f95' visibility='default' filepath='./src/base/sysinfo.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='nextline_' type-id='26a90f95' visibility='default' filepath='./src/base/sysinfo.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='ebuf_' type-id='26a90f95' visibility='default' filepath='./src/base/sysinfo.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='fd_' type-id='95e97e5e' visibility='default' filepath='./src/base/sysinfo.h' line='219' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='pid_' type-id='587f89d2' visibility='default' filepath='./src/base/sysinfo.h' line='221' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='flags_' type-id='f0110942' visibility='default' filepath='./src/base/sysinfo.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='dynamic_buffer_' type-id='30b72344' visibility='default' filepath='./src/base/sysinfo.h' line='223' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='using_maps_backing_' type-id='c894953d' visibility='default' filepath='./src/base/sysinfo.h' line='224' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1Ei' filepath='./src/base/sysinfo.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1Ei'>
          <parameter type-id='8c7c87ee' is-artificial='yes'/>
          <parameter type-id='587f89d2'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC2EiPNS_6BufferE' filepath='./src/base/sysinfo.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC2EiPNS_6BufferE'>
          <parameter type-id='8c7c87ee' is-artificial='yes'/>
          <parameter type-id='587f89d2'/>
          <parameter type-id='30b72344'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb' filepath='./src/base/sysinfo.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb'>
          <parameter type-id='8c7c87ee' is-artificial='yes'/>
          <parameter type-id='587f89d2'/>
          <parameter type-id='30b72344'/>
          <parameter type-id='c894953d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorD1Ev' filepath='./src/base/sysinfo.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorD1Ev'>
          <parameter type-id='8c7c87ee' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Valid' mangled-name='_ZNK16ProcMapsIterator5ValidEv' filepath='./src/base/sysinfo.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16ProcMapsIterator5ValidEv'>
          <parameter type-id='007278c9' is-artificial='yes'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FormatLine' mangled-name='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m' filepath='./src/base/sysinfo.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m'>
          <parameter type-id='26a90f95'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='f69d0a36'/>
          <parameter type-id='f69d0a36'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='f69d0a36'/>
          <parameter type-id='27dc5d97'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='8504f260'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Init' mangled-name='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb' filepath='./src/base/sysinfo.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb'>
          <parameter type-id='8c7c87ee' is-artificial='yes'/>
          <parameter type-id='587f89d2'/>
          <parameter type-id='30b72344'/>
          <parameter type-id='c894953d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NextExt' mangled-name='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_' filepath='./src/base/sysinfo.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_'>
          <parameter type-id='8c7c87ee' is-artificial='yes'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='9b23c9ad'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='51cd93ca'/>
          <parameter type-id='9b23c9ad'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='33f86a47'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Next' mangled-name='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_' filepath='./src/base/sysinfo.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_'>
          <parameter type-id='8c7c87ee' is-artificial='yes'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='9b23c9ad'/>
          <parameter type-id='1eecf1bb'/>
          <parameter type-id='51cd93ca'/>
          <parameter type-id='9b23c9ad'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='7359adad' filepath='/usr/include/bits/types.h' line='134' column='1' id='35ed8932'/>
    <typedef-decl name='dev_t' type-id='35ed8932' filepath='/usr/include/sys/types.h' line='61' column='1' id='8504f260'/>
    <pointer-type-def type-id='96b1e518' size-in-bits='64' id='8c7c87ee'/>
    <pointer-type-def type-id='be328ace' size-in-bits='64' id='30b72344'/>
    <qualified-type-def type-id='96b1e518' const='yes' id='e4e08599'/>
    <pointer-type-def type-id='e4e08599' size-in-bits='64' id='007278c9'/>
    <pointer-type-def type-id='8504f260' size-in-bits='64' id='33f86a47'/>
    <pointer-type-def type-id='27dc5d97' size-in-bits='64' id='51cd93ca'/>
    <pointer-type-def type-id='f69d0a36' size-in-bits='64' id='1eecf1bb'/>
    <namespace-decl name='tcmalloc'>
      <function-decl name='FillProcSelfMaps' mangled-name='_ZN8tcmalloc16FillProcSelfMapsEPciPb' filepath='src/base/sysinfo.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16FillProcSelfMapsEPciPb'>
        <parameter type-id='26a90f95'/>
        <parameter type-id='95e97e5e'/>
        <parameter type-id='d8e6b335'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='DumpProcSelfMaps' mangled-name='_ZN8tcmalloc16DumpProcSelfMapsEi' filepath='src/base/sysinfo.cc' line='1137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16DumpProcSelfMapsEi'>
        <parameter type-id='97ef4358'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </namespace-decl>
    <function-decl name='GetenvBeforeMain' mangled-name='_Z16GetenvBeforeMainPKc' filepath='src/base/sysinfo.cc' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16GetenvBeforeMainPKc'>
      <parameter type-id='80f4b756' name='name' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='TCMallocGetenvSafe' mangled-name='TCMallocGetenvSafe' filepath='src/base/sysinfo.cc' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMallocGetenvSafe'>
      <parameter type-id='80f4b756' name='name' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='GetUniquePathFromEnv' mangled-name='_Z20GetUniquePathFromEnvPKcPc' filepath='src/base/sysinfo.cc' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20GetUniquePathFromEnvPKcPc'>
      <parameter type-id='80f4b756' name='env_name' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <parameter type-id='26a90f95' name='path' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='SleepForMilliseconds' mangled-name='_Z20SleepForMillisecondsi' filepath='src/base/sysinfo.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20SleepForMillisecondsi'>
      <parameter type-id='95e97e5e' name='milliseconds' filepath='src/base/sysinfo.cc' line='226' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='CyclesPerSecond' mangled-name='_Z15CyclesPerSecondv' filepath='src/base/sysinfo.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15CyclesPerSecondv'>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='NumCPUs' mangled-name='_Z7NumCPUsv' filepath='src/base/sysinfo.cc' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7NumCPUsv'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='HasPosixThreads' mangled-name='_Z15HasPosixThreadsv' filepath='src/base/sysinfo.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15HasPosixThreadsv'>
      <return type-id='c894953d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/vdso_support.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='123a125e' size-in-bits='64' id='ab6d0374'/>
    <pointer-type-def type-id='28c22d5f' size-in-bits='64' id='419d2b57'/>
    <pointer-type-def type-id='618acbcc' size-in-bits='64' id='b5f08a13'/>
    <qualified-type-def type-id='28c22d5f' const='yes' id='4fec67e8'/>
    <reference-type-def kind='lvalue' type-id='4fec67e8' size-in-bits='64' id='9f27694a'/>
    <pointer-type-def type-id='4fec67e8' size-in-bits='64' id='93275666'/>
    <namespace-decl name='base'>
      <class-decl name='VDSOSupport' size-in-bits='576' visibility='default' filepath='./src/base/vdso_support.h' line='72' column='1' id='28c22d5f'>
        <member-type access='private'>
          <typedef-decl name='SymbolInfo' type-id='2318e2fb' filepath='./src/base/vdso_support.h' line='76' column='1' id='618acbcc'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='SymbolIterator' type-id='a0ebd015' filepath='./src/base/vdso_support.h' line='77' column='1' id='0a25519a'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='image_' type-id='8218d397' visibility='default' filepath='./src/base/vdso_support.h' line='112' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='vdso_base_' type-id='eaa32e2f' mangled-name='_ZN4base11VDSOSupport10vdso_base_E' visibility='default' filepath='./src/base/vdso_support.h' line='123' column='1' elf-symbol-id='_ZN4base11VDSOSupport10vdso_base_E'/>
        </data-member>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOSupport' mangled-name='_ZN4base11VDSOSupportC1Ev' filepath='./src/base/vdso_support.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupportC1Ev'>
            <parameter type-id='419d2b57' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOSupport' filepath='./src/base/vdso_support.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='419d2b57' is-artificial='yes'/>
            <parameter type-id='9f27694a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE' filepath='./src/base/vdso_support.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE'>
            <parameter type-id='93275666' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='b5f08a13'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE' filepath='./src/base/vdso_support.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE'>
            <parameter type-id='93275666' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='95e97e5e'/>
            <parameter type-id='b5f08a13'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='SetBase' mangled-name='_ZN4base11VDSOSupport7SetBaseEPKv' filepath='./src/base/vdso_support.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport7SetBaseEPKv'>
            <parameter type-id='419d2b57' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <return type-id='eaa32e2f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='Init' mangled-name='_ZN4base11VDSOSupport4InitEv' filepath='./src/base/vdso_support.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport4InitEv'>
            <return type-id='eaa32e2f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='VDSOInitHelper' size-in-bits='8' visibility='default' filepath='src/base/vdso_support.cc' line='137' column='1' id='123a125e'>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOInitHelper' filepath='src/base/vdso_support.cc' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='ab6d0374' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/central_freelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <reference-type-def kind='lvalue' type-id='2448a865' size-in-bits='64' id='6160e179'/>
    <qualified-type-def type-id='3ff5601b' const='yes' id='922df12b'/>
    <reference-type-def kind='lvalue' type-id='922df12b' size-in-bits='64' id='2b527777'/>
    <qualified-type-def type-id='b7915390' const='yes' id='818d1bfd'/>
    <pointer-type-def type-id='818d1bfd' size-in-bits='64' id='c822d375'/>
    <namespace-decl name='std'>
      <function-decl name='min&lt;int32_t&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='2b527777'/>
        <parameter type-id='2b527777'/>
        <return type-id='2b527777'/>
      </function-decl>
      <function-decl name='max&lt;int&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='6160e179'/>
        <parameter type-id='6160e179'/>
        <return type-id='6160e179'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='tcmalloc'>
      <function-decl name='SLL_PushRange' filepath='src/linked_list.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='63e171df'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='eaa32e2f'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='DLL_IsEmpty' filepath='src/span.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='c822d375'/>
        <return type-id='c894953d'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='tcmalloc'>
      <function-decl name='AlignmentForSize' mangled-name='_ZN8tcmalloc16AlignmentForSizeEm' filepath='src/common.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16AlignmentForSizeEm'>
        <parameter type-id='b59d7dce'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='MetaDataAlloc' mangled-name='_ZN8tcmalloc13MetaDataAllocEm' filepath='src/common.cc' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc13MetaDataAllocEm'>
        <parameter type-id='b59d7dce'/>
        <return type-id='eaa32e2f'/>
      </function-decl>
      <function-decl name='metadata_system_bytes' mangled-name='_ZN8tcmalloc21metadata_system_bytesEv' filepath='src/common.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc21metadata_system_bytesEv'>
        <return type-id='9c313c2d'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker-bcad.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='HeapLeakCheckerGlobalPrePost' size-in-bits='8' visibility='default' filepath='src/heap-checker-bcad.cc' line='60' column='1' id='b537c78b'>
      <data-member access='private' static='yes'>
        <var-decl name='count_' type-id='95e97e5e' mangled-name='_ZN28HeapLeakCheckerGlobalPrePost6count_E' visibility='default' filepath='src/heap-checker-bcad.cc' line='87' column='1' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePost6count_E'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakCheckerGlobalPrePost' filepath='src/heap-checker-bcad.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9dc8dd1b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakCheckerGlobalPrePost' mangled-name='_ZN28HeapLeakCheckerGlobalPrePostD1Ev' filepath='src/heap-checker-bcad.cc' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePostD1Ev'>
          <parameter type-id='9dc8dd1b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='b537c78b' size-in-bits='64' id='9dc8dd1b'/>
    <var-decl name='heap_leak_checker_bcad_variable' type-id='c894953d' mangled-name='heap_leak_checker_bcad_variable' visibility='default' filepath='src/heap-checker-bcad.cc' line='53' column='1' elf-symbol-id='heap_leak_checker_bcad_variable'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='infinite' id='e84913bd'>
      <subrange length='infinite' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b59d7dce' size-in-bits='256' id='314f9837'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='2048' id='72e15f00'>
      <subrange length='32' type-id='7359adad' id='ae5bde82'/>
    </array-type-def>
    <typedef-decl name='RawFD' type-id='95e97e5e' filepath='./src/base/logging.h' line='251' column='1' id='97ef4358'/>
    <class-decl name='HeapCleaner' size-in-bits='8' visibility='default' filepath='./src/gperftools/heap-checker.h' line='403' column='1' id='a0ec849b'>
      <member-type access='private'>
        <typedef-decl name='void_function' type-id='953b12f8' filepath='./src/gperftools/heap-checker.h' line='405' column='1' id='51b28737'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='heap_cleanups_' type-id='62757739' mangled-name='_ZN11HeapCleaner14heap_cleanups_E' visibility='default' filepath='./src/gperftools/heap-checker.h' line='409' column='1' elf-symbol-id='_ZN11HeapCleaner14heap_cleanups_E'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapCleaner' mangled-name='_ZN11HeapCleanerC1EPFvvE' filepath='./src/gperftools/heap-checker.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleanerC1EPFvvE'>
          <parameter type-id='947a2e7b' is-artificial='yes'/>
          <parameter type-id='51b28737'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RunHeapCleanups' mangled-name='_ZN11HeapCleaner15RunHeapCleanupsEv' filepath='./src/gperftools/heap-checker.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleaner15RunHeapCleanupsEv'>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='MallocHook_NewHook' type-id='9c29123d' filepath='./src/gperftools/malloc_hook_c.h' line='70' column='1' id='c1d78cf1'/>
    <typedef-decl name='MallocHook_DeleteHook' type-id='b7f9d8e6' filepath='./src/gperftools/malloc_hook_c.h' line='76' column='1' id='3c8a386c'/>
    <typedef-decl name='MallocHook_MmapHook' type-id='a3311677' filepath='./src/gperftools/malloc_hook_c.h' line='99' column='1' id='3277ae98'/>
    <typedef-decl name='MallocHook_SbrkHook' type-id='5c0fbf2d' filepath='./src/gperftools/malloc_hook_c.h' line='144' column='1' id='486cd879'/>
    <typedef-decl name='__intptr_t' type-id='bd54fe1a' filepath='/usr/include/bits/types.h' line='189' column='1' id='1f01f664'/>
    <typedef-decl name='off_t' type-id='79989e9c' filepath='/usr/include/sys/types.h' line='87' column='1' id='ad707ada'/>
    <typedef-decl name='_Atomic_word' type-id='95e97e5e' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/x86_64-redhat-linux/bits/atomic_word.h' line='32' column='1' id='e9464a99'/>
    <class-decl name='AddressMap&lt;HeapProfileTable::AllocValue&gt;' size-in-bits='320' visibility='default' filepath='src/addressmap-inl.h' line='104' column='1' id='dc94fbdc'>
      <member-type access='private'>
        <class-decl name='Cluster' is-struct='yes' visibility='default' is-declaration-only='yes' id='05987a9a'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='2469af9c'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Object' is-struct='yes' visibility='default' is-declaration-only='yes' id='569f7a8f'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='kBlockBits' type-id='2448a865' visibility='default' filepath='src/addressmap-inl.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kBlockSize' type-id='2448a865' visibility='default' filepath='src/addressmap-inl.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterBits' type-id='2448a865' visibility='default' filepath='src/addressmap-inl.h' line='172' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterSize' type-id='1e37e0e5' visibility='default' filepath='src/addressmap-inl.h' line='173' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterBlocks' type-id='2448a865' visibility='default' filepath='src/addressmap-inl.h' line='174' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashBits' type-id='2448a865' visibility='default' filepath='src/addressmap-inl.h' line='187' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashSize' type-id='2448a865' visibility='default' filepath='src/addressmap-inl.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_COUNT' type-id='2448a865' visibility='default' filepath='src/addressmap-inl.h' line='191' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='hashtable_' type-id='6070d486' visibility='default' filepath='src/addressmap-inl.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='free_' type-id='9247a46a' visibility='default' filepath='src/addressmap-inl.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashMultiplier' type-id='b9930aae' visibility='default' filepath='src/addressmap-inl.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='alloc_' type-id='311e6fc4' visibility='default' filepath='src/addressmap-inl.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='dealloc_' type-id='b7f9d8e6' visibility='default' filepath='src/addressmap-inl.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='allocated_' type-id='a8843877' visibility='default' filepath='src/addressmap-inl.h' line='253' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='AddressMap' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E' filepath='src/addressmap-inl.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='311e6fc4'/>
          <parameter type-id='b7f9d8e6'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~AddressMap' filepath='src/addressmap-inl.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;void (*)(const void*, const HeapProfileTable::AllocInfo&amp;)&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3b6e9181' is-artificial='yes'/>
          <parameter type-id='4bb201cb'/>
          <parameter type-id='15f452bf'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;char*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3b6e9181' is-artificial='yes'/>
          <parameter type-id='aad6e2f5'/>
          <parameter type-id='26a90f95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Cluster*&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='6070d486'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;HeapProfileTable::AddNonLiveArgs*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3b6e9181' is-artificial='yes'/>
          <parameter type-id='ec3d425d'/>
          <parameter type-id='34d3295d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;HeapProfileTable::Snapshot*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3b6e9181' is-artificial='yes'/>
          <parameter type-id='e344244e'/>
          <parameter type-id='5d35644a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Cluster&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='9c6c4508'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Entry&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='9247a46a'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;const HeapProfileTable::DumpArgs&amp;&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3b6e9181' is-artificial='yes'/>
          <parameter type-id='7bec8c9c'/>
          <parameter type-id='8a30c720'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;HeapProfileTable::Snapshot::ReportState*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3b6e9181' is-artificial='yes'/>
          <parameter type-id='a2ef60f5'/>
          <parameter type-id='7b898f5f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='HashInt' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE7HashIntEm' filepath='src/addressmap-inl.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7359adad'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BlockID' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE7BlockIDEm' filepath='src/addressmap-inl.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7359adad'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Find' mangled-name='_ZNK10AddressMapIN16HeapProfileTable10AllocValueEE4FindEPKv' filepath='src/addressmap-inl.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='3b6e9181' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='83c79f1b'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindInside' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE10FindInsideEPFmRKS1_EmPKvPS8_' filepath='src/addressmap-inl.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='ec3a43c9'/>
          <parameter type-id='7359adad'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='63e171df'/>
          <return type-id='83c79f1b'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAndRemove' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE13FindAndRemoveEPKvPS1_' filepath='src/addressmap-inl.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='17d36d40'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindMutable' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE11FindMutableEPKv' filepath='src/addressmap-inl.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='17d36d40'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindCluster' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE11FindClusterEmb' filepath='src/addressmap-inl.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='7359adad'/>
          <parameter type-id='c894953d'/>
          <return type-id='9c6c4508'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Insert' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_' filepath='src/addressmap-inl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_'>
          <parameter type-id='a3f591fa' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='6e92a022'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='GoogleInitializer' size-in-bits='128' visibility='default' filepath='src/base/googleinit.h' line='39' column='1' id='f91133d2'>
      <member-type access='private'>
        <typedef-decl name='VoidFunction' type-id='953b12f8' filepath='src/base/googleinit.h' line='41' column='1' id='b07535ab'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='name_' type-id='b99c00c9' visibility='default' filepath='src/base/googleinit.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='destructor_' type-id='abf2f5db' visibility='default' filepath='src/base/googleinit.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='GoogleInitializer' filepath='src/base/googleinit.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='d3a83870' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='b07535ab'/>
          <parameter type-id='b07535ab'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='d3a83870' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='LowLevelAlloc' size-in-bits='8' visibility='default' filepath='src/base/low_level_alloc.h' line='44' column='1' id='dc6bdcf2'>
      <member-type access='private'>
        <class-decl name='Arena' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='184' column='1' is-declaration-only='yes' id='1a1ef2e1'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='mu' type-id='e365906e' visibility='default' filepath='src/base/low_level_alloc.cc' line='189' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='freelist' type-id='0bc47fdf' visibility='default' filepath='src/base/low_level_alloc.cc' line='191' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2304'>
            <var-decl name='allocation_count' type-id='93e3c360' visibility='default' filepath='src/base/low_level_alloc.cc' line='192' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2336'>
            <var-decl name='flags' type-id='93e3c360' visibility='default' filepath='src/base/low_level_alloc.cc' line='193' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2368'>
            <var-decl name='pagesize' type-id='b59d7dce' visibility='default' filepath='src/base/low_level_alloc.cc' line='194' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2432'>
            <var-decl name='roundup' type-id='b59d7dce' visibility='default' filepath='src/base/low_level_alloc.cc' line='195' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2496'>
            <var-decl name='min_size' type-id='b59d7dce' visibility='default' filepath='src/base/low_level_alloc.cc' line='197' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='6af4b8a9' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='6af4b8a9' is-artificial='yes'/>
              <parameter type-id='95e97e5e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-function access='private' static='yes'>
        <function-decl name='DefaultArena' mangled-name='_ZN13LowLevelAlloc12DefaultArenaEv' filepath='./src/base/low_level_alloc.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc12DefaultArenaEv'>
          <return type-id='6af4b8a9'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocWithArena' mangled-name='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE' filepath='./src/base/low_level_alloc.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE'>
          <parameter type-id='b59d7dce'/>
          <parameter type-id='6af4b8a9'/>
          <return type-id='eaa32e2f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NewArena' mangled-name='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE' filepath='./src/base/low_level_alloc.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE'>
          <parameter type-id='93e3c360'/>
          <parameter type-id='6af4b8a9'/>
          <return type-id='6af4b8a9'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Alloc' mangled-name='_ZN13LowLevelAlloc5AllocEm' filepath='./src/base/low_level_alloc.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc5AllocEm'>
          <parameter type-id='b59d7dce'/>
          <return type-id='eaa32e2f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Free' mangled-name='_ZN13LowLevelAlloc4FreeEPv' filepath='./src/base/low_level_alloc.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc4FreeEPv'>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DeleteArena' mangled-name='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE' filepath='./src/base/low_level_alloc.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE'>
          <parameter type-id='6af4b8a9'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='d0f5f72b'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='33d7fedb' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='33d7fedb' is-artificial='yes'/>
          <parameter type-id='5bf9b328'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='33d7fedb' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE7destroyEPS0_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='33d7fedb' is-artificial='yes'/>
          <parameter type-id='10a2efed'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='max_size' mangled-name='_ZNK13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE8max_sizeEv' filepath='src/base/stl_allocator.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='57f9acdc' is-artificial='yes'/>
          <return type-id='b59d7dce'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='33d7fedb' is-artificial='yes'/>
          <parameter type-id='7359adad'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='10a2efed'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE9constructEPS0_RKS0_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='33d7fedb' is-artificial='yes'/>
          <parameter type-id='10a2efed'/>
          <parameter type-id='c79d2ba8'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE10deallocateEPS0_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='33d7fedb' is-artificial='yes'/>
          <parameter type-id='10a2efed'/>
          <parameter type-id='7359adad'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='9c415209'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='bec89ef1' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='bec89ef1' is-artificial='yes'/>
          <parameter type-id='29365228'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='bec89ef1' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorIcN15HeapLeakChecker9AllocatorEE10deallocateEPcm' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='bec89ef1' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='7359adad'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorIcN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='bec89ef1' is-artificial='yes'/>
          <parameter type-id='7359adad'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='26a90f95'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='operator==' mangled-name='_ZNK13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEeqERKS2_' filepath='src/base/stl_allocator.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='25364bdc' is-artificial='yes'/>
          <parameter type-id='29365228'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='e44bd869'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92f96851' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92f96851' is-artificial='yes'/>
          <parameter type-id='888175fe'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92f96851' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92f96851' is-artificial='yes'/>
          <parameter type-id='5bf91764'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorImN15HeapLeakChecker9AllocatorEE7destroyEPm' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92f96851' is-artificial='yes'/>
          <parameter type-id='1d2c2b85'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorImN15HeapLeakChecker9AllocatorEE9constructEPmRKm' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='92f96851' is-artificial='yes'/>
          <parameter type-id='1d2c2b85'/>
          <parameter type-id='edb35f90'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='bb19f54f'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e0084267' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e0084267' is-artificial='yes'/>
          <parameter type-id='5bf91764'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e0084267' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeImEN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e0084267' is-artificial='yes'/>
          <parameter type-id='7359adad'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='8e9d3dc9'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeImEN15HeapLeakChecker9AllocatorEE10deallocateEPS1_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e0084267' is-artificial='yes'/>
          <parameter type-id='8e9d3dc9'/>
          <parameter type-id='7359adad'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='c300dff9'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='95ad35f1' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='95ad35f1' is-artificial='yes'/>
          <parameter type-id='38aff684'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='95ad35f1' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKmN15HeapLeakChecker10RangeValueEEENS3_9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='95ad35f1' is-artificial='yes'/>
          <parameter type-id='7359adad'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='7a8e0f91'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKmN15HeapLeakChecker10RangeValueEEENS3_9AllocatorEE10deallocateEPS6_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='95ad35f1' is-artificial='yes'/>
          <parameter type-id='7a8e0f91'/>
          <parameter type-id='7359adad'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='a60ea383'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e728a5a3' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e728a5a3' is-artificial='yes'/>
          <parameter type-id='9d0ac156'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e728a5a3' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKmmEEN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e728a5a3' is-artificial='yes'/>
          <parameter type-id='7359adad'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='178932bf'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKmmEEN15HeapLeakChecker9AllocatorEE10deallocateEPS4_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='e728a5a3' is-artificial='yes'/>
          <parameter type-id='178932bf'/>
          <parameter type-id='7359adad'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='8ef2962b'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='8fd1da5b' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='8fd1da5b' is-artificial='yes'/>
          <parameter type-id='df7ff4d4'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='8fd1da5b' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKSbIcSt11char_traitsIcES_IcN15HeapLeakChecker9AllocatorEEESt6vectorI11AllocObjectS_ISA_S5_EEEES5_E8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='8fd1da5b' is-artificial='yes'/>
          <parameter type-id='7359adad'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='a9bc3eb9'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKSbIcSt11char_traitsIcES_IcN15HeapLeakChecker9AllocatorEEESt6vectorI11AllocObjectS_ISA_S5_EEEES5_E10deallocateEPSE_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='8fd1da5b' is-artificial='yes'/>
          <parameter type-id='a9bc3eb9'/>
          <parameter type-id='7359adad'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='c87f8e6f'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c85e63e7' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c85e63e7' is-artificial='yes'/>
          <parameter type-id='e33d9a44'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c85e63e7' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c85e63e7' is-artificial='yes'/>
          <parameter type-id='38aff684'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorISt4pairIKmN15HeapLeakChecker10RangeValueEENS2_9AllocatorEE9constructEPS4_RKS4_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c85e63e7' is-artificial='yes'/>
          <parameter type-id='9ff1e779'/>
          <parameter type-id='51f198b4'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorISt4pairIKmN15HeapLeakChecker10RangeValueEENS2_9AllocatorEE7destroyEPS4_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c85e63e7' is-artificial='yes'/>
          <parameter type-id='9ff1e779'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='44d57f15'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='f83a4825' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='f83a4825' is-artificial='yes'/>
          <parameter type-id='77c60736'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='f83a4825' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='f83a4825' is-artificial='yes'/>
          <parameter type-id='9d0ac156'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorISt4pairIKmmEN15HeapLeakChecker9AllocatorEE7destroyEPS2_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='f83a4825' is-artificial='yes'/>
          <parameter type-id='57d0d7c7'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorISt4pairIKmmEN15HeapLeakChecker9AllocatorEE9constructEPS2_RKS2_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='f83a4825' is-artificial='yes'/>
          <parameter type-id='57d0d7c7'/>
          <parameter type-id='b48ab0be'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='828121bd'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='24a1721d' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='24a1721d' is-artificial='yes'/>
          <parameter type-id='3dd52998'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='24a1721d' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='24a1721d' is-artificial='yes'/>
          <parameter type-id='df7ff4d4'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorISt4pairIKSbIcSt11char_traitsIcES_IcN15HeapLeakChecker9AllocatorEEESt6vectorI11AllocObjectS_IS9_S4_EEES4_E7destroyEPSC_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='24a1721d' is-artificial='yes'/>
          <parameter type-id='e2e8e815'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorISt4pairIKSbIcSt11char_traitsIcES_IcN15HeapLeakChecker9AllocatorEEESt6vectorI11AllocObjectS_IS9_S4_EEES4_E9constructEPSC_RKSC_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='24a1721d' is-artificial='yes'/>
          <parameter type-id='e2e8e815'/>
          <parameter type-id='c2628ba6'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;void*, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='a5fe7ec5'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='dffe3ea5' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='dffe3ea5' is-artificial='yes'/>
          <parameter type-id='b4733f76'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='dffe3ea5' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE7destroyEPS0_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='dffe3ea5' is-artificial='yes'/>
          <parameter type-id='63e171df'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='max_size' mangled-name='_ZNK13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE8max_sizeEv' filepath='src/base/stl_allocator.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='c073525a' is-artificial='yes'/>
          <return type-id='b59d7dce'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='dffe3ea5' is-artificial='yes'/>
          <parameter type-id='7359adad'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='63e171df'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE9constructEPS0_RKS0_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='dffe3ea5' is-artificial='yes'/>
          <parameter type-id='63e171df'/>
          <parameter type-id='7ecd9eee'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE10deallocateEPS0_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='dffe3ea5' is-artificial='yes'/>
          <parameter type-id='63e171df'/>
          <parameter type-id='7359adad'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='HeapLeakChecker' size-in-bits='448' visibility='default' filepath='src/gperftools/heap-checker.h' line='78' column='1' id='e8cff54b'>
      <member-type access='private'>
        <class-decl name='Disabler' size-in-bits='8' visibility='default' filepath='./src/gperftools/heap-checker.h' line='175' column='1' id='e06c20cd'>
          <member-function access='private' constructor='yes'>
            <function-decl name='Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerC1Ev' filepath='./src/gperftools/heap-checker.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerC1Ev'>
              <parameter type-id='eb2530dd' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <function-decl name='~Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerD1Ev' filepath='./src/gperftools/heap-checker.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerD1Ev'>
              <parameter type-id='eb2530dd' is-artificial='yes'/>
              <parameter type-id='95e97e5e' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='Disabler' filepath='./src/gperftools/heap-checker.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='eb2530dd' is-artificial='yes'/>
              <parameter type-id='ea3e054c'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ShouldSymbolize' filepath='./src/gperftools/heap-checker.h' line='225' column='1' id='3d43d3e7'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='SYMBOLIZE' value='0'/>
          <enumerator name='DO_NOT_SYMBOLIZE' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsTask' filepath='./src/gperftools/heap-checker.h' line='295' column='1' id='75676752'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='RECORD_GLOBAL_DATA' value='0'/>
          <enumerator name='DISABLE_LIBRARY_ALLOCS' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsResult' filepath='./src/gperftools/heap-checker.h' line='301' column='1' id='7c8e205a'>
          <underlying-type type-id='9cac1fee'/>
          <enumerator name='PROC_MAPS_USED' value='0'/>
          <enumerator name='CANT_OPEN_PROC_MAPS' value='1'/>
          <enumerator name='NO_SHARED_LIBS_IN_PROC_MAPS' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Allocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='292' column='1' id='3b82bea4'>
          <data-member access='private' static='yes'>
            <var-decl name='arena_' type-id='6af4b8a9' mangled-name='_ZN15HeapLeakChecker9Allocator6arena_E' visibility='default' filepath='src/heap-checker.cc' line='333' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator6arena_E'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='alloc_count_' type-id='95e97e5e' mangled-name='_ZN15HeapLeakChecker9Allocator12alloc_count_E' visibility='default' filepath='src/heap-checker.cc' line='334' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator12alloc_count_E'/>
          </data-member>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;DisabledRangeMap&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='d707c3f8'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;GlobalRegionCallerRangeMap&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='c87e882c'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;HeapProfileTable&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='438a5390'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNullIfNot&lt;DisabledRangeMap&gt;' filepath='src/heap-checker.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='d707c3f8'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;LibraryLiveObjectsStacks&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='e5425d57'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;LiveObjectsStack&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='a19513e7'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;StackTopSet&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='6e5f77ea'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNullIfNot&lt;GlobalRegionCallerRangeMap&gt;' filepath='src/heap-checker.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='c87e882c'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Free' mangled-name='_ZN15HeapLeakChecker9Allocator4FreeEPvm' filepath='src/heap-checker.cc' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='eaa32e2f'/>
              <parameter type-id='b59d7dce'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Shutdown' mangled-name='_ZN15HeapLeakChecker9Allocator8ShutdownEv' filepath='src/heap-checker.cc' line='299' column='1' visibility='default' binding='global' size-in-bits='64'>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Init' mangled-name='_ZN15HeapLeakChecker9Allocator4InitEv' filepath='src/heap-checker.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='alloc_count' mangled-name='_ZN15HeapLeakChecker9Allocator11alloc_countEv' filepath='src/heap-checker.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
              <return type-id='95e97e5e'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Allocate' mangled-name='_ZN15HeapLeakChecker9Allocator8AllocateEm' filepath='src/heap-checker.cc' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator8AllocateEm'>
              <parameter type-id='b59d7dce'/>
              <return type-id='eaa32e2f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Free' mangled-name='_ZN15HeapLeakChecker9Allocator4FreeEPv' filepath='src/heap-checker.cc' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator4FreeEPv'>
              <parameter type-id='eaa32e2f'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RangeValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='404' column='1' id='7214ad81'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_address' type-id='e475ab95' visibility='default' filepath='src/heap-checker.cc' line='405' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='max_depth' type-id='95e97e5e' visibility='default' filepath='src/heap-checker.cc' line='406' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='lock_' type-id='09157954' visibility='default' filepath='./src/gperftools/heap-checker.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='name_' type-id='80f4b756' visibility='default' filepath='./src/gperftools/heap-checker.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='start_snapshot_' type-id='eaa32e2f' visibility='default' filepath='./src/gperftools/heap-checker.h' line='365' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='has_checked_' type-id='c894953d' visibility='default' filepath='./src/gperftools/heap-checker.h' line='367' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='inuse_bytes_increase_' type-id='79a0948f' visibility='default' filepath='./src/gperftools/heap-checker.h' line='368' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='inuse_allocs_increase_' type-id='79a0948f' visibility='default' filepath='./src/gperftools/heap-checker.h' line='369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='keep_profiles_' type-id='c894953d' visibility='default' filepath='./src/gperftools/heap-checker.h' line='371' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1EPKc' filepath='./src/gperftools/heap-checker.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1EPKc'>
          <parameter type-id='686c81ab' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerD1Ev' filepath='./src/gperftools/heap-checker.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerD1Ev'>
          <parameter type-id='686c81ab' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1Ev' filepath='./src/gperftools/heap-checker.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1Ev'>
          <parameter type-id='686c81ab' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' filepath='./src/gperftools/heap-checker.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='686c81ab' is-artificial='yes'/>
          <parameter type-id='b4840fee'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreObject&lt;char&gt;' filepath='./src/gperftools/heap-checker.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='26a90f95'/>
          <return type-id='26a90f95'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksIn' mangled-name='_ZN15HeapLeakChecker15DisableChecksInEPKc' filepath='./src/gperftools/heap-checker.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DisableChecksInEPKc'>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeforeConstructorsLocked' mangled-name='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv' filepath='./src/gperftools/heap-checker.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv'>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeProfileNameLocked' mangled-name='_ZN15HeapLeakChecker21MakeProfileNameLockedEv' filepath='./src/gperftools/heap-checker.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker21MakeProfileNameLockedEv'>
          <parameter type-id='686c81ab' is-artificial='yes'/>
          <return type-id='26a90f95'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksFromToLocked' mangled-name='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i' filepath='./src/gperftools/heap-checker.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableLibraryAllocsLocked' mangled-name='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm' filepath='./src/gperftools/heap-checker.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm'>
          <parameter type-id='80f4b756'/>
          <parameter type-id='e475ab95'/>
          <parameter type-id='e475ab95'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='TurnItselfOffLocked' mangled-name='_ZN15HeapLeakChecker19TurnItselfOffLockedEv' filepath='./src/gperftools/heap-checker.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker19TurnItselfOffLockedEv'>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='HaveOnHeapLocked' mangled-name='_ZN15HeapLeakChecker16HaveOnHeapLockedEPPKvPm' filepath='./src/gperftools/heap-checker.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='63e171df'/>
          <parameter type-id='78c01427'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_' filepath='./src/gperftools/heap-checker.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_'>
          <parameter type-id='80f4b756'/>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetAllocCaller' mangled-name='_ZN15HeapLeakChecker14GetAllocCallerEPv' filepath='./src/gperftools/heap-checker.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14GetAllocCallerEPv'>
          <parameter type-id='eaa32e2f'/>
          <return type-id='eaa32e2f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CancelGlobalCheck' mangled-name='_ZN15HeapLeakChecker17CancelGlobalCheckEv' filepath='./src/gperftools/heap-checker.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17CancelGlobalCheckEv'>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GlobalChecker' mangled-name='_ZN15HeapLeakChecker13GlobalCheckerEv' filepath='./src/gperftools/heap-checker.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13GlobalCheckerEv'>
          <return type-id='686c81ab'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsActive' mangled-name='_ZN15HeapLeakChecker8IsActiveEv' filepath='./src/gperftools/heap-checker.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8IsActiveEv'>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ObjectsLeaked' mangled-name='_ZNK15HeapLeakChecker13ObjectsLeakedEv' filepath='./src/gperftools/heap-checker.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker13ObjectsLeakedEv'>
          <parameter type-id='b08409a2' is-artificial='yes'/>
          <return type-id='79a0948f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='BytesLeaked' mangled-name='_ZNK15HeapLeakChecker11BytesLeakedEv' filepath='./src/gperftools/heap-checker.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker11BytesLeakedEv'>
          <parameter type-id='b08409a2' is-artificial='yes'/>
          <return type-id='79a0948f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnIgnoreObject' mangled-name='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv' filepath='./src/gperftools/heap-checker.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv'>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreNonThreadLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv' filepath='./src/gperftools/heap-checker.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv'>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoIgnoreObject' mangled-name='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv' filepath='./src/gperftools/heap-checker.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv'>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Create' mangled-name='_ZN15HeapLeakChecker6CreateEPKcb' filepath='./src/gperftools/heap-checker.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker6CreateEPKcb'>
          <parameter type-id='686c81ab' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='c894953d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UseProcMapsLocked' mangled-name='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE' filepath='./src/gperftools/heap-checker.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE'>
          <parameter type-id='75676752'/>
          <return type-id='7c8e205a'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveThreadsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag' filepath='./src/gperftools/heap-checker.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='6d654359'/>
          <parameter type-id='38f76a2a'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreAllLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv' filepath='./src/gperftools/heap-checker.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv'>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoNoLeaks' mangled-name='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE' filepath='./src/gperftools/heap-checker.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE'>
          <parameter type-id='686c81ab' is-artificial='yes'/>
          <parameter type-id='3d43d3e7'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaksMaybeSymbolize' mangled-name='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE' filepath='./src/gperftools/heap-checker.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE'>
          <parameter type-id='3d43d3e7'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaks' mangled-name='_ZN15HeapLeakChecker13NoGlobalLeaksEv' filepath='./src/gperftools/heap-checker.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13NoGlobalLeaksEv'>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoMainHeapCheck' mangled-name='_ZN15HeapLeakChecker15DoMainHeapCheckEv' filepath='./src/gperftools/heap-checker.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DoMainHeapCheckEv'>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreObject&lt;MallocExtension&gt;' filepath='src/gperftools/heap-checker.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='370715b8'/>
          <return type-id='370715b8'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='ObjectPlacement' filepath='src/heap-checker.cc' line='345' column='1' id='8f3e6c86'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='MUST_BE_ON_HEAP' value='0'/>
      <enumerator name='IGNORED_ON_HEAP' value='1'/>
      <enumerator name='MAYBE_LIVE' value='2'/>
      <enumerator name='IN_GLOBAL_DATA' value='3'/>
      <enumerator name='THREAD_DATA' value='4'/>
      <enumerator name='THREAD_REGISTERS' value='5'/>
    </enum-decl>
    <class-decl name='AllocObject' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='356' column='1' id='148243dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='eaa32e2f' visibility='default' filepath='src/heap-checker.cc' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='e475ab95' visibility='default' filepath='src/heap-checker.cc' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='place' type-id='8f3e6c86' visibility='default' filepath='src/heap-checker.cc' line='359' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AllocObject' filepath='src/heap-checker.cc' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='10a2efed' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='b59d7dce'/>
          <parameter type-id='8f3e6c86'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='LiveObjectsStack' type-id='1e7cc497' filepath='src/heap-checker.cc' line='384' column='1' id='0afdb7f2'/>
    <typedef-decl name='LibraryLiveObjectsStacks' type-id='11357ce2' filepath='src/heap-checker.cc' line='397' column='1' id='0ded10e2'/>
    <typedef-decl name='DisabledRangeMap' type-id='6f7efc5c' filepath='src/heap-checker.cc' line='411' column='1' id='c79f2635'/>
    <typedef-decl name='StackTopSet' type-id='5cf30ede' filepath='src/heap-checker.cc' line='422' column='1' id='9724640d'/>
    <typedef-decl name='GlobalRegionCallerRangeMap' type-id='8644cc80' filepath='src/heap-checker.cc' line='432' column='1' id='660f30b9'/>
    <class-decl name='HeapProfileStats' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='54' column='1' id='5b5dd52b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocs' type-id='93e3c360' visibility='default' filepath='src/heap-profile-stats.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='frees' type-id='93e3c360' visibility='default' filepath='src/heap-profile-stats.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='alloc_size' type-id='27dc5d97' visibility='default' filepath='src/heap-profile-stats.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='free_size' type-id='27dc5d97' visibility='default' filepath='src/heap-profile-stats.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileBucket' size-in-bits='448' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='68' column='1' id='41b9aeb6'>
      <base-class access='public' layout-offset-in-bits='0' type-id='5b5dd52b'/>
      <data-member access='public' static='yes'>
        <var-decl name='kMaxStackDepth' type-id='2448a865' visibility='default' filepath='src/heap-profile-stats.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='e475ab95' visibility='default' filepath='src/heap-profile-stats.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='depth' type-id='95e97e5e' visibility='default' filepath='src/heap-profile-stats.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stack' type-id='63e171df' visibility='default' filepath='src/heap-profile-stats.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='next' type-id='576d93cc' visibility='default' filepath='src/heap-profile-stats.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileTable' size-in-bits='832' visibility='default' filepath='src/heap-profile-table.h' line='51' column='1' id='244d980c'>
      <member-type access='private'>
        <class-decl name='AllocInfo' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='66' column='1' id='0117298d'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='object_size' type-id='b59d7dce' visibility='default' filepath='src/heap-profile-table.h' line='67' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='call_stack' type-id='7acd98a2' visibility='default' filepath='src/heap-profile-table.h' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='stack_depth' type-id='95e97e5e' visibility='default' filepath='src/heap-profile-table.h' line='69' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='live' type-id='c894953d' visibility='default' filepath='src/heap-profile-table.h' line='70' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='168'>
            <var-decl name='ignored' type-id='c894953d' visibility='default' filepath='src/heap-profile-table.h' line='71' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocContextInfo' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='77' column='1' id='8c7763c8'>
          <base-class access='public' layout-offset-in-bits='0' type-id='5b5dd52b'/>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='stack_depth' type-id='95e97e5e' visibility='default' filepath='src/heap-profile-table.h' line='78' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='call_stack' type-id='7acd98a2' visibility='default' filepath='src/heap-profile-table.h' line='79' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='Allocator' type-id='5a7caabb' filepath='src/heap-profile-table.h' line='83' column='1' id='1c352ff6'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='DeAllocator' type-id='b7f9d8e6' filepath='src/heap-profile-table.h' line='84' column='1' id='6704d4af'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocIterator' type-id='15f452bf' filepath='src/heap-profile-table.h' line='138' column='1' id='e9108960'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocContextIterator' type-id='2d42efec' filepath='src/heap-profile-table.h' line='147' column='1' id='20e0dbaf'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='190' column='1' id='6e92a022'>
          <member-type access='private'>
            <typedef-decl name='Bucket' type-id='41b9aeb6' filepath='src/heap-profile-table.h' line='187' column='1' id='69c37139'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='bytes' type-id='b59d7dce' visibility='default' filepath='src/heap-profile-table.h' line='197' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kLive' type-id='2448a865' visibility='default' filepath='src/heap-profile-table.h' line='214' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kIgnore' type-id='2448a865' visibility='default' filepath='src/heap-profile-table.h' line='215' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kMask' type-id='2448a865' visibility='default' filepath='src/heap-profile-table.h' line='216' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='bucket_rep' type-id='e475ab95' visibility='default' filepath='src/heap-profile-table.h' line='218' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='bucket' mangled-name='_ZNK16HeapProfileTable10AllocValue6bucketEv' filepath='src/heap-profile-table.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='83c79f1b' is-artificial='yes'/>
              <return type-id='aba65f26'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='live' mangled-name='_ZNK16HeapProfileTable10AllocValue4liveEv' filepath='src/heap-profile-table.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='83c79f1b' is-artificial='yes'/>
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ignore' mangled-name='_ZNK16HeapProfileTable10AllocValue6ignoreEv' filepath='src/heap-profile-table.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='83c79f1b' is-artificial='yes'/>
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='set_ignore' mangled-name='_ZN16HeapProfileTable10AllocValue10set_ignoreEb' filepath='src/heap-profile-table.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='17d36d40' is-artificial='yes'/>
              <parameter type-id='c894953d'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='set_live' mangled-name='_ZN16HeapProfileTable10AllocValue8set_liveEb' filepath='src/heap-profile-table.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='17d36d40' is-artificial='yes'/>
              <parameter type-id='c894953d'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='set_bucket' mangled-name='_ZN16HeapProfileTable10AllocValue10set_bucketEP17HeapProfileBucket' filepath='src/heap-profile-table.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='17d36d40' is-artificial='yes'/>
              <parameter type-id='aba65f26'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocationMap' type-id='dc94fbdc' filepath='src/heap-profile-table.h' line='224' column='1' id='19fde1bb'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='BufferArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='227' column='1' id='5c83fcc3'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf' type-id='26a90f95' visibility='default' filepath='src/heap-profile-table.h' line='234' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='buflen' type-id='95e97e5e' visibility='default' filepath='src/heap-profile-table.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='bufsize' type-id='95e97e5e' visibility='default' filepath='src/heap-profile-table.h' line='236' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='BufferArgs' filepath='src/heap-profile-table.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='4e1dcc73' is-artificial='yes'/>
              <parameter type-id='26a90f95'/>
              <parameter type-id='95e97e5e'/>
              <parameter type-id='95e97e5e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='BufferArgs' filepath='src/heap-profile-table.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='4e1dcc73' is-artificial='yes'/>
              <parameter type-id='a166fbd4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='DumpArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='242' column='1' id='1efd1d27'>
          <member-type access='public'>
            <typedef-decl name='Stats' type-id='5b5dd52b' filepath='src/heap-profile-table.h' line='63' column='1' id='5cc67539'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='fd' type-id='97ef4358' visibility='default' filepath='src/heap-profile-table.h' line='248' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='profile_stats' type-id='e0e09c68' visibility='default' filepath='src/heap-profile-table.h' line='249' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='DumpArgs' filepath='src/heap-profile-table.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='fbdd13ef' is-artificial='yes'/>
              <parameter type-id='97ef4358'/>
              <parameter type-id='e0e09c68'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AddNonLiveArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='305' column='1' id='ea2c782d'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='dest' type-id='5d35644a' visibility='default' filepath='src/heap-profile-table.h' line='306' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='base' type-id='5d35644a' visibility='default' filepath='src/heap-profile-table.h' line='307' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Snapshot' size-in-bits='768' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='347' column='1' id='ca1f7dac'>
          <member-type access='private'>
            <class-decl name='Entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='514' column='1' id='36f0adec'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='count' type-id='95e97e5e' visibility='default' filepath='src/heap-profile-table.cc' line='515' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='bytes' type-id='95e97e5e' visibility='default' filepath='src/heap-profile-table.cc' line='516' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='bucket' type-id='aba65f26' visibility='default' filepath='src/heap-profile-table.cc' line='517' column='1'/>
              </data-member>
              <member-function access='public' constructor='yes'>
                <function-decl name='Entry' filepath='src/heap-profile-table.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64'>
                  <parameter type-id='dfd84bba' is-artificial='yes'/>
                  <return type-id='48b5725f'/>
                </function-decl>
              </member-function>
              <member-function access='public'>
                <function-decl name='operator&lt;' mangled-name='_ZNK16HeapProfileTable8Snapshot5EntryltERKS1_' filepath='src/heap-profile-table.cc' line='521' column='1' visibility='default' binding='global' size-in-bits='64'>
                  <parameter type-id='1c2ce2a7' is-artificial='yes'/>
                  <parameter type-id='102ccfc3'/>
                  <return type-id='c894953d'/>
                </function-decl>
              </member-function>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <class-decl name='ReportState' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='528' column='1' id='269660b7'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='buckets_' type-id='57b881a9' visibility='default' filepath='src/heap-profile-table.cc' line='529' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='total_' type-id='69c37139' visibility='default' filepath='src/heap-profile-table.h' line='372' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='map_' type-id='19fde1bb' visibility='default' filepath='src/heap-profile-table.h' line='376' column='1'/>
          </data-member>
          <member-function access='private' constructor='yes'>
            <function-decl name='Snapshot' filepath='src/heap-profile-table.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='5d35644a' is-artificial='yes'/>
              <parameter type-id='1c352ff6'/>
              <parameter type-id='6704d4af'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='Snapshot' filepath='src/heap-profile-table.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='5d35644a' is-artificial='yes'/>
              <parameter type-id='5ea246ed'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='total' mangled-name='_ZNK16HeapProfileTable8Snapshot5totalEv' filepath='src/heap-profile-table.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='52a23409' is-artificial='yes'/>
              <return type-id='8828a5dd'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='Empty' mangled-name='_ZNK16HeapProfileTable8Snapshot5EmptyEv' filepath='src/heap-profile-table.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='52a23409' is-artificial='yes'/>
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='Add' mangled-name='_ZN16HeapProfileTable8Snapshot3AddEPKvRKNS_10AllocValueE' filepath='src/heap-profile-table.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='5d35644a' is-artificial='yes'/>
              <parameter type-id='eaa32e2f'/>
              <parameter type-id='7fc798cf'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='ReportObject' mangled-name='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc' filepath='src/heap-profile-table.h' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc'>
              <parameter type-id='eaa32e2f'/>
              <parameter type-id='17d36d40'/>
              <parameter type-id='26a90f95'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportIndividualObjects' mangled-name='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv' filepath='src/heap-profile-table.h' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv'>
              <parameter type-id='5d35644a' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='ReportCallback' mangled-name='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE' filepath='src/heap-profile-table.h' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE'>
              <parameter type-id='eaa32e2f'/>
              <parameter type-id='17d36d40'/>
              <parameter type-id='7b898f5f'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportLeaks' mangled-name='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b' filepath='src/heap-profile-table.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b'>
              <parameter type-id='5d35644a' is-artificial='yes'/>
              <parameter type-id='80f4b756'/>
              <parameter type-id='80f4b756'/>
              <parameter type-id='c894953d'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='kFileExt' type-id='e84913bd' mangled-name='_ZN16HeapProfileTable8kFileExtE' visibility='default' filepath='src/heap-profile-table.h' line='55' column='1' elf-symbol-id='_ZN16HeapProfileTable8kFileExtE'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kMaxStackDepth' type-id='2448a865' mangled-name='_ZN16HeapProfileTable14kMaxStackDepthE' visibility='default' filepath='src/heap-profile-table.h' line='58' column='1' elf-symbol-id='_ZN16HeapProfileTable14kMaxStackDepthE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='alloc_' type-id='1c352ff6' visibility='default' filepath='src/heap-profile-table.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='dealloc_' type-id='6704d4af' visibility='default' filepath='src/heap-profile-table.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='total_' type-id='69c37139' visibility='default' filepath='src/heap-profile-table.h' line='330' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='profile_mmap_' type-id='c894953d' visibility='default' filepath='src/heap-profile-table.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='bucket_table_' type-id='42e79fe4' visibility='default' filepath='src/heap-profile-table.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='num_buckets_' type-id='95e97e5e' visibility='default' filepath='src/heap-profile-table.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='address_map_' type-id='9a7abf66' visibility='default' filepath='src/heap-profile-table.h' line='342' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapProfileTable' mangled-name='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb' filepath='src/heap-profile-table.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='1c352ff6'/>
          <parameter type-id='6704d4af'/>
          <parameter type-id='c894953d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapProfileTable' mangled-name='_ZN16HeapProfileTableD1Ev' filepath='src/heap-profile-table.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableD1Ev'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='95e97e5e' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapProfileTable' filepath='src/heap-profile-table.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='8b011a1d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='total' mangled-name='_ZNK16HeapProfileTable5totalEv' filepath='src/heap-profile-table.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7f010739' is-artificial='yes'/>
          <return type-id='8828a5dd'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='IterateAllocs' mangled-name='_ZNK16HeapProfileTable13IterateAllocsEPFvPKvRKNS_9AllocInfoEE' filepath='src/heap-profile-table.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='7f010739' is-artificial='yes'/>
          <parameter type-id='e9108960'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MapArgsAllocIterator' mangled-name='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE' filepath='src/heap-profile-table.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='17d36d40'/>
          <parameter type-id='e9108960'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocValueSize' mangled-name='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE' filepath='src/heap-profile-table.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE'>
          <parameter type-id='7fc798cf'/>
          <return type-id='b59d7dce'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ReleaseSnapshot' mangled-name='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='5d35644a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnparseBucket' mangled-name='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats' filepath='src/heap-profile-table.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats'>
          <parameter type-id='f1ad917d'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='e0e09c68'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpNonLiveIterator' mangled-name='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE' filepath='src/heap-profile-table.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='17d36d40'/>
          <parameter type-id='8a30c720'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpBucketIterator' mangled-name='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE' filepath='src/heap-profile-table.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE'>
          <parameter type-id='e5ad7e99'/>
          <parameter type-id='4e1dcc73'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='GetBucket' mangled-name='_ZN16HeapProfileTable9GetBucketEiPKPKv' filepath='src/heap-profile-table.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable9GetBucketEiPKPKv'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='7acd98a2'/>
          <return type-id='aba65f26'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetCallerStackTrace' mangled-name='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv' filepath='src/heap-profile-table.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv'>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='63e171df'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeSortedBucketList' mangled-name='_ZNK16HeapProfileTable20MakeSortedBucketListEv' filepath='src/heap-profile-table.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable20MakeSortedBucketListEv'>
          <parameter type-id='7f010739' is-artificial='yes'/>
          <return type-id='42e79fe4'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='IterateOrderedAllocContexts' mangled-name='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE' filepath='src/heap-profile-table.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE'>
          <parameter type-id='7f010739' is-artificial='yes'/>
          <parameter type-id='20e0dbaf'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FillOrderedProfile' mangled-name='_ZNK16HeapProfileTable18FillOrderedProfileEPci' filepath='src/heap-profile-table.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable18FillOrderedProfileEPci'>
          <parameter type-id='7f010739' is-artificial='yes'/>
          <parameter type-id='26a90f95'/>
          <parameter type-id='95e97e5e'/>
          <return type-id='95e97e5e'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsIgnored' mangled-name='_ZN16HeapProfileTable13MarkAsIgnoredEPKv' filepath='src/heap-profile-table.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13MarkAsIgnoredEPKv'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='WriteProfile' mangled-name='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE' filepath='src/heap-profile-table.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE'>
          <parameter type-id='80f4b756'/>
          <parameter type-id='f1ad917d'/>
          <parameter type-id='9a7abf66'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindInsideAlloc' mangled-name='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm' filepath='src/heap-profile-table.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm'>
          <parameter type-id='7f010739' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='b59d7dce'/>
          <parameter type-id='63e171df'/>
          <parameter type-id='78c01427'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddToSnapshot' mangled-name='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE' filepath='src/heap-profile-table.h' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='17d36d40'/>
          <parameter type-id='5d35644a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TakeSnapshot' mangled-name='_ZN16HeapProfileTable12TakeSnapshotEv' filepath='src/heap-profile-table.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12TakeSnapshotEv'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <return type-id='5d35644a'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordAlloc' mangled-name='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_' filepath='src/heap-profile-table.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='b59d7dce'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='7acd98a2'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordFree' mangled-name='_ZN16HeapProfileTable10RecordFreeEPKv' filepath='src/heap-profile-table.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10RecordFreeEPKv'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddIfNonLive' mangled-name='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE' filepath='src/heap-profile-table.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='17d36d40'/>
          <parameter type-id='34d3295d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NonLiveSnapshot' mangled-name='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='5d35644a'/>
          <return type-id='5d35644a'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsLive' mangled-name='_ZN16HeapProfileTable10MarkAsLiveEPKv' filepath='src/heap-profile-table.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10MarkAsLiveEPKv'>
          <parameter type-id='5eb2d81a' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CleanupOldProfiles' mangled-name='_ZN16HeapProfileTable18CleanupOldProfilesEPKc' filepath='src/heap-profile-table.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18CleanupOldProfilesEPKc'>
          <parameter type-id='80f4b756'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAllocDetails' mangled-name='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE' filepath='src/heap-profile-table.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE'>
          <parameter type-id='7f010739' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='275d561d'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAlloc' mangled-name='_ZNK16HeapProfileTable9FindAllocEPKvPm' filepath='src/heap-profile-table.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable9FindAllocEPKvPm'>
          <parameter type-id='7f010739' is-artificial='yes'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='78c01427'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MemoryRegionMap' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='69' column='1' id='06ace17c'>
      <member-type access='private'>
        <union-decl name='RegionSetRep' size-in-bits='384' visibility='default' filepath='src/memory_region_map.cc' line='177' column='1' id='bc1568e0'>
          <data-member access='public'>
            <var-decl name='rep' type-id='36d7f119' visibility='default' filepath='src/memory_region_map.cc' line='178' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='align_it' type-id='eaa32e2f' visibility='default' filepath='src/memory_region_map.cc' line='179' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='LockHolder' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='126' column='1' id='8003b961'>
          <member-function access='private' constructor='yes'>
            <function-decl name='LockHolder' filepath='src/memory_region_map.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='c1fe9299' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <function-decl name='~LockHolder' filepath='src/memory_region_map.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='c1fe9299' is-artificial='yes'/>
              <parameter type-id='95e97e5e' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='LockHolder' filepath='src/memory_region_map.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='c1fe9299' is-artificial='yes'/>
              <parameter type-id='a8cdcfc8'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Region' size-in-bits='2304' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='137' column='1' id='2404252c'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_addr' type-id='e475ab95' visibility='default' filepath='src/memory_region_map.h' line='138' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='end_addr' type-id='e475ab95' visibility='default' filepath='src/memory_region_map.h' line='139' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='call_stack_depth' type-id='95e97e5e' visibility='default' filepath='src/memory_region_map.h' line='140' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='call_stack' type-id='72e15f00' visibility='default' filepath='src/memory_region_map.h' line='141' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2240'>
            <var-decl name='is_stack' type-id='c894953d' visibility='default' filepath='src/memory_region_map.h' line='143' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='caller' mangled-name='_ZNK15MemoryRegionMap6Region6callerEv' filepath='src/memory_region_map.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='ab61b9cf' is-artificial='yes'/>
              <return type-id='e475ab95'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='AssertIsConsistent' mangled-name='_ZNK15MemoryRegionMap6Region18AssertIsConsistentEv' filepath='src/memory_region_map.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='ab61b9cf' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='SetRegionSetKey' mangled-name='_ZN15MemoryRegionMap6Region15SetRegionSetKeyEm' filepath='src/memory_region_map.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='06e4f26a' is-artificial='yes'/>
              <parameter type-id='e475ab95'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='set_end_addr' mangled-name='_ZN15MemoryRegionMap6Region12set_end_addrEm' filepath='src/memory_region_map.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='06e4f26a' is-artificial='yes'/>
              <parameter type-id='e475ab95'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='set_start_addr' mangled-name='_ZN15MemoryRegionMap6Region14set_start_addrEm' filepath='src/memory_region_map.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='06e4f26a' is-artificial='yes'/>
              <parameter type-id='e475ab95'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='Create' mangled-name='_ZN15MemoryRegionMap6Region6CreateEPKvm' filepath='src/memory_region_map.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='06e4f26a' is-artificial='yes'/>
              <parameter type-id='eaa32e2f'/>
              <parameter type-id='b59d7dce'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='set_call_stack_depth' mangled-name='_ZN15MemoryRegionMap6Region20set_call_stack_depthEi' filepath='src/memory_region_map.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='06e4f26a' is-artificial='yes'/>
              <parameter type-id='95e97e5e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='set_is_stack' mangled-name='_ZN15MemoryRegionMap6Region12set_is_stackEv' filepath='src/memory_region_map.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='06e4f26a' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RegionCmp' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='245' column='1' id='594bfa00'>
          <member-function access='public'>
            <function-decl name='operator()' mangled-name='_ZNK15MemoryRegionMap9RegionCmpclERKNS_6RegionES3_' filepath='src/memory_region_map.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='35bc3201' is-artificial='yes'/>
              <parameter type-id='af61c01b'/>
              <parameter type-id='af61c01b'/>
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='MyAllocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='252' column='1' id='90770afb'>
          <member-function access='public' static='yes'>
            <function-decl name='Free' mangled-name='_ZN15MemoryRegionMap11MyAllocator4FreeEPKvm' filepath='src/memory_region_map.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='eaa32e2f'/>
              <parameter type-id='b59d7dce'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Allocate' mangled-name='_ZN15MemoryRegionMap11MyAllocator8AllocateEm' filepath='src/memory_region_map.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='b59d7dce'/>
              <return type-id='eaa32e2f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionSet' type-id='bbd1e162' filepath='src/memory_region_map.h' line='263' column='1' id='e56758d5'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionIterator' type-id='f7ad9a4a' filepath='src/memory_region_map.h' line='268' column='1' id='96b1f315'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='client_count_' type-id='95e97e5e' mangled-name='_ZN15MemoryRegionMap13client_count_E' visibility='default' filepath='src/memory_region_map.h' line='292' column='1' elf-symbol-id='_ZN15MemoryRegionMap13client_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='max_stack_depth_' type-id='95e97e5e' mangled-name='_ZN15MemoryRegionMap16max_stack_depth_E' visibility='default' filepath='src/memory_region_map.h' line='295' column='1' elf-symbol-id='_ZN15MemoryRegionMap16max_stack_depth_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='arena_' type-id='6af4b8a9' mangled-name='_ZN15MemoryRegionMap6arena_E' visibility='default' filepath='src/memory_region_map.h' line='298' column='1' elf-symbol-id='_ZN15MemoryRegionMap6arena_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='regions_' type-id='aa123952' mangled-name='_ZN15MemoryRegionMap8regions_E' visibility='default' filepath='src/memory_region_map.h' line='306' column='1' elf-symbol-id='_ZN15MemoryRegionMap8regions_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='lock_' type-id='e365906e' mangled-name='_ZN15MemoryRegionMap5lock_E' visibility='default' filepath='src/memory_region_map.h' line='309' column='1' elf-symbol-id='_ZN15MemoryRegionMap5lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='owner_lock_' type-id='e365906e' mangled-name='_ZN15MemoryRegionMap11owner_lock_E' visibility='default' filepath='src/memory_region_map.h' line='311' column='1' elf-symbol-id='_ZN15MemoryRegionMap11owner_lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='recursion_count_' type-id='95e97e5e' mangled-name='_ZN15MemoryRegionMap16recursion_count_E' visibility='default' filepath='src/memory_region_map.h' line='314' column='1' elf-symbol-id='_ZN15MemoryRegionMap16recursion_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='lock_owner_tid_' type-id='4051f5e7' mangled-name='_ZN15MemoryRegionMap15lock_owner_tid_E' visibility='default' filepath='src/memory_region_map.h' line='316' column='1' elf-symbol-id='_ZN15MemoryRegionMap15lock_owner_tid_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='map_size_' type-id='27dc5d97' mangled-name='_ZN15MemoryRegionMap9map_size_E' visibility='default' filepath='src/memory_region_map.h' line='319' column='1' elf-symbol-id='_ZN15MemoryRegionMap9map_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='unmap_size_' type-id='27dc5d97' mangled-name='_ZN15MemoryRegionMap11unmap_size_E' visibility='default' filepath='src/memory_region_map.h' line='321' column='1' elf-symbol-id='_ZN15MemoryRegionMap11unmap_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='bucket_table_' type-id='877fd312' mangled-name='_ZN15MemoryRegionMap13bucket_table_E' visibility='default' filepath='src/memory_region_map.h' line='324' column='1' elf-symbol-id='_ZN15MemoryRegionMap13bucket_table_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='num_buckets_' type-id='95e97e5e' mangled-name='_ZN15MemoryRegionMap12num_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='325' column='1' elf-symbol-id='_ZN15MemoryRegionMap12num_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_count_' type-id='95e97e5e' mangled-name='_ZN15MemoryRegionMap20saved_buckets_count_E' visibility='default' filepath='src/memory_region_map.h' line='337' column='1' elf-symbol-id='_ZN15MemoryRegionMap20saved_buckets_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_' type-id='36e1d5b8' mangled-name='_ZN15MemoryRegionMap14saved_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='343' column='1' elf-symbol-id='_ZN15MemoryRegionMap14saved_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_keys_' type-id='5197861e' mangled-name='_ZN15MemoryRegionMap19saved_buckets_keys_E' visibility='default' filepath='src/memory_region_map.h' line='345' column='1' elf-symbol-id='_ZN15MemoryRegionMap19saved_buckets_keys_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='IterateBuckets&lt;HeapProfileTable::BufferArgs*&gt;' filepath='src/memory_region_map.h' line='402' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='9f5b5cce'/>
          <parameter type-id='4e1dcc73'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='HandleSavedRegionsLocked' mangled-name='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE' filepath='src/memory_region_map.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE'>
          <parameter type-id='3d2bd6ee'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Unlock' mangled-name='_ZN15MemoryRegionMap6UnlockEv' filepath='src/memory_region_map.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap6UnlockEv'>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LockIsHeld' mangled-name='_ZN15MemoryRegionMap10LockIsHeldEv' filepath='src/memory_region_map.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10LockIsHeldEv'>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LogAllLocked' mangled-name='_ZN15MemoryRegionMap12LogAllLockedEv' filepath='src/memory_region_map.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap12LogAllLockedEv'>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoInsertRegionLocked' mangled-name='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.h' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE'>
          <parameter type-id='af61c01b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='EndRegionLocked' mangled-name='_ZN15MemoryRegionMap15EndRegionLockedEv' filepath='src/memory_region_map.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap15EndRegionLockedEv'>
          <return type-id='96b1f315'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeginRegionLocked' mangled-name='_ZN15MemoryRegionMap17BeginRegionLockedEv' filepath='src/memory_region_map.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17BeginRegionLockedEv'>
          <return type-id='96b1f315'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoFindRegionLocked' mangled-name='_ZN15MemoryRegionMap18DoFindRegionLockedEm' filepath='src/memory_region_map.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18DoFindRegionLockedEm'>
          <parameter type-id='e475ab95'/>
          <return type-id='ab61b9cf'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsRecordingLocked' mangled-name='_ZN15MemoryRegionMap17IsRecordingLockedEv' filepath='src/memory_region_map.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17IsRecordingLockedEv'>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Lock' mangled-name='_ZN15MemoryRegionMap4LockEv' filepath='src/memory_region_map.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4LockEv'>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindAndMarkStackRegion' mangled-name='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE' filepath='src/memory_region_map.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE'>
          <parameter type-id='e475ab95'/>
          <parameter type-id='06e4f26a'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindRegion' mangled-name='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE' filepath='src/memory_region_map.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE'>
          <parameter type-id='e475ab95'/>
          <parameter type-id='06e4f26a'/>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Shutdown' mangled-name='_ZN15MemoryRegionMap8ShutdownEv' filepath='src/memory_region_map.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8ShutdownEv'>
          <return type-id='c894953d'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Init' mangled-name='_ZN15MemoryRegionMap4InitEib' filepath='src/memory_region_map.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4InitEib'>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='c894953d'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RestoreSavedBucketsLocked' mangled-name='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv' filepath='src/memory_region_map.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv'>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetBucket' mangled-name='_ZN15MemoryRegionMap9GetBucketEiPKPKv' filepath='src/memory_region_map.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap9GetBucketEiPKPKv'>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='7acd98a2'/>
          <return type-id='576d93cc'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemovalInBucket' mangled-name='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm' filepath='src/memory_region_map.h' line='379' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm'>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='7acd98a2'/>
          <parameter type-id='b59d7dce'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='InsertRegionLocked' mangled-name='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE'>
          <parameter type-id='af61c01b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionAddition' mangled-name='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm' filepath='src/memory_region_map.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='b59d7dce'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MmapHook' mangled-name='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil' filepath='src/memory_region_map.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='b59d7dce'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='ad707ada'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemoval' mangled-name='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm' filepath='src/memory_region_map.h' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='b59d7dce'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MunmapHook' mangled-name='_ZN15MemoryRegionMap10MunmapHookEPKvm' filepath='src/memory_region_map.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MunmapHookEPKvm'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='b59d7dce'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='SbrkHook' mangled-name='_ZN15MemoryRegionMap8SbrkHookEPKvl' filepath='src/memory_region_map.h' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8SbrkHookEPKvl'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='fc84bffe'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MremapHook' mangled-name='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_' filepath='src/memory_region_map.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_'>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='eaa32e2f'/>
          <parameter type-id='b59d7dce'/>
          <parameter type-id='b59d7dce'/>
          <parameter type-id='95e97e5e'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='dc94fbdc' size-in-bits='64' id='a3f591fa'/>
    <pointer-type-def type-id='05987a9a' size-in-bits='64' id='9c6c4508'/>
    <pointer-type-def type-id='9c6c4508' size-in-bits='64' id='6070d486'/>
    <pointer-type-def type-id='2469af9c' size-in-bits='64' id='9247a46a'/>
    <pointer-type-def type-id='569f7a8f' size-in-bits='64' id='a8843877'/>
    <reference-type-def kind='lvalue' type-id='148243dd' size-in-bits='64' id='04a2dd09'/>
    <pointer-type-def type-id='148243dd' size-in-bits='64' id='10a2efed'/>
    <qualified-type-def type-id='10a2efed' const='yes' id='9cbc6242'/>
    <reference-type-def kind='lvalue' type-id='9cbc6242' size-in-bits='64' id='208ee36c'/>
    <reference-type-def kind='lvalue' type-id='10a2efed' size-in-bits='64' id='fb7f7c91'/>
    <pointer-type-def type-id='c79f2635' size-in-bits='64' id='04e18702'/>
    <pointer-type-def type-id='04e18702' size-in-bits='64' id='d707c3f8'/>
    <pointer-type-def type-id='660f30b9' size-in-bits='64' id='1798228e'/>
    <pointer-type-def type-id='1798228e' size-in-bits='64' id='c87e882c'/>
    <pointer-type-def type-id='f91133d2' size-in-bits='64' id='d3a83870'/>
    <pointer-type-def type-id='a0ec849b' size-in-bits='64' id='947a2e7b'/>
    <pointer-type-def type-id='e8cff54b' size-in-bits='64' id='686c81ab'/>
    <pointer-type-def type-id='e06c20cd' size-in-bits='64' id='eb2530dd'/>
    <reference-type-def kind='lvalue' type-id='7214ad81' size-in-bits='64' id='d201f9cd'/>
    <pointer-type-def type-id='41b9aeb6' size-in-bits='64' id='576d93cc'/>
    <pointer-type-def type-id='244d980c' size-in-bits='64' id='5eb2d81a'/>
    <pointer-type-def type-id='5eb2d81a' size-in-bits='64' id='438a5390'/>
    <pointer-type-def type-id='ea2c782d' size-in-bits='64' id='34d3295d'/>
    <pointer-type-def type-id='0117298d' size-in-bits='64' id='275d561d'/>
    <pointer-type-def type-id='6e92a022' size-in-bits='64' id='17d36d40'/>
    <pointer-type-def type-id='69c37139' size-in-bits='64' id='aba65f26'/>
    <pointer-type-def type-id='aba65f26' size-in-bits='64' id='42e79fe4'/>
    <pointer-type-def type-id='19fde1bb' size-in-bits='64' id='9a7abf66'/>
    <pointer-type-def type-id='5c83fcc3' size-in-bits='64' id='4e1dcc73'/>
    <pointer-type-def type-id='1efd1d27' size-in-bits='64' id='fbdd13ef'/>
    <pointer-type-def type-id='5cc67539' size-in-bits='64' id='e0e09c68'/>
    <pointer-type-def type-id='ca1f7dac' size-in-bits='64' id='5d35644a'/>
    <pointer-type-def type-id='269660b7' size-in-bits='64' id='7b898f5f'/>
    <pointer-type-def type-id='0ded10e2' size-in-bits='64' id='53fd9f87'/>
    <pointer-type-def type-id='53fd9f87' size-in-bits='64' id='e5425d57'/>
    <pointer-type-def type-id='0afdb7f2' size-in-bits='64' id='625068f7'/>
    <pointer-type-def type-id='625068f7' size-in-bits='64' id='a19513e7'/>
    <pointer-type-def type-id='1a1ef2e1' size-in-bits='64' id='6af4b8a9'/>
    <pointer-type-def type-id='8003b961' size-in-bits='64' id='c1fe9299'/>
    <pointer-type-def type-id='2404252c' size-in-bits='64' id='06e4f26a'/>
    <reference-type-def kind='lvalue' type-id='d0f5f72b' size-in-bits='64' id='2fd7f88f'/>
    <pointer-type-def type-id='d0f5f72b' size-in-bits='64' id='33d7fedb'/>
    <pointer-type-def type-id='9c415209' size-in-bits='64' id='bec89ef1'/>
    <pointer-type-def type-id='e44bd869' size-in-bits='64' id='92f96851'/>
    <reference-type-def kind='lvalue' type-id='bb19f54f' size-in-bits='64' id='d4082f83'/>
    <pointer-type-def type-id='bb19f54f' size-in-bits='64' id='e0084267'/>
    <reference-type-def kind='lvalue' type-id='c300dff9' size-in-bits='64' id='91ad2fa5'/>
    <pointer-type-def type-id='c300dff9' size-in-bits='64' id='95ad35f1'/>
    <reference-type-def kind='lvalue' type-id='a60ea383' size-in-bits='64' id='f328b887'/>
    <pointer-type-def type-id='a60ea383' size-in-bits='64' id='e728a5a3'/>
    <reference-type-def kind='lvalue' type-id='8ef2962b' size-in-bits='64' id='8bd1d40f'/>
    <pointer-type-def type-id='8ef2962b' size-in-bits='64' id='8fd1da5b'/>
    <pointer-type-def type-id='c87f8e6f' size-in-bits='64' id='c85e63e7'/>
    <pointer-type-def type-id='44d57f15' size-in-bits='64' id='f83a4825'/>
    <pointer-type-def type-id='828121bd' size-in-bits='64' id='24a1721d'/>
    <reference-type-def kind='lvalue' type-id='a5fe7ec5' size-in-bits='64' id='e3fe44f1'/>
    <pointer-type-def type-id='a5fe7ec5' size-in-bits='64' id='dffe3ea5'/>
    <pointer-type-def type-id='9724640d' size-in-bits='64' id='b43fc284'/>
    <pointer-type-def type-id='b43fc284' size-in-bits='64' id='6e5f77ea'/>
    <reference-type-def kind='lvalue' type-id='d75219db' size-in-bits='64' id='35977aef'/>
    <pointer-type-def type-id='d75219db' size-in-bits='64' id='3997813b'/>
    <reference-type-def kind='lvalue' type-id='44f94458' size-in-bits='64' id='2c299b02'/>
    <pointer-type-def type-id='44f94458' size-in-bits='64' id='3029a14e'/>
    <reference-type-def kind='lvalue' type-id='725c97d5' size-in-bits='64' id='36643691'/>
    <pointer-type-def type-id='725c97d5' size-in-bits='64' id='32643045'/>
    <reference-type-def kind='lvalue' type-id='09c66679' size-in-bits='64' id='4dc26255'/>
    <pointer-type-def type-id='09c66679' size-in-bits='64' id='51c268a1'/>
    <pointer-type-def type-id='fe47021f' size-in-bits='64' id='51c50a97'/>
    <pointer-type-def type-id='ceafcbdf' size-in-bits='64' id='e29c18e7'/>
    <pointer-type-def type-id='3974a4b7' size-in-bits='64' id='5821de8f'/>
    <qualified-type-def type-id='dc94fbdc' const='yes' id='ba345d31'/>
    <pointer-type-def type-id='ba345d31' size-in-bits='64' id='3b6e9181'/>
    <qualified-type-def type-id='148243dd' const='yes' id='fe220e9e'/>
    <reference-type-def kind='lvalue' type-id='fe220e9e' size-in-bits='64' id='c79d2ba8'/>
    <pointer-type-def type-id='fe220e9e' size-in-bits='64' id='c39d255c'/>
    <qualified-type-def type-id='c39d255c' const='yes' id='0e5127c7'/>
    <reference-type-def kind='lvalue' type-id='0e5127c7' size-in-bits='64' id='6ac1c733'/>
    <qualified-type-def type-id='b07535ab' const='yes' id='abf2f5db'/>
    <qualified-type-def type-id='e8cff54b' const='yes' id='5b38dd3c'/>
    <reference-type-def kind='lvalue' type-id='5b38dd3c' size-in-bits='64' id='b4840fee'/>
    <pointer-type-def type-id='5b38dd3c' size-in-bits='64' id='b08409a2'/>
    <qualified-type-def type-id='e06c20cd' const='yes' id='43456522'/>
    <reference-type-def kind='lvalue' type-id='43456522' size-in-bits='64' id='ea3e054c'/>
    <qualified-type-def type-id='7214ad81' const='yes' id='356b5bf2'/>
    <reference-type-def kind='lvalue' type-id='356b5bf2' size-in-bits='64' id='ec018ebc'/>
    <qualified-type-def type-id='5b5dd52b' const='yes' id='c83a229a'/>
    <reference-type-def kind='lvalue' type-id='c83a229a' size-in-bits='64' id='ef84adf4'/>
    <pointer-type-def type-id='c83a229a' size-in-bits='64' id='e3849b10'/>
    <qualified-type-def type-id='244d980c' const='yes' id='5f4683a9'/>
    <reference-type-def kind='lvalue' type-id='5f4683a9' size-in-bits='64' id='8b011a1d'/>
    <pointer-type-def type-id='5f4683a9' size-in-bits='64' id='7f010739'/>
    <qualified-type-def type-id='8c7763c8' const='yes' id='d2870115'/>
    <reference-type-def kind='lvalue' type-id='d2870115' size-in-bits='64' id='9d86e349'/>
    <qualified-type-def type-id='0117298d' const='yes' id='b73cc5d2'/>
    <reference-type-def kind='lvalue' type-id='b73cc5d2' size-in-bits='64' id='68ab9f1c'/>
    <qualified-type-def type-id='6e92a022' const='yes' id='5b948173'/>
    <reference-type-def kind='lvalue' type-id='5b948173' size-in-bits='64' id='7fc798cf'/>
    <pointer-type-def type-id='5b948173' size-in-bits='64' id='83c79f1b'/>
    <qualified-type-def type-id='69c37139' const='yes' id='f7e84a89'/>
    <reference-type-def kind='lvalue' type-id='f7e84a89' size-in-bits='64' id='f1ad917d'/>
    <pointer-type-def type-id='f7e84a89' size-in-bits='64' id='e5ad7e99'/>
    <qualified-type-def type-id='5c83fcc3' const='yes' id='6d6ec97a'/>
    <reference-type-def kind='lvalue' type-id='6d6ec97a' size-in-bits='64' id='a166fbd4'/>
    <qualified-type-def type-id='1efd1d27' const='yes' id='97ed1046'/>
    <reference-type-def kind='lvalue' type-id='97ed1046' size-in-bits='64' id='8a30c720'/>
    <qualified-type-def type-id='5cc67539' const='yes' id='105720e9'/>
    <reference-type-def kind='lvalue' type-id='105720e9' size-in-bits='64' id='8828a5dd'/>
    <qualified-type-def type-id='ca1f7dac' const='yes' id='b083e559'/>
    <reference-type-def kind='lvalue' type-id='b083e559' size-in-bits='64' id='5ea246ed'/>
    <pointer-type-def type-id='b083e559' size-in-bits='64' id='52a23409'/>
    <qualified-type-def type-id='8003b961' const='yes' id='e5adee3e'/>
    <reference-type-def kind='lvalue' type-id='e5adee3e' size-in-bits='64' id='a8cdcfc8'/>
    <qualified-type-def type-id='2404252c' const='yes' id='ceaa7c7f'/>
    <reference-type-def kind='lvalue' type-id='ceaa7c7f' size-in-bits='64' id='af61c01b'/>
    <pointer-type-def type-id='ceaa7c7f' size-in-bits='64' id='ab61b9cf'/>
    <qualified-type-def type-id='d0f5f72b' const='yes' id='7826191e'/>
    <reference-type-def kind='lvalue' type-id='7826191e' size-in-bits='64' id='5bf9b328'/>
    <pointer-type-def type-id='7826191e' size-in-bits='64' id='57f9acdc'/>
    <qualified-type-def type-id='9c415209' const='yes' id='ba165e1e'/>
    <reference-type-def kind='lvalue' type-id='ba165e1e' size-in-bits='64' id='29365228'/>
    <pointer-type-def type-id='ba165e1e' size-in-bits='64' id='25364bdc'/>
    <qualified-type-def type-id='e44bd869' const='yes' id='8681e8ec'/>
    <reference-type-def kind='lvalue' type-id='8681e8ec' size-in-bits='64' id='888175fe'/>
    <pointer-type-def type-id='8681e8ec' size-in-bits='64' id='84816fb2'/>
    <qualified-type-def type-id='bb19f54f' const='yes' id='cef7b9aa'/>
    <reference-type-def kind='lvalue' type-id='cef7b9aa' size-in-bits='64' id='5bf91764'/>
    <pointer-type-def type-id='cef7b9aa' size-in-bits='64' id='4ff90480'/>
    <qualified-type-def type-id='c300dff9' const='yes' id='9c7551ca'/>
    <reference-type-def kind='lvalue' type-id='9c7551ca' size-in-bits='64' id='38aff684'/>
    <pointer-type-def type-id='9c7551ca' size-in-bits='64' id='2cafe3a0'/>
    <qualified-type-def type-id='a60ea383' const='yes' id='8f45e734'/>
    <reference-type-def kind='lvalue' type-id='8f45e734' size-in-bits='64' id='9d0ac156'/>
    <pointer-type-def type-id='8f45e734' size-in-bits='64' id='a90ad43a'/>
    <qualified-type-def type-id='8ef2962b' const='yes' id='64b18c7a'/>
    <reference-type-def kind='lvalue' type-id='64b18c7a' size-in-bits='64' id='df7ff4d4'/>
    <pointer-type-def type-id='64b18c7a' size-in-bits='64' id='d37fe1f0'/>
    <qualified-type-def type-id='c87f8e6f' const='yes' id='08b6770a'/>
    <reference-type-def kind='lvalue' type-id='08b6770a' size-in-bits='64' id='e33d9a44'/>
    <pointer-type-def type-id='08b6770a' size-in-bits='64' id='d73d8760'/>
    <qualified-type-def type-id='44d57f15' const='yes' id='b1b8b594'/>
    <reference-type-def kind='lvalue' type-id='b1b8b594' size-in-bits='64' id='77c60736'/>
    <pointer-type-def type-id='b1b8b594' size-in-bits='64' id='83c61a1a'/>
    <qualified-type-def type-id='828121bd' const='yes' id='dfbc8f2e'/>
    <reference-type-def kind='lvalue' type-id='dfbc8f2e' size-in-bits='64' id='3dd52998'/>
    <pointer-type-def type-id='dfbc8f2e' size-in-bits='64' id='39d5234c'/>
    <qualified-type-def type-id='a5fe7ec5' const='yes' id='f88ac454'/>
    <reference-type-def kind='lvalue' type-id='f88ac454' size-in-bits='64' id='b4733f76'/>
    <pointer-type-def type-id='f88ac454' size-in-bits='64' id='c073525a'/>
    <qualified-type-def type-id='d75219db' const='yes' id='f49d29e6'/>
    <reference-type-def kind='lvalue' type-id='f49d29e6' size-in-bits='64' id='d368b940'/>
    <pointer-type-def type-id='f49d29e6' size-in-bits='64' id='df68cc24'/>
    <qualified-type-def type-id='44f94458' const='yes' id='2876ba29'/>
    <reference-type-def kind='lvalue' type-id='2876ba29' size-in-bits='64' id='c1e6e59d'/>
    <pointer-type-def type-id='2876ba29' size-in-bits='64' id='b5e6d2b9'/>
    <qualified-type-def type-id='725c97d5' const='yes' id='65d38490'/>
    <reference-type-def kind='lvalue' type-id='65d38490' size-in-bits='64' id='01f9ea82'/>
    <pointer-type-def type-id='65d38490' size-in-bits='64' id='05f9f0ce'/>
    <qualified-type-def type-id='09c66679' const='yes' id='969cf320'/>
    <reference-type-def kind='lvalue' type-id='969cf320' size-in-bits='64' id='1f129272'/>
    <pointer-type-def type-id='969cf320' size-in-bits='64' id='231298be'/>
    <qualified-type-def type-id='fe47021f' const='yes' id='da8599da'/>
    <reference-type-def kind='lvalue' type-id='da8599da' size-in-bits='64' id='fc5167b4'/>
    <pointer-type-def type-id='da8599da' size-in-bits='64' id='f05154d0'/>
    <qualified-type-def type-id='ceafcbdf' const='yes' id='189691de'/>
    <pointer-type-def type-id='189691de' size-in-bits='64' id='a907c31c'/>
    <qualified-type-def type-id='3974a4b7' const='yes' id='3209d89a'/>
    <pointer-type-def type-id='3209d89a' size-in-bits='64' id='75801d10'/>
    <reference-type-def kind='lvalue' type-id='4ab96a04' size-in-bits='64' id='c3e21386'/>
    <qualified-type-def type-id='80f4b756' const='yes' id='b99c00c9'/>
    <reference-type-def kind='lvalue' type-id='b99c00c9' size-in-bits='64' id='1f95783d'/>
    <reference-type-def kind='lvalue' type-id='d0fa5dde' size-in-bits='64' id='f221ed68'/>
    <qualified-type-def type-id='1745035d' const='yes' id='c02a8c06'/>
    <pointer-type-def type-id='c02a8c06' size-in-bits='64' id='aefaa944'/>
    <qualified-type-def type-id='46f91d7a' const='yes' id='7bc8bb1d'/>
    <reference-type-def kind='lvalue' type-id='7bc8bb1d' size-in-bits='64' id='17febde1'/>
    <pointer-type-def type-id='7bc8bb1d' size-in-bits='64' id='13feb795'/>
    <qualified-type-def type-id='60e799ae' const='yes' id='e5550c35'/>
    <reference-type-def kind='lvalue' type-id='e5550c35' size-in-bits='64' id='17e201e9'/>
    <pointer-type-def type-id='e5550c35' size-in-bits='64' id='23e214cd'/>
    <qualified-type-def type-id='e4aa0a20' const='yes' id='7bf91a3b'/>
    <reference-type-def kind='lvalue' type-id='7bf91a3b' size-in-bits='64' id='46241ba7'/>
    <pointer-type-def type-id='7bf91a3b' size-in-bits='64' id='3a2408c3'/>
    <qualified-type-def type-id='252c9b86' const='yes' id='274be9c1'/>
    <reference-type-def kind='lvalue' type-id='274be9c1' size-in-bits='64' id='c38136a5'/>
    <pointer-type-def type-id='274be9c1' size-in-bits='64' id='c7813cf1'/>
    <qualified-type-def type-id='f7ad9a4a' const='yes' id='2370dd7d'/>
    <reference-type-def kind='lvalue' type-id='2370dd7d' size-in-bits='64' id='25ac7641'/>
    <pointer-type-def type-id='2370dd7d' size-in-bits='64' id='21ac6ff5'/>
    <qualified-type-def type-id='a23801d7' const='yes' id='d49ec504'/>
    <reference-type-def kind='lvalue' type-id='d49ec504' size-in-bits='64' id='d7f05486'/>
    <pointer-type-def type-id='d49ec504' size-in-bits='64' id='e3f0676a'/>
    <qualified-type-def type-id='92e470fb' const='yes' id='1824ba8e'/>
    <reference-type-def kind='lvalue' type-id='1824ba8e' size-in-bits='64' id='a9d1d678'/>
    <pointer-type-def type-id='1824ba8e' size-in-bits='64' id='a5d1d02c'/>
    <qualified-type-def type-id='eadd9fcd' const='yes' id='47c43500'/>
    <reference-type-def kind='lvalue' type-id='47c43500' size-in-bits='64' id='1fdfaad2'/>
    <pointer-type-def type-id='47c43500' size-in-bits='64' id='23dfb11e'/>
    <qualified-type-def type-id='0e38b3ef' const='yes' id='96809be0'/>
    <reference-type-def kind='lvalue' type-id='96809be0' size-in-bits='64' id='b27538b2'/>
    <pointer-type-def type-id='96809be0' size-in-bits='64' id='b6753efe'/>
    <qualified-type-def type-id='e90651ee' const='yes' id='b00b5e39'/>
    <reference-type-def kind='lvalue' type-id='b00b5e39' size-in-bits='64' id='40e52acd'/>
    <qualified-type-def type-id='f37f1f93' const='yes' id='b9ddfd48'/>
    <reference-type-def kind='lvalue' type-id='b9ddfd48' size-in-bits='64' id='0675f42a'/>
    <pointer-type-def type-id='b9ddfd48' size-in-bits='64' id='fa75e146'/>
    <qualified-type-def type-id='8a3ba5af' const='yes' id='2d0f254a'/>
    <reference-type-def kind='lvalue' type-id='2d0f254a' size-in-bits='64' id='5ad7e904'/>
    <pointer-type-def type-id='2d0f254a' size-in-bits='64' id='4ed7d620'/>
    <qualified-type-def type-id='361d6991' const='yes' id='eac4585c'/>
    <reference-type-def kind='lvalue' type-id='eac4585c' size-in-bits='64' id='0d17480e'/>
    <pointer-type-def type-id='eac4585c' size-in-bits='64' id='091741c2'/>
    <qualified-type-def type-id='da22b15b' const='yes' id='0ef08bf4'/>
    <reference-type-def kind='lvalue' type-id='0ef08bf4' size-in-bits='64' id='56ac1b96'/>
    <pointer-type-def type-id='0ef08bf4' size-in-bits='64' id='62ac2e7a'/>
    <qualified-type-def type-id='dea01c04' const='yes' id='3586ceab'/>
    <pointer-type-def type-id='3586ceab' size-in-bits='64' id='c4371513'/>
    <qualified-type-def type-id='a4dd3ec1' const='yes' id='59d2ffba'/>
    <reference-type-def kind='lvalue' type-id='59d2ffba' size-in-bits='64' id='03286294'/>
    <pointer-type-def type-id='59d2ffba' size-in-bits='64' id='f7284fb0'/>
    <qualified-type-def type-id='4cbe9669' const='yes' id='1c02c318'/>
    <reference-type-def kind='lvalue' type-id='1c02c318' size-in-bits='64' id='56595a9a'/>
    <pointer-type-def type-id='1c02c318' size-in-bits='64' id='4a5947b6'/>
    <qualified-type-def type-id='c1d92d67' const='yes' id='adcf3de6'/>
    <reference-type-def kind='lvalue' type-id='adcf3de6' size-in-bits='64' id='5d3e3540'/>
    <pointer-type-def type-id='adcf3de6' size-in-bits='64' id='693e4824'/>
    <qualified-type-def type-id='e3328cb1' const='yes' id='bc2daede'/>
    <reference-type-def kind='lvalue' type-id='bc2daede' size-in-bits='64' id='33ea7068'/>
    <pointer-type-def type-id='bc2daede' size-in-bits='64' id='2fea6a1c'/>
    <qualified-type-def type-id='2ca858ff' const='yes' id='2704f2e0'/>
    <pointer-type-def type-id='2704f2e0' size-in-bits='64' id='36ca33fe'/>
    <qualified-type-def type-id='377be541' const='yes' id='1069ec86'/>
    <pointer-type-def type-id='1069ec86' size-in-bits='64' id='82bf92c4'/>
    <qualified-type-def type-id='ccb7cbaf' const='yes' id='94a21f88'/>
    <pointer-type-def type-id='94a21f88' size-in-bits='64' id='9d37cc06'/>
    <qualified-type-def type-id='5eb18fc9' const='yes' id='b3b6f098'/>
    <pointer-type-def type-id='b3b6f098' size-in-bits='64' id='9afce836'/>
    <qualified-type-def type-id='5a16679e' const='yes' id='76df53f1'/>
    <pointer-type-def type-id='76df53f1' size-in-bits='64' id='fc9101c1'/>
    <qualified-type-def type-id='fac726be' const='yes' id='0ebccccf'/>
    <pointer-type-def type-id='0ebccccf' size-in-bits='64' id='18368c7f'/>
    <qualified-type-def type-id='49f01fba' const='yes' id='08a52291'/>
    <pointer-type-def type-id='08a52291' size-in-bits='64' id='56f5ac61'/>
    <qualified-type-def type-id='4137b645' const='yes' id='0d94c520'/>
    <reference-type-def kind='lvalue' type-id='0d94c520' size-in-bits='64' id='67322872'/>
    <qualified-type-def type-id='912a640b' const='yes' id='4996f41c'/>
    <reference-type-def kind='lvalue' type-id='4996f41c' size-in-bits='64' id='12a2774e'/>
    <pointer-type-def type-id='4996f41c' size-in-bits='64' id='0ea27102'/>
    <qualified-type-def type-id='3881a847' const='yes' id='740c1ca0'/>
    <pointer-type-def type-id='740c1ca0' size-in-bits='64' id='3910ed3e'/>
    <qualified-type-def type-id='34601093' const='yes' id='08a514ce'/>
    <pointer-type-def type-id='08a514ce' size-in-bits='64' id='7fdfe2ec'/>
    <qualified-type-def type-id='d3b6d5a2' const='yes' id='1c751112'/>
    <reference-type-def kind='lvalue' type-id='1c751112' size-in-bits='64' id='004a14dc'/>
    <pointer-type-def type-id='1c751112' size-in-bits='64' id='044a1b28'/>
    <qualified-type-def type-id='e967275f' const='yes' id='dda95aaf'/>
    <reference-type-def kind='lvalue' type-id='dda95aaf' size-in-bits='64' id='7a9985ab'/>
    <qualified-type-def type-id='41f6eaf7' const='yes' id='badd00aa'/>
    <reference-type-def kind='lvalue' type-id='badd00aa' size-in-bits='64' id='b5e7dc64'/>
    <pointer-type-def type-id='badd00aa' size-in-bits='64' id='a9e7c980'/>
    <qualified-type-def type-id='fc2dfda1' const='yes' id='4b1b63c6'/>
    <reference-type-def kind='lvalue' type-id='4b1b63c6' size-in-bits='64' id='1c1e39a0'/>
    <pointer-type-def type-id='4b1b63c6' size-in-bits='64' id='281e4c84'/>
    <qualified-type-def type-id='6f7efc5c' const='yes' id='6b5f4687'/>
    <reference-type-def kind='lvalue' type-id='6b5f4687' size-in-bits='64' id='a7fc2f73'/>
    <pointer-type-def type-id='6b5f4687' size-in-bits='64' id='b3fc4257'/>
    <qualified-type-def type-id='8644cc80' const='yes' id='7a5c7b1b'/>
    <reference-type-def kind='lvalue' type-id='7a5c7b1b' size-in-bits='64' id='dc960107'/>
    <pointer-type-def type-id='7a5c7b1b' size-in-bits='64' id='d095ee23'/>
    <qualified-type-def type-id='11357ce2' const='yes' id='21769345'/>
    <reference-type-def kind='lvalue' type-id='21769345' size-in-bits='64' id='10aa04d9'/>
    <pointer-type-def type-id='21769345' size-in-bits='64' id='1caa17bd'/>
    <qualified-type-def type-id='0bfdea91' const='yes' id='1b8744da'/>
    <reference-type-def kind='lvalue' type-id='1b8744da' size-in-bits='64' id='51f198b4'/>
    <pointer-type-def type-id='1b8744da' size-in-bits='64' id='45f185d0'/>
    <qualified-type-def type-id='8843596f' const='yes' id='30b37b2c'/>
    <reference-type-def kind='lvalue' type-id='30b37b2c' size-in-bits='64' id='b48ab0be'/>
    <pointer-type-def type-id='30b37b2c' size-in-bits='64' id='b08aaa72'/>
    <qualified-type-def type-id='8fc4ed05' const='yes' id='55eaa5a4'/>
    <reference-type-def kind='lvalue' type-id='55eaa5a4' size-in-bits='64' id='c2628ba6'/>
    <pointer-type-def type-id='55eaa5a4' size-in-bits='64' id='ce629e8a'/>
    <qualified-type-def type-id='16477d12' const='yes' id='ec098279'/>
    <reference-type-def kind='lvalue' type-id='ec098279' size-in-bits='64' id='f1f83b8d'/>
    <qualified-type-def type-id='9f2b6334' const='yes' id='35c9e427'/>
    <reference-type-def kind='lvalue' type-id='35c9e427' size-in-bits='64' id='add1ed93'/>
    <qualified-type-def type-id='5cf30ede' const='yes' id='004dd9f3'/>
    <reference-type-def kind='lvalue' type-id='004dd9f3' size-in-bits='64' id='4f8dea4f'/>
    <pointer-type-def type-id='004dd9f3' size-in-bits='64' id='538df09b'/>
    <qualified-type-def type-id='1e7cc497' const='yes' id='8550ebe4'/>
    <reference-type-def kind='lvalue' type-id='8550ebe4' size-in-bits='64' id='a0632266'/>
    <pointer-type-def type-id='8550ebe4' size-in-bits='64' id='ac63354a'/>
    <qualified-type-def type-id='f149d491' const='yes' id='bfe05ab8'/>
    <reference-type-def kind='lvalue' type-id='bfe05ab8' size-in-bits='64' id='ac2ea6ba'/>
    <pointer-type-def type-id='bfe05ab8' size-in-bits='64' id='a02e93d6'/>
    <qualified-type-def type-id='9c3df377' const='yes' id='d202aac0'/>
    <reference-type-def kind='lvalue' type-id='d202aac0' size-in-bits='64' id='80330812'/>
    <pointer-type-def type-id='d202aac0' size-in-bits='64' id='84330e5e'/>
    <qualified-type-def type-id='8f92235e' const='yes' id='b9930aae'/>
    <pointer-type-def type-id='9cbd1c16' size-in-bits='64' id='f9b37274'/>
    <reference-type-def kind='lvalue' type-id='46f91d7a' size-in-bits='64' id='4c1f832c'/>
    <pointer-type-def type-id='46f91d7a' size-in-bits='64' id='501f8978'/>
    <pointer-type-def type-id='431da4b4' size-in-bits='64' id='3a097fd2'/>
    <reference-type-def kind='lvalue' type-id='60e799ae' size-in-bits='64' id='de2338f0'/>
    <pointer-type-def type-id='60e799ae' size-in-bits='64' id='ea234bd4'/>
    <pointer-type-def type-id='300f7548' size-in-bits='64' id='305c039e'/>
    <reference-type-def kind='lvalue' type-id='e4aa0a20' size-in-bits='64' id='08d7d79a'/>
    <pointer-type-def type-id='e4aa0a20' size-in-bits='64' id='fcd7c4b6'/>
    <pointer-type-def type-id='ca9fb5ee' size-in-bits='64' id='9453f934'/>
    <reference-type-def kind='lvalue' type-id='252c9b86' size-in-bits='64' id='40ec74a8'/>
    <pointer-type-def type-id='252c9b86' size-in-bits='64' id='3cec6e5c'/>
    <pointer-type-def type-id='9a704756' size-in-bits='64' id='1451204c'/>
    <reference-type-def kind='lvalue' type-id='f7ad9a4a' size-in-bits='64' id='5ea0da8c'/>
    <pointer-type-def type-id='f7ad9a4a' size-in-bits='64' id='62a0e0d8'/>
    <reference-type-def kind='lvalue' type-id='a23801d7' size-in-bits='64' id='fea4a19b'/>
    <pointer-type-def type-id='a23801d7' size-in-bits='64' id='faa49b4f'/>
    <reference-type-def kind='lvalue' type-id='92e470fb' size-in-bits='64' id='f216247f'/>
    <pointer-type-def type-id='92e470fb' size-in-bits='64' id='f6162acb'/>
    <reference-type-def kind='lvalue' type-id='eadd9fcd' size-in-bits='64' id='fa9adf39'/>
    <pointer-type-def type-id='eadd9fcd' size-in-bits='64' id='069af21d'/>
    <reference-type-def kind='lvalue' type-id='0e38b3ef' size-in-bits='64' id='07102943'/>
    <pointer-type-def type-id='0e38b3ef' size-in-bits='64' id='13103c27'/>
    <reference-type-def kind='lvalue' type-id='f37f1f93' size-in-bits='64' id='3233c8f7'/>
    <pointer-type-def type-id='f37f1f93' size-in-bits='64' id='2633b613'/>
    <reference-type-def kind='lvalue' type-id='8a3ba5af' size-in-bits='64' id='70251d93'/>
    <pointer-type-def type-id='8a3ba5af' size-in-bits='64' id='7c253077'/>
    <reference-type-def kind='lvalue' type-id='361d6991' size-in-bits='64' id='e0fcdc6d'/>
    <pointer-type-def type-id='361d6991' size-in-bits='64' id='d4fcc989'/>
    <reference-type-def kind='lvalue' type-id='da22b15b' size-in-bits='64' id='ae8c69ef'/>
    <pointer-type-def type-id='da22b15b' size-in-bits='64' id='b28c703b'/>
    <reference-type-def kind='lvalue' type-id='a4dd3ec1' size-in-bits='64' id='9a9d50ad'/>
    <pointer-type-def type-id='a4dd3ec1' size-in-bits='64' id='8e9d3dc9'/>
    <reference-type-def kind='lvalue' type-id='4cbe9669' size-in-bits='64' id='768e0945'/>
    <pointer-type-def type-id='4cbe9669' size-in-bits='64' id='7a8e0f91'/>
    <reference-type-def kind='lvalue' type-id='c1d92d67' size-in-bits='64' id='1b89390b'/>
    <pointer-type-def type-id='c1d92d67' size-in-bits='64' id='178932bf'/>
    <reference-type-def kind='lvalue' type-id='e3328cb1' size-in-bits='64' id='b5bc519d'/>
    <pointer-type-def type-id='e3328cb1' size-in-bits='64' id='a9bc3eb9'/>
    <pointer-type-def type-id='2ca858ff' size-in-bits='64' id='458526d7'/>
    <reference-type-def kind='lvalue' type-id='458526d7' size-in-bits='64' id='619c4d63'/>
    <pointer-type-def type-id='5a16679e' size-in-bits='64' id='105ff9c4'/>
    <pointer-type-def type-id='8af0f743' size-in-bits='64' id='c9852013'/>
    <pointer-type-def type-id='fac726be' size-in-bits='64' id='35dd9e14'/>
    <pointer-type-def type-id='457675a3' size-in-bits='64' id='b621f1e3'/>
    <pointer-type-def type-id='49f01fba' size-in-bits='64' id='64144a58'/>
    <pointer-type-def type-id='e12e1b4f' size-in-bits='64' id='d01ed827'/>
    <reference-type-def kind='lvalue' type-id='4137b645' size-in-bits='64' id='e5bf3951'/>
    <pointer-type-def type-id='4137b645' size-in-bits='64' id='e1bf3305'/>
    <reference-type-def kind='lvalue' type-id='912a640b' size-in-bits='64' id='c9b11c8f'/>
    <pointer-type-def type-id='912a640b' size-in-bits='64' id='cdb122db'/>
    <pointer-type-def type-id='5849e938' size-in-bits='64' id='6fd0a72e'/>
    <reference-type-def kind='lvalue' type-id='3881a847' size-in-bits='64' id='affd1c7b'/>
    <pointer-type-def type-id='3881a847' size-in-bits='64' id='abfd162f'/>
    <reference-type-def kind='lvalue' type-id='d3b6d5a2' size-in-bits='64' id='e28cef01'/>
    <pointer-type-def type-id='d3b6d5a2' size-in-bits='64' id='de8ce8b5'/>
    <reference-type-def kind='lvalue' type-id='6f7efc5c' size-in-bits='64' id='88f14a36'/>
    <pointer-type-def type-id='6f7efc5c' size-in-bits='64' id='94f15d1a'/>
    <reference-type-def kind='lvalue' type-id='8644cc80' size-in-bits='64' id='8b742bba'/>
    <pointer-type-def type-id='8644cc80' size-in-bits='64' id='7f7418d6'/>
    <reference-type-def kind='lvalue' type-id='11357ce2' size-in-bits='64' id='8b6cac14'/>
    <pointer-type-def type-id='11357ce2' size-in-bits='64' id='7f6c9930'/>
    <reference-type-def kind='lvalue' type-id='0bfdea91' size-in-bits='64' id='abf1fa5d'/>
    <pointer-type-def type-id='0bfdea91' size-in-bits='64' id='9ff1e779'/>
    <reference-type-def kind='lvalue' type-id='8843596f' size-in-bits='64' id='4bd0c4e3'/>
    <pointer-type-def type-id='8843596f' size-in-bits='64' id='57d0d7c7'/>
    <reference-type-def kind='lvalue' type-id='8fc4ed05' size-in-bits='64' id='e6e8ee61'/>
    <pointer-type-def type-id='8fc4ed05' size-in-bits='64' id='e2e8e815'/>
    <pointer-type-def type-id='16477d12' size-in-bits='64' id='ebf7bd20'/>
    <pointer-type-def type-id='9f2b6334' size-in-bits='64' id='2a769a02'/>
    <pointer-type-def type-id='9c481e6c' size-in-bits='64' id='a46e9bba'/>
    <pointer-type-def type-id='75be71bc' size-in-bits='64' id='d737015a'/>
    <pointer-type-def type-id='b9105a96' size-in-bits='64' id='191f14ac'/>
    <pointer-type-def type-id='c2082fb8' size-in-bits='64' id='f894605e'/>
    <pointer-type-def type-id='5a0240d0' size-in-bits='64' id='e3e034a6'/>
    <reference-type-def kind='lvalue' type-id='5cf30ede' size-in-bits='64' id='03e5f2e0'/>
    <pointer-type-def type-id='5cf30ede' size-in-bits='64' id='0fe605c4'/>
    <reference-type-def kind='lvalue' type-id='1e7cc497' size-in-bits='64' id='c292ad1b'/>
    <pointer-type-def type-id='1e7cc497' size-in-bits='64' id='be92a6cf'/>
    <reference-type-def kind='lvalue' type-id='f149d491' size-in-bits='64' id='6e758a1d'/>
    <pointer-type-def type-id='f149d491' size-in-bits='64' id='62757739'/>
    <reference-type-def kind='lvalue' type-id='9c3df377' size-in-bits='64' id='de4e907b'/>
    <pointer-type-def type-id='9c3df377' size-in-bits='64' id='da4e8a2f'/>
    <pointer-type-def type-id='f84368c5' size-in-bits='64' id='ec3a43c9'/>
    <reference-type-def kind='lvalue' type-id='7359adad' size-in-bits='64' id='212c31d1'/>
    <pointer-type-def type-id='7359adad' size-in-bits='64' id='1d2c2b85'/>
    <qualified-type-def type-id='953b12f8' const='yes' id='5d51038b'/>
    <reference-type-def kind='lvalue' type-id='5d51038b' size-in-bits='64' id='9388c957'/>
    <pointer-type-def type-id='5d51038b' size-in-bits='64' id='8788b673'/>
    <reference-type-def kind='lvalue' type-id='953b12f8' size-in-bits='64' id='c9feb37a'/>
    <pointer-type-def type-id='953b12f8' size-in-bits='64' id='bdfea096'/>
    <qualified-type-def type-id='bdfea096' const='yes' id='8fb9f989'/>
    <reference-type-def kind='lvalue' type-id='8fb9f989' size-in-bits='64' id='f0c40e7d'/>
    <pointer-type-def type-id='ce4b9f72' size-in-bits='64' id='2d42efec'/>
    <pointer-type-def type-id='3d6d5197' size-in-bits='64' id='4bb201cb'/>
    <pointer-type-def type-id='c201411b' size-in-bits='64' id='15f452bf'/>
    <pointer-type-def type-id='b456c7a1' size-in-bits='64' id='5c0fbf2d'/>
    <pointer-type-def type-id='5c0fbf2d' size-in-bits='64' id='f3c9b805'/>
    <pointer-type-def type-id='3b8296eb' size-in-bits='64' id='a3311677'/>
    <pointer-type-def type-id='a3311677' size-in-bits='64' id='43463467'/>
    <pointer-type-def type-id='848c08bf' size-in-bits='64' id='5a7caabb'/>
    <qualified-type-def type-id='eaa32e2f' const='yes' id='83be723c'/>
    <reference-type-def kind='lvalue' type-id='83be723c' size-in-bits='64' id='7ecd9eee'/>
    <pointer-type-def type-id='83be723c' size-in-bits='64' id='7acd98a2'/>
    <reference-type-def kind='lvalue' type-id='eaa32e2f' size-in-bits='64' id='67e1782b'/>
    <qualified-type-def type-id='63e171df' const='yes' id='4b4717ec'/>
    <reference-type-def kind='lvalue' type-id='4b4717ec' size-in-bits='64' id='4aea72fe'/>
    <namespace-decl name='std'>
      <class-decl name='allocator&lt;void (*)()&gt;' size-in-bits='8' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='87' column='1' id='4137b645'>
        <base-class access='public' layout-offset-in-bits='0' type-id='fe47021f'/>
        <member-function access='private'>
          <function-decl name='allocator' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e1bf3305' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e1bf3305' is-artificial='yes'/>
            <parameter type-id='67322872'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e1bf3305' is-artificial='yes'/>
            <parameter type-id='95e97e5e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__alloc_swap&lt;STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='148' column='1' id='d41226b9'>
        <member-function access='public' static='yes'>
          <function-decl name='_S_do_it' mangled-name='_ZNSt12__alloc_swapI13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEELb1EE8_S_do_itERS4_S6_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='2fd7f88f'/>
            <parameter type-id='2fd7f88f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='105' column='1' id='912a640b'>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='141' column='1' id='1280b18d'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='b59d7dce' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='142' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='b59d7dce' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='143' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='e9464a99' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='144' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='148' column='1' id='3881a847'>
            <base-class access='public' layout-offset-in-bits='0' type-id='1280b18d'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='d0fa5dde' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='51' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='9b45d938' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep11_S_terminalE' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='56' column='1' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep11_S_terminalE'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='314f9837' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep20_S_empty_rep_storageE' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='68' column='1' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep20_S_empty_rep_storageE'/>
            </data-member>
            <member-function access='public' static='yes'>
              <function-decl name='_S_empty_rep' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep12_S_empty_repEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='affd1c7b'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_set_sharable' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep15_M_set_sharableEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='abfd162f' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_refdata' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_refdataEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='abfd162f' is-artificial='yes'/>
                <return type-id='26a90f95'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_dispose' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_disposeERKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='abfd162f' is-artificial='yes'/>
                <parameter type-id='29365228'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_set_length_and_sharable' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep26_M_set_length_and_sharableEm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='abfd162f' is-artificial='yes'/>
                <parameter type-id='7359adad'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_is_leaked' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep12_M_is_leakedEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='3910ed3e' is-artificial='yes'/>
                <return type-id='c894953d'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_refcopy' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_refcopyEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='abfd162f' is-artificial='yes'/>
                <return type-id='26a90f95'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_clone' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep8_M_cloneERKS4_m' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='624' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='abfd162f' is-artificial='yes'/>
                <parameter type-id='29365228'/>
                <parameter type-id='7359adad'/>
                <return type-id='26a90f95'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_grab' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep7_M_grabERKS4_S8_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='abfd162f' is-artificial='yes'/>
                <parameter type-id='29365228'/>
                <parameter type-id='29365228'/>
                <return type-id='26a90f95'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_destroy' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_destroyERKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_destroyERKS4_'>
                <parameter type-id='abfd162f' is-artificial='yes'/>
                <parameter type-id='29365228'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_S_create' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep9_S_createEmmRKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep9_S_createEmmRKS4_'>
                <parameter type-id='7359adad'/>
                <parameter type-id='7359adad'/>
                <parameter type-id='29365228'/>
                <return type-id='abfd162f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='258' column='1' id='5849e938'>
            <base-class access='public' layout-offset-in-bits='0' type-id='9c415209'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='26a90f95' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='262' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Alloc_hider' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='6fd0a72e' is-artificial='yes'/>
                <parameter type-id='26a90f95'/>
                <parameter type-id='29365228'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='npos' type-id='d0fa5dde' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='270' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='5849e938' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='274' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='2144' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='cdb122db' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='cdb122db' is-artificial='yes'/>
            <parameter type-id='29365228'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC1ERKS5_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC1ERKS5_'>
            <parameter type-id='cdb122db' is-artificial='yes'/>
            <parameter type-id='12a2774e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='cdb122db' is-artificial='yes'/>
            <parameter type-id='12a2774e'/>
            <parameter type-id='7359adad'/>
            <parameter type-id='7359adad'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='cdb122db' is-artificial='yes'/>
            <parameter type-id='12a2774e'/>
            <parameter type-id='7359adad'/>
            <parameter type-id='7359adad'/>
            <parameter type-id='29365228'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='cdb122db' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='7359adad'/>
            <parameter type-id='29365228'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC2EPKcRKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC2EPKcRKS4_'>
            <parameter type-id='cdb122db' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='29365228'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='220' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='cdb122db' is-artificial='yes'/>
            <parameter type-id='7359adad'/>
            <parameter type-id='a84c031d'/>
            <parameter type-id='29365228'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEED1Ev' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEED1Ev'>
            <parameter type-id='cdb122db' is-artificial='yes'/>
            <parameter type-id='95e97e5e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;const char*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='80f4b756'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='29365228'/>
            <parameter type-id='ee723d41'/>
            <return type-id='26a90f95'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct_aux&lt;const char*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1539' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='80f4b756'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='29365228'/>
            <parameter type-id='b90ad1b0'/>
            <return type-id='26a90f95'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;const char*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1556' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='80f4b756'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='29365228'/>
            <return type-id='26a90f95'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_data' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE7_M_dataEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='0ea27102' is-artificial='yes'/>
            <return type-id='26a90f95'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_rep' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE6_M_repEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='0ea27102' is-artificial='yes'/>
            <return type-id='abfd162f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='get_allocator' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE13get_allocatorEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1629' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='0ea27102' is-artificial='yes'/>
            <return type-id='9c415209'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_M_copy' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE7_M_copyEPcPKcm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='26a90f95'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='7359adad'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='c_str' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE5c_strEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1612' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='0ea27102' is-artificial='yes'/>
            <return type-id='80f4b756'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_empty_rep' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE12_S_empty_repEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='affd1c7b'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_copy_chars' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE13_S_copy_charsEPcPKcS8_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='26a90f95'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='size' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4sizeEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='0ea27102' is-artificial='yes'/>
            <return type-id='b59d7dce'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='data' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4dataEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1622' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='0ea27102' is-artificial='yes'/>
            <return type-id='80f4b756'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_compare' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE10_S_compareEmm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='392' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='7359adad'/>
            <parameter type-id='7359adad'/>
            <return type-id='95e97e5e'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='compare' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE7compareERKS5_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='2019' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='0ea27102' is-artificial='yes'/>
            <parameter type-id='12a2774e'/>
            <return type-id='95e97e5e'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='char_traits&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='238' column='1' id='6382fa58'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='a84c031d' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='239' column='1' id='d3b6d5a2'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='95e97e5e' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='240' column='1' id='e967275f'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='assign' mangled-name='_ZNSt11char_traitsIcE6assignERcRKc' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='e28cef01'/>
            <parameter type-id='004a14dc'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='length' mangled-name='_ZNSt11char_traitsIcE6lengthEPKc' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='044a1b28'/>
            <return type-id='b59d7dce'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='copy' mangled-name='_ZNSt11char_traitsIcE4copyEPcPKcm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='de8ce8b5'/>
            <parameter type-id='044a1b28'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='de8ce8b5'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='compare' mangled-name='_ZNSt11char_traitsIcE7compareEPKcS2_m' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='044a1b28'/>
            <parameter type-id='044a1b28'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='95e97e5e'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__false_type' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/cpp_type_traits.h' line='79' column='1' id='b90ad1b0'/>
      <class-decl name='__niter_base&lt;AllocObject*, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='4472f53f'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__niter_baseIP11AllocObjectLb0EE3__bES1_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='10a2efed'/>
            <return type-id='10a2efed'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__niter_base&lt;__gnu_cxx::__normal_iterator&lt;AllocObject*, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='315f1740'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__niter_baseIN9__gnu_cxx17__normal_iteratorIP11AllocObjectSt6vectorIS2_13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEEEELb1EE3__bESA_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='d75219db'/>
            <return type-id='10a2efed'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__niter_base&lt;void (**)(), false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='d077ac5d'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__niter_baseIPPFvvELb0EE3__bES2_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='bdfea096'/>
            <return type-id='bdfea096'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__niter_base&lt;void**, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='42046449'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__niter_baseIPPvLb0EE3__bES1_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='63e171df'/>
            <return type-id='63e171df'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__miter_base&lt;AllocObject*, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='f309f26a'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__miter_baseIP11AllocObjectLb0EE3__bES1_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='10a2efed'/>
            <return type-id='10a2efed'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__miter_base&lt;__gnu_cxx::__normal_iterator&lt;AllocObject*, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='62fa38ac'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__miter_baseIN9__gnu_cxx17__normal_iteratorIP11AllocObjectSt6vectorIS2_13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEEEELb0EE3__bESA_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='d75219db'/>
            <return type-id='d75219db'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__miter_base&lt;void (**)(), false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='b568fbe2'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__miter_baseIPPFvvELb0EE3__bES2_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='bdfea096'/>
            <return type-id='bdfea096'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__miter_base&lt;void**, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='66c0d598'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__miter_baseIPPvLb0EE3__bES1_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='63e171df'/>
            <return type-id='63e171df'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__copy_move&lt;false, false, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='335' column='1' id='bd566a80'>
        <member-function access='public' static='yes'>
          <function-decl name='__copy_m&lt;AllocObject*, AllocObject*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='10a2efed'/>
            <parameter type-id='10a2efed'/>
            <parameter type-id='10a2efed'/>
            <return type-id='10a2efed'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__copy_move_backward&lt;false, false, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='539' column='1' id='319e57be'>
        <member-function access='public' static='yes'>
          <function-decl name='__copy_move_b&lt;AllocObject*, AllocObject*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='10a2efed'/>
            <parameter type-id='10a2efed'/>
            <parameter type-id='10a2efed'/>
            <return type-id='10a2efed'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='__copy_move_b&lt;HeapProfileTable::Snapshot::Entry*, HeapProfileTable::Snapshot::Entry*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='dfd84bba'/>
            <parameter type-id='dfd84bba'/>
            <parameter type-id='dfd84bba'/>
            <return type-id='dfd84bba'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='unary_function&lt;long unsigned int, long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='5f27e794'/>
      <class-decl name='unary_function&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, const long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='16b47b1b'/>
      <class-decl name='unary_function&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, const long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='e9f9c105'/>
      <class-decl name='unary_function&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='75d3a0ff'/>
      <class-decl name='binary_function&lt;long unsigned int, long unsigned int, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='113' column='1' id='c2980c96'/>
      <class-decl name='binary_function&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='113' column='1' id='95a857ee'/>
      <class-decl name='less&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='227' column='1' id='41f6eaf7'>
        <base-class access='public' layout-offset-in-bits='0' type-id='c2980c96'/>
        <member-function access='public'>
          <function-decl name='operator()' mangled-name='_ZNKSt4lessImEclERKmS2_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='a9e7c980' is-artificial='yes'/>
            <parameter type-id='edb35f90'/>
            <parameter type-id='edb35f90'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='less&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='227' column='1' id='fc2dfda1'>
        <base-class access='public' layout-offset-in-bits='0' type-id='95a857ee'/>
        <member-function access='public'>
          <function-decl name='operator()' mangled-name='_ZNKSt4lessISbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEEclERKS6_S9_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='281e4c84' is-artificial='yes'/>
            <parameter type-id='12a2774e'/>
            <parameter type-id='12a2774e'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Identity&lt;long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='469' column='1' id='1745035d'>
        <base-class access='public' layout-offset-in-bits='0' type-id='5f27e794'/>
        <member-function access='public'>
          <function-decl name='operator()' mangled-name='_ZNKSt9_IdentityImEclERKm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='475' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='aefaa944' is-artificial='yes'/>
            <parameter type-id='edb35f90'/>
            <return type-id='edb35f90'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Select1st&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='482' column='1' id='377be541'>
        <base-class access='public' layout-offset-in-bits='0' type-id='16b47b1b'/>
        <member-function access='public'>
          <function-decl name='operator()' mangled-name='_ZNKSt10_Select1stISt4pairIKmN15HeapLeakChecker10RangeValueEEEclERKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='82bf92c4' is-artificial='yes'/>
            <parameter type-id='51f198b4'/>
            <return type-id='edb35f90'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Select1st&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='482' column='1' id='ccb7cbaf'>
        <base-class access='public' layout-offset-in-bits='0' type-id='e9f9c105'/>
        <member-function access='public'>
